// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает список ошибок модели данных.
//
// Параметры:
//  МодельДанных - Структура, Массив - Проверяемый объект.
//  ИмяСхемы     - Строка - Имя схемы данных из спецификации.
//  Спецификация - Строка - Спецификация OpenAPI 3.0 в формате JSON.
// 
// Возвращаемое значение:
//  Структура - структура результата валидации. см.КонструкторРезультатВалидации
//
Функция Валидировать(Знач МодельДанных, Знач ИмяСхемы, Знач Спецификация) Экспорт // BSLLS:Typo-off
	
	Если МодельДанных = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Параметр МодельДанных не может быть Неопределено'");
	КонецЕсли;
	
	Если ИмяСхемы = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Параметр ИмяСхемы не может быть Неопределено'");
	КонецЕсли;
	
	Если Спецификация = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Параметр Спецификация не может быть Неопределено'");
	КонецЕсли;
	
	РезультатВалидации = ПолучитьПараметрыВалидации(Спецификация);
	СхемыДанныхСпецификации = пбп_ВалидаторПакетовПовтИсп.СхемыДанныхСпецификации(Спецификация);

	КлючИЗначение = Новый Структура("Ключ, Значение", ИмяСхемы, МодельДанных);
	
	ПроверитьСвойствоПоСхеме(РезультатВалидации, КлючИЗначение, СхемыДанныхСпецификации, Ложь);
	
	ВыполнитьПреобразованиеСтруктурыРезультатаЗавершение(РезультатВалидации);

	Возврат РезультатВалидации;
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыВалидации(Спецификация)
	
	ПараметрыВалидации = Новый Структура;
	
	ПараметрыВалидации.Вставить("Спецификация"			, Спецификация);
	ПараметрыВалидации.Вставить("Результат"				, Истина);
	ПараметрыВалидации.Вставить("Ошибки"				, Новый Массив);
	ПараметрыВалидации.Вставить("Предупреждения"		, Новый Массив); 
	ПараметрыВалидации.Вставить("ШаблонБазовойОшибки"	, "");
	ПараметрыВалидации.Вставить("ШаблонПредупреждения"	, "");
	
	Возврат ПараметрыВалидации;
	
КонецФункции

Процедура ПроверитьСвойствоПоСхеме(РезультатВалидации,
	Данные, ТекущийКонтекст, ОписаниеДополнительныхСвойств = Истина)
	
	ПроверяемаяСхема = ПолучитьПроверяемуюСхему(РезультатВалидации, Данные.Ключ, ТекущийКонтекст);
	Если ПроверяемаяСхема = Неопределено Тогда
		// Это доп.свойство
		ПроверяемаяСхема = ПолучитьСхемуДополнительныхСвойств(
			РезультатВалидации, ОписаниеДополнительныхСвойств, Данные.Ключ);
		
		Если Не ЗначениеЗаполнено(ПроверяемаяСхема) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	ВыполнитьВалидациюДанных(РезультатВалидации, Данные, ПроверяемаяСхема);
	
КонецПроцедуры

Процедура ВыполнитьПреобразованиеСтруктурыРезультатаЗавершение(РезультатВалидации)
	
	РезультатВалидации.Удалить("Спецификация");
	РезультатВалидации.Удалить("ШаблонБазовойОшибки");
	РезультатВалидации.Удалить("ШаблонПредупреждения");
	
	Для Каждого СтрокаОшибки Из РезультатВалидации.Ошибки Цикл
		СтрокаОшибки = НСтр(СтрокаОшибки);
	КонецЦикла;
	
	Для Каждого СтрокаПредупреждения Из РезультатВалидации.Предупреждения Цикл
		СтрокаОшибки = НСтр(СтрокаПредупреждения);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПроверяемуюСхему(РезультатВалидации, ИмяСхемы, ТекущийКонтекст)
	
	ПроверяемаяСхема = ТекущийКонтекст.Получить(ИмяСхемы);
	
	Если ПроверяемаяСхема = Неопределено Тогда
		// Если у нас на вход неопределено, значит такая схема не найдена. 
		// Это нормально, в случае если это неизвестное свойство. просто больше ничего не делаем
		Возврат ПроверяемаяСхема;
	КонецЕсли;
	
	ПроверяемаяСхема = РазыменоватьСхему(РезультатВалидации, ПроверяемаяСхема);
	
	Возврат ПроверяемаяСхема;
	
КонецФункции

Функция ПолучитьСхемуДополнительныхСвойств(РезультатВалидации, ОписаниеДополнительныхСвойств, ИмяСвойства)
	
	Если ОписаниеДополнительныхСвойств = Ложь Тогда
		// Доп.свойства нельзя, но схему не нашли. Зафиксируем ошибку.
		ТекстОшибки = СтрШаблон("ru = 'Не удалось найти свойство <%1> в схеме данных;'", ИмяСвойства);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
		Возврат Неопределено;
	КонецЕсли;

	Если ОписаниеДополнительныхСвойств = Истина Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат РазыменоватьСхему(РезультатВалидации, ОписаниеДополнительныхСвойств);
	
КонецФункции

Процедура ВыполнитьВалидациюДанных(РезультатВалидации, Данные, ПроверяемаяСхема)
	
	Если ЭтоСложнаяСхема(ПроверяемаяСхема) Тогда
		ОбработатьСложнуюСхему(РезультатВалидации, Данные, ПроверяемаяСхема);
	Иначе
		ВалидироватьДанныеПоСхеме(РезультатВалидации, Данные, ПроверяемаяСхема);
	КонецЕсли;
	
	ОбработатьNot(РезультатВалидации, Данные, ПроверяемаяСхема);
	
КонецПроцедуры

// Функция - Разыменовать схему
// Обрабатывает переданную схему.
// Получает необходимую схему по ссылке, если это требуется.
// Параметры:
//  ПроверяемаяСхема - Соответствие - Схема которую требуется разыменовать
//
// Возвращаемое значение:
// Соответствие  - Разыменованое соответствие
//
Функция РазыменоватьСхему(РезультатВалидации, ПроверяемаяСхема) Экспорт
	
	РазыменованнаяСхема = ПроверяемаяСхема;
	Если РазыменованнаяСхема = Неопределено Тогда
		// Если у нас на вход неопределено, значит такая схема не найдена. 
		// Это нормально, в случае если это неизвестное свойство. просто больше ничего не делаем
		Возврат РазыменованнаяСхема;
	КонецЕсли;
	
	СсылкаНаСхему = РазыменованнаяСхема.Получить("$ref");
	
	Если ЗначениеЗаполнено(СсылкаНаСхему) Тогда
		РазыменованнаяСхема = пбп_ВалидаторПакетовПовтИсп.СхемаПоСтроковомуПути(СсылкаНаСхему, РезультатВалидации.Спецификация);
	КонецЕсли;
	
	Возврат РазыменованнаяСхема;
	
КонецФункции

// Функция - Это сложная схема
//
// Параметры:
//  ПроверяемаяСхема - Соответствие	- Описание проверяемой схемы 
// 
// Возвращаемое значение:
//  Булево - Истина, если схема использует сложные конструкции
//
Функция ЭтоСложнаяСхема(ПроверяемаяСхема) Экспорт
	ЭтоOneOf = ЕстьСвойство("oneOf", ПроверяемаяСхема);
	ЭтоAllOf = ЕстьСвойство("allOf", ПроверяемаяСхема);
	ЭтоAnyOf = ЕстьСвойство("anyOf", ПроверяемаяСхема);
	
	Возврат ЭтоOneOf Или ЭтоAllOf Или ЭтоAnyOf;
КонецФункции

Функция ЕстьСвойство(ИмяСвойства, ПроверяемаяСхема)
	Возврат Не ПроверяемаяСхема.Получить(ИмяСвойства) = Неопределено;
КонецФункции

Процедура ВалидироватьДанныеПоСхеме(РезультатВалидации, Данные, ПроверяемаяСхема) // BSLLS:Typo-off
	
	УстановитьШаблоныСообщений(РезультатВалидации, Данные.Ключ,
							ПроверяемаяСхема.Получить("description"));
	Если Данные.Значение = Неопределено Или Данные.Значение = Null Тогда
		Nullable = ПроверяемаяСхема.Получить("nullable");
		Если Не Nullable = Истина Тогда
			ТекстОшибки = СтрШаблон("ru ='%1 Свойство <%2> объявлено, и должно быть заполнено, но это не так;'",
											РезультатВалидации.ШаблонБазовойОшибки,
											Данные.Ключ);
			РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	ТипонезависимыеПроверки(РезультатВалидации, Данные, ПроверяемаяСхема);
	Тип = ПроверяемаяСхема.Получить("type");
	Если Тип = Неопределено Тогда
		// Это anytype тут может быть все что угодно и это валидно.
		// см. https://swagger.io/docs/specification/v3_0/data-models/data-types/#any-type
		// Но для нас надо определиться какие проверки мы будем применять. Для этого найдем тип по типу значения.
		
		Тип = ПолучитьТипOpenApiПоЗначениюСвойства(Данные.Значение);
	КонецЕсли;
	
	Если Тип = "string" Тогда
		ВалидироватьСтроку(РезультатВалидации, Данные, ПроверяемаяСхема);
	ИначеЕсли Тип = "number" Тогда
		ВалидироватьЧисло(РезультатВалидации, Данные, ПроверяемаяСхема);
	ИначеЕсли Тип = "integer" Тогда
		ВалидироватьЧисло(РезультатВалидации, Данные, ПроверяемаяСхема, Истина);
	ИначеЕсли Тип = "array" Тогда
		ВалидироватьМассив(РезультатВалидации, Данные, ПроверяемаяСхема);
	ИначеЕсли Тип = "object" Тогда
		ВалидироватьОбъект(РезультатВалидации, Данные, ПроверяемаяСхема);
	ИначеЕсли Тип = "boolean" Тогда
		ВалидироватьБулево(РезультатВалидации, Данные, ПроверяемаяСхема);
	ИначеЕсли Тип = Неопределено Тогда
		// Значит мы получили какой-то непонятный тип, который хз как валидировать.
		// Зафиксируем ошибку и продолжим.
		ТекстОшибки = СтрШаблон("ru = '%1 Недопустимый тип значения <%2>. Список допустимых: <%3>;'",
				 						РезультатВалидации.ШаблонБазовойОшибки,
										ТипЗнч(Данные.Значение),
										СтрСоединить(МассивДопустимыхТипов1с(), "; "));
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
		Возврат;
	Иначе
		ТекстОшибки = СтрШаблон("ru = '%1 Ошибка при разборе схемы! Задано некорректное значение типа в <%2>;'",
										РезультатВалидации.ШаблонБазовойОшибки,
										Данные.Ключ);
		ЗаписьЖурналаРегистрации("пбп_ВалидаторПакетов", // BSLLS:Typo-off
										УровеньЖурналаРегистрации.Ошибка, , ,
										ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьШаблоныСообщений(РезультатВалидации, Имя, Описание)
	Представление = СтрШаблон("ru ='<%1>'", Имя);
	
	Если ЗначениеЗаполнено(Описание) Тогда
		Представление = СтрШаблон("ru = '<%1>(%2)'", Имя, Описание);
	КонецЕсли;
	
	РезультатВалидации.ШаблонБазовойОшибки = СтрШаблон("ru = 'Ошибка валидации %1.'", Представление);
	РезультатВалидации.ШаблонПредупреждения = СтрШаблон("ru = 'Проблема валидации %1.'", Представление);
КонецПроцедуры

Функция ТипЗначенияСоответствуетОписанию(РезультатВалидации, ЗначениеСвойства, ОписаниеТипа)

	ПриведенноеЗначениеСвойства = ОписаниеТипа.ПривестиЗначение(ЗначениеСвойства);
	
	ОжидаемыйТип = ТипЗнч(ПриведенноеЗначениеСвойства);
	ФактическийТип = ТипЗнч(ЗначениеСвойства);
	
	РазличаютсяТипы = ОжидаемыйТип <> ФактическийТип;
	
	Если РазличаютсяТипы Тогда
		ПредставлениеОжидаемыхТипов = СтрСоединить(ОписаниеТипа.Типы(), "; ");
		ТекстОшибки =
			СтрШаблон("ru = '%1 Передан тип <%2>. Список допустимых типов: <%3>;'",
						РезультатВалидации.ШаблонБазовойОшибки,
						ФактическийТип,
						ПредставлениеОжидаемыхТипов);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
	Если ПриведенноеЗначениеСвойства = ЗначениеСвойства Тогда
		// после приведения все совпадает. А значит тип подходит под схему.
		Возврат Истина;
	КонецЕсли;
		
	// Если мы здесь, значит отличаются Квалификаторы
	Если ФактическийТип = Тип("Дата") Тогда
		ИнкрементКвалификатора = СтрШаблон("ru = 'Некорректный формат даты. Ожидается <%1>;'",
								ОписаниеТипа.КвалификаторыДаты.ЧастиДаты);
	ИначеЕсли ФактическийТип = Тип("Строка") Тогда
		ИнкрементКвалификатора = СтрШаблон("ru = 'Длина строки превышает максимальную. Максимальная длина <%1>;'",
								ОписаниеТипа.КвалификаторыСтроки.Длина);
	ИначеЕсли ФактическийТип = Тип("Число") Тогда
		ИнкрементКвалификатора = "ru = 'Некорректный формат значения, число должно быть целым;'";
	Иначе
		// Тут мы никогда не окажемся.
		ВызватьИсключение НСтр("ru = 'При обработке схемы возникла исключительная ситуация!'");
	КонецЕсли;
	
	ТекстОшибки =
			СтрШаблон("%1 %2",
						РезультатВалидации.ШаблонБазовойОшибки,
						ИнкрементКвалификатора);
	РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
	Возврат Ложь;
КонецФункции

Функция ПолучитьМаппингДопустимыхТипов1сНаOpenApi()
	
	СоответствиеДопустимыхТипов = Новый Соответствие;
	
	OpenAPIСтрока = "string";
	СоответствиеДопустимыхТипов.Вставить(Тип("Строка"), OpenAPIСтрока);
	СоответствиеДопустимыхТипов.Вставить(Тип("Дата"), OpenAPIСтрока);
	СоответствиеДопустимыхТипов.Вставить(Тип("УникальныйИдентификатор"), OpenAPIСтрока);
	СоответствиеДопустимыхТипов.Вставить(Тип("Число"), "number");
	СоответствиеДопустимыхТипов.Вставить(Тип("Булево"), "boolean");
	СоответствиеДопустимыхТипов.Вставить(Тип("Массив"), "array");
	СоответствиеДопустимыхТипов.Вставить(Тип("Структура"), "object");
	СоответствиеДопустимыхТипов.Вставить(Тип("Соответствие"), "object");
	
	Возврат СоответствиеДопустимыхТипов;
	
КонецФункции

Функция ПолучитьТипOpenApiПоЗначениюСвойства(ЗначениеСвойства) // BSLLS:LatinAndCyrillicSymbolInWord-off
	
	СоответствиеДопустимыхТипов = ПолучитьМаппингДопустимыхТипов1сНаOpenApi();
	
	Возврат СоответствиеДопустимыхТипов.Получить(ТипЗнч(ЗначениеСвойства));
	
КонецФункции

Функция МассивДопустимыхТипов1с()
	СоответствиеДопустимыхТипов = ПолучитьМаппингДопустимыхТипов1сНаOpenApi();
	МассивТипов = Новый массив;
	Для Каждого ЭлементСоответствия Из СоответствиеДопустимыхТипов Цикл
		МассивТипов.Добавить(ЭлементСоответствия.Ключ);
	КонецЦикла;
	
	Возврат МассивТипов;
КонецФункции

#Область ОбщиеПроверки

Процедура ТипонезависимыеПроверки(РезультатВалидации, Данные, ПроверяемаяСхема) // BSLLS:Typo-off
	
	ЗначениеСвойства = Данные.Значение;
	
	ПроверитьСоответствиеПеречислению(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема);
	ОбработатьDepricated(РезультатВалидации, ПроверяемаяСхема);
	
КонецПроцедуры

Процедура ПроверитьСоответствиеПеречислению(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема)
	
	ЗначенияПеречисления = ПроверяемаяСхема.Получить("enum");
	Если ЗначенияПеречисления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначенияПеречисления.Найти(ЗначениеСвойства) = Неопределено Тогда
		ПредставлениеПеречисления = СтрСоединить(ЗначенияПеречисления, ";");
		ТекстДеталей = СтрШаблон("ru = 'Значение <%1> не найдено среди доступных вариантов. Список доступных значений: <%2>;'"
									, ЗначениеСвойства, ПредставлениеПеречисления);
		ТекстОшибки = СтрШаблон("%1 %2",
									РезультатВалидации.ШаблонБазовойОшибки,
									ТекстДеталей);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьDepricated(РезультатВалидации, ПроверяемаяСхема)
	
	Если Не ПроверяемаяСхема.Получить("deprecated") = Истина Тогда
		// Не depricated
		Возврат;
	КонецЕсли;

	ТекстПредупреждения = СтрШаблон(
								"ru = '%1 Свойство признано устаревшим! Необходимо отказаться от использования в кратчайшее время.'",
								РезультатВалидации.ШаблонПредупреждения);
	РезультатВалидации.Предупреждения.Добавить(ТекстПредупреждения);
	
КонецПроцедуры

#КонецОбласти // ОбщиеПроверки

#Область РаботаСоСложнымиСхемами

Процедура ОбработатьСложнуюСхему(РезультатВалидации, Данные, ПроверяемаяСхема)
	
	// Для работы сложных схем, нам понадобятся промежуточные результаты валидации.
	// Закэшируем накопленные ошибки, а после выполнения проверок вернем их на место.
	КэшОшибок = Новый Массив;
	пбп_ПереадресацияКлиентСервер.ДополнитьМассив(КэшОшибок, РезультатВалидации.Ошибки);
	Дискриминатор = ПроверяемаяСхема.Получить("discriminator");
	Если ЕстьСвойство("oneOf", ПроверяемаяСхема) Тогда
		ОбработатьСвойствоOneOf(РезультатВалидации, Данные, ПроверяемаяСхема.Получить("oneOf"), Дискриминатор);
	ИначеЕсли ЕстьСвойство("anyOf", ПроверяемаяСхема) Тогда
		ОбработатьСвойствоAnyOf(РезультатВалидации, Данные, ПроверяемаяСхема.Получить("anyOf"), Дискриминатор);
	ИначеЕсли ЕстьСвойство("allOf", ПроверяемаяСхема) Тогда
		ОбработатьСвойствоAllOf(РезультатВалидации, Данные, ПроверяемаяСхема.Получить("allOf"), Дискриминатор);
	Иначе
		// Тут такого быть категорически не должно! Это ошибка валидатора.
		ВызватьИсключение НСтр("ru = 'Ошибка при разборе схемы! Не найдено ни одного из свойств oneOf, anyOf, allOf;'");
	КонецЕсли;
	
	пбп_ПереадресацияКлиентСервер.ДополнитьМассив(РезультатВалидации.Ошибки, КэшОшибок);
	
КонецПроцедуры

Процедура ОбработатьСвойствоOneOf(РезультатВалидации, Данные, МассивПроверяемыхСхем, Дискриминатор = Неопределено)
	
	МассивИндексовСхемПрошедшихВалидацию = Новый Массив;
	ПромежуточныйКэшОшибок = Новый Массив;
	
	Для Индекс = 0 По МассивПроверяемыхСхем.ВГраница() Цикл
		ТекущаяСхема = МассивПроверяемыхСхем[Индекс];
		Если Не СхемаПодходитПоДискриминатору(РезультатВалидации, Данные.Значение, ТекущаяСхема, Дискриминатор) Тогда
			Продолжить;
		КонецЕсли;
		ПроверяемаяСхема = РазыменоватьСхему(РезультатВалидации, ТекущаяСхема);
		РезультатВалидации.Ошибки = Новый Массив;
		ВыполнитьВалидациюДанных(РезультатВалидации, Данные, ПроверяемаяСхема);
		Если РезультатВалидации.Ошибки.Количество() = 0 Тогда
			МассивИндексовСхемПрошедшихВалидацию.Добавить(Индекс);
		КонецЕсли;
		Если МассивИндексовСхемПрошедшихВалидацию.Количество() > 1 Тогда
			// Уже была успешная валидация по схеме, а значит это ошибка oneOf
			ТекстОшибки = СтрШаблон("ru = '%1 <oneOf> Объект должен соответствовать только одной схеме. Индексы валидных схем <%2>;'",
									РезультатВалидации.ШаблонБазовойОшибки, СтрСоединить(МассивИндексовСхемПрошедшихВалидацию, ";"));
			РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		пбп_ПереадресацияКлиентСервер.ДополнитьМассив(ПромежуточныйКэшОшибок, РезультатВалидации.Ошибки);
	КонецЦикла;
	
	Если МассивИндексовСхемПрошедшихВалидацию.Количество() = 0 Тогда
		
		ТекстОшибки = СтрШаблон("ru = '%1 <oneOf> Объект должен соответствовать хотя бы одной схеме;'",
									РезультатВалидации.ШаблонБазовойОшибки);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
		пбп_ПереадресацияКлиентСервер.ДополнитьМассив(РезультатВалидации.Ошибки, ПромежуточныйКэшОшибок);
		Возврат;
	КонецЕсли;
	
	// Ровно одна схема прошла валидацию. Очистим массив ошибок, т.к. все ок. :)
	РезультатВалидации.Ошибки = Новый Массив;
	
КонецПроцедуры

Процедура ОбработатьСвойствоAnyOf(РезультатВалидации, Данные, МассивПроверяемыхСхем, Дискриминатор = Неопределено)
	
	ПромежуточныйКэшОшибок = Новый Массив;
	Для Индекс = 0 По МассивПроверяемыхСхем.ВГраница() Цикл
		ТекущаяСхема = МассивПроверяемыхСхем[Индекс];
		Если Не СхемаПодходитПоДискриминатору(РезультатВалидации, Данные.Значение, ТекущаяСхема, Дискриминатор) Тогда
			Продолжить;
		КонецЕсли;
		ПроверяемаяСхема = РазыменоватьСхему(РезультатВалидации, ТекущаяСхема);
		РезультатВалидации.Ошибки = Новый Массив;
		ВыполнитьВалидациюДанных(РезультатВалидации, Данные, ПроверяемаяСхема);
		Если РезультатВалидации.Ошибки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		пбп_ПереадресацияКлиентСервер.ДополнитьМассив(ПромежуточныйКэшОшибок, РезультатВалидации.Ошибки);
	КонецЦикла;
	
	РезультатВалидации.Ошибки = Новый Массив;
	ТекстОшибки = СтрШаблон("ru = '%1 <anyOf> Объект должен соответствовать хотя бы одной схеме;'",
							РезультатВалидации.ШаблонБазовойОшибки);
	РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
	
	пбп_ПереадресацияКлиентСервер.ДополнитьМассив(РезультатВалидации.Ошибки, ПромежуточныйКэшОшибок);
	
КонецПроцедуры

Процедура ОбработатьСвойствоAllOf(РезультатВалидации, Данные, МассивПроверяемыхСхем, Дискриминатор = Неопределено)
	
	РезультатВалидации.Ошибки = Новый Массив;
	Для Индекс = 0 По МассивПроверяемыхСхем.ВГраница() Цикл
		ТекущаяСхема = МассивПроверяемыхСхем[Индекс];
		Если Не СхемаПодходитПоДискриминатору(РезультатВалидации, Данные.Значение, ТекущаяСхема, Дискриминатор) Тогда
			Продолжить;
		КонецЕсли;
		ПроверяемаяСхема = РазыменоватьСхему(РезультатВалидации, ТекущаяСхема);
		
		ВыполнитьВалидациюДанных(РезультатВалидации, Данные, ПроверяемаяСхема);
	КонецЦикла;
	
	Если РезультатВалидации.Ошибки.Количество() > 0  Тогда
		ТекстОшибки = СтрШаблон("ru = '%1 <allOf> Объект должен соответствовать всем схемам.'",
								РезультатВалидации.ШаблонБазовойОшибки);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьNot(РезультатВалидации, Данные, ПроверяемаяСхема)
	
	Если Не ЕстьСвойство("not", ПроверяемаяСхема) Тогда
		Возврат;
	КонецЕсли;
	
	// Для обработки not, нам понадобятся промежуточные результаты валидации.
	// Закэшируем накопленные ошибки, а после выполнения проверок вернем их на место.
	КэшОшибок = Новый Массив;
	пбп_ПереадресацияКлиентСервер.ДополнитьМассив(КэшОшибок, РезультатВалидации.Ошибки);
	
	ОтрицательнаяСхема = ПроверяемаяСхема.Получить("not");
	ОтрицательнаяСхема = РазыменоватьСхему(РезультатВалидации, ОтрицательнаяСхема);
	РезультатВалидации.Ошибки = Новый Массив;
	//ВалидироватьДанныеПоСхеме(Данные, ОтрицательнаяСхема);
	
	Если РезультатВалидации.Ошибки.Количество() = 0 Тогда
		// После проверки - массив пуст! А значит объект прошел валидацию по схеме, а не должен был! 
		ТекстОшибки = СтрШаблон("ru ='%1 <not> Объект не должен соответствовать схеме, а он соответствует;'",
								РезультатВалидации.ШаблонБазовойОшибки);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
	Иначе
		// Валидация прошла успешно, обнулим массив ошибок.
		РезультатВалидации.Ошибки = Новый Массив;
	КонецЕсли;

	пбп_ПереадресацияКлиентСервер.ДополнитьМассив(РезультатВалидации.Ошибки, КэшОшибок);
	
КонецПроцедуры

Функция СхемаПодходитПоДискриминатору(РезультатВалидации, Данные, ТекущаяСхема, Дискриминатор)
	
	Если Дискриминатор = Неопределено Тогда
		// Дискриминатора нет, просто вернем истину.
		Возврат Истина;
	КонецЕсли;
			
	ИмяКлючевогоСвойства = Дискриминатор.Получить("propertyName");
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		ЗначениеКлючевогоСвойства = Неопределено;
		Данные.Свойство(ИмяКлючевогоСвойства, ЗначениеКлючевогоСвойства);
	ИначеЕсли ТипЗнч(Данные) = Тип("Соответствие") Тогда
		ЗначениеКлючевогоСвойства = Данные.Получить(ИмяКлючевогоСвойства);
	Иначе
		ЗначениеКлючевогоСвойства = Неопределено;
	КонецЕсли;
	
	Если ЗначениеКлючевогоСвойства = Неопределено Тогда
		ТекстОшибки = СтрШаблон("ru = '%1 <discriminator> ключевое свойство <%2> Должно существовать и быть заполнено;'",
									РезультатВалидации.ШаблонБазовойОшибки, ИмяКлючевогоСвойства);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;

	СсылкаНаСхему = Неопределено;
	Маппинг = Дискриминатор.Получить("mapping");
	Если Не Маппинг = Неопределено Тогда
		СсылкаНаСхему = Маппинг.Получить(Строка(ЗначениеКлючевогоСвойства));
	КонецЕсли;
	Если СсылкаНаСхему = Неопределено Тогда
		СсылкаНаСхему = СтрШаблон("#/components/schemas/%1", ЗначениеКлючевогоСвойства);
	КонецЕсли;
	
	Возврат Не СсылкаНаСхему = Неопределено И СсылкаНаСхему = ТекущаяСхема.Получить("$ref");
	
КонецФункции

#КонецОбласти // РаботаСоСложнымиСхемами

#Область ВалидацияСтроки

Процедура ВалидироватьСтроку(РезультатВалидации, Данные, ПроверяемаяСхема)
	
	ОписаниеТипа = СоздатьОписаниеТиповПриПроверкеСтроки(ПроверяемаяСхема);
	ЗначениеСвойства = Данные.Значение;
		
	Если Не ТипЗначенияСоответствуетОписанию(РезультатВалидации, ЗначениеСвойства, ОписаниеТипа) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьМинимальнуюДлину(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема);
	
	ПроверитьСтрокуНаСоответствиеФорматуИПаттерну(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема);
	ПроверитьСоответствиеПеречислению(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема);
	
КонецПроцедуры

Функция СоздатьОписаниеТиповПриПроверкеСтроки(ПроверяемаяСхема)
	ОписаниеТипа = Новый ОписаниеТипов("Строка");
	МаксимальнаяДлина = ПроверяемаяСхема.Получить("maxLength");
	Если Не МаксимальнаяДлина = Неопределено Тогда
		КвалификаторСтроки = Новый КвалификаторыСтроки(МаксимальнаяДлина);
		ОписаниеТипа = Новый ОписаниеТипов(ОписаниеТипа, , , , КвалификаторСтроки);
	КонецЕсли;
	Формат =  ПроверяемаяСхема.Получить("format");
	Если Формат = "date" Тогда
		КвалификаторДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
		ОписаниеТипа = Новый ОписаниеТипов(ОписаниеТипа, "Дата", , , , КвалификаторДаты);
	ИначеЕсли Формат = "date-time" Тогда
		КвалификаторДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
		ОписаниеТипа = Новый ОписаниеТипов(ОписаниеТипа, "Дата", , , , КвалификаторДаты);
	ИначеЕсли Формат = "uuid" Тогда
		ОписаниеТипа = Новый ОписаниеТипов(ОписаниеТипа, "УникальныйИдентификатор");
	КонецЕсли; // BSLLS:IfElseIfEndsWithElse-off
	
	Возврат ОписаниеТипа;
КонецФункции

Процедура ПроверитьСтрокуНаСоответствиеФорматуИПаттерну(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема)
	
	ФорматЗначения = ПроверяемаяСхема.Получить("format");
	Паттерн = ПроверяемаяСхема.Получить("pattern");
// BSLLS:LineLength-off
	Если ФорматЗначения = "byte" Тогда
		ПроверитьBase64(РезультатВалидации, ЗначениеСвойства);
	ИначеЕсли ФорматЗначения = "date" Тогда
		ПроверитьДату(РезультатВалидации, ЗначениеСвойства, ЧастиДаты.Дата);
	ИначеЕсли ФорматЗначения = "date-time" Тогда
		ПроверитьДату(РезультатВалидации, ЗначениеСвойства, ЧастиДаты.ДатаВремя);
	ИначеЕсли ФорматЗначения = "email" Тогда
		Паттерн = "^((?!\.)[\w\-_.]*[^.])(@\w+)(\.\w+(\.\w+)?[^.\W])$";
	ИначеЕсли ФорматЗначения = "uuid" Тогда
		Паттерн = "[0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}";
	ИначеЕсли ФорматЗначения = "uri" Тогда
		Паттерн = "^(((ht|f)tp(s?)\:\/\/[0-9a-zA-Z]([-.\w]*[0-9a-zA-Z])*(:(0-9)*)*))?(\/?)(\{?)([a-zA-Z0-9\-\.\?\,\'\/\\\+\~\{\}\&%\$#_]*)?(\}?)(\/?)$"; // BSLLS:LineLength-off
	ИначеЕсли ФорматЗначения = "ipv4" Тогда
		Паттерн = "^(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$";
	ИначеЕсли ФорматЗначения = "ipv6" Тогда
		Паттерн = "^([[:xdigit:]]{1,4}(?::[[:xdigit:]]{1,4}){7}|::|:(?::[[:xdigit:]]{1,4}){1,6}|[[:xdigit:]]{1,4}:(?::[[:xdigit:]]{1,4}){1,5}|(?:[[:xdigit:]]{1,4}:){2}(?::[[:xdigit:]]{1,4}){1,4}|(?:[[:xdigit:]]{1,4}:){3}(?::[[:xdigit:]]{1,4}){1,3}|(?:[[:xdigit:]]{1,4}:){4}(?::[[:xdigit:]]{1,4}){1,2}|(?:[[:xdigit:]]{1,4}:){5}:[[:xdigit:]]{1,4}|(?:[[:xdigit:]]{1,4}:){1,6}:)$";
	Иначе
		ФорматЗначения = "pattern";
	КонецЕсли;
// BSLLS:LineLength-on
	Если ЗначениеЗаполнено(Паттерн) Тогда
		ПроверитьПоРегулярномуВыражению(РезультатВалидации, ЗначениеСвойства, Паттерн, ФорматЗначения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДату(РезультатВалидации, Значение, ОписаниеЧастиДаты)
	
	ОписаниеДаты = Новый ОписаниеТипов("Дата", , , , , Новый КвалификаторыДаты(ОписаниеЧастиДаты));
	Попытка
		Дата = ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
		ПриведеннаяДата = ОписаниеДаты.ПривестиЗначение(Дата);
	Исключение
		ОписаниеПроблемы = СтрШаблон("ru = 'Неверный формат. Не удалось привести значение <%1>, к дате;'",
										Значение);
		ТекстОшибки = СтрШаблон("%1 %2", РезультатВалидации.ШаблонБазовойОшибки, ОписаниеПроблемы);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
		Возврат;
	КонецПопытки;
	
	Если Не Дата = ПриведеннаяДата Тогда
		ОписаниеПроблемы = СтрШаблон("ru = 'Неверный формат даты. Ожидается строка в формате <%1>;'",
										ОписаниеЧастиДаты);
		ТекстОшибки = СтрШаблон("%1 %2", РезультатВалидации.ШаблонБазовойОшибки, ОписаниеПроблемы);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПоРегулярномуВыражению(РезультатВалидации, Значение, Паттерн, Формат)
	
	Если Не СтрПодобнаПоРегулярномуВыражению(Значение, Паттерн) Тогда
		Если Формат = "pattern" Тогда
			ПредставлениеОшибки = СтрШаблон("ru = '%1 Ожидалось значение по маске %2;'",
									РезультатВалидации.ШаблонБазовойОшибки, Паттерн);
		Иначе
			ПредставлениеОшибки = СтрШаблон("ru = '%1 Ожидался формат %2;'",
									РезультатВалидации.ШаблонБазовойОшибки, Формат);
		КонецЕсли;
		
		РезультатВалидации.Ошибки.Добавить(ПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьBase64(РезультатВалидации, Значение)
	
	Если Не ЗначениеЗаполнено(Base64Значение(Значение)) Тогда
		ПредставлениеОшибки = СтрШаблон("ru = '%1 Ожидалось Base64 значение;'",
									РезультатВалидации.ШаблонБазовойОшибки);
		РезультатВалидации.Ошибки.Добавить(ПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьМинимальнуюДлину(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема)
	
	МинимальнаяДлина = ПроверяемаяСхема.Получить("minLength");
	Если Не МинимальнаяДлина = Неопределено И СтрДлина(ЗначениеСвойства) < МинимальнаяДлина Тогда
		ТекстОшибки = СтрШаблон("ru = '%1. Длина, меньше требуемой. Минимальная длина <%2>;'",
									РезультатВалидации.ШаблонБазовойОшибки, МинимальнаяДлина);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ВалидацияСтроки

#Область ВалидацияЧисла

Процедура ВалидироватьЧисло(РезультатВалидации, Данные, ПроверяемаяСхема, Целое = Ложь) // BSLLS:Typo-off
	ОписаниеТипа = СоздатьОписаниеТиповПриПроверкеЧисла(Целое);
	ЗначениеСвойства = Данные.Значение;

	Если Не ТипЗначенияСоответствуетОписанию(РезультатВалидации, ЗначениеСвойства, ОписаниеТипа) Тогда
		Возврат;
	КонецЕсли;
		
	ПроверитьМинимум(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема);
	
	ПроверитьМаксимум(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема);
	
	ПроверитьКратность(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема);
КонецПроцедуры

Функция СоздатьОписаниеТиповПриПроверкеЧисла(Целое = Ложь)
	
	ОписаниеТипа = Новый ОписаниеТипов("Число");
	Если Целое Тогда
		МаксимальнаяРазрядностьЧисла = 20;
		ОписаниеТипа = Новый ОписаниеТипов(ОписаниеТипа, , ,  Новый КвалификаторыЧисла(МаксимальнаяРазрядностьЧисла, 0));
	КонецЕсли;
	
	Возврат ОписаниеТипа;
	
КонецФункции

Процедура ПроверитьМинимум(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема)
	
	МинимальноеЗначение = ПроверяемаяСхема.Получить("minimum");
	Если МинимальноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Включая = Не ПроверяемаяСхема.Получить("exclusiveMinimum") = Истина;
	Если МинимальноеЗначение > ЗначениеСвойства
		Или (Включая И МинимальноеЗначение = ЗначениеСвойства) Тогда
		ТекстОшибки = СтрШаблон("ru = '%1 Значение <%2> должно быть больше %3<%4>;'",
								РезультатВалидации.ШаблонБазовойОшибки,
								ЗначениеСвойства,
								?(Включая, "или равно ", ""),
								МинимальноеЗначение);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьМаксимум(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема)
	
	МаксимальноеЗначение = ПроверяемаяСхема.Получить("maximum");
	Если МаксимальноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Включая = Не ПроверяемаяСхема.Получить("exclusiveMaximum") = Истина;
	Если МаксимальноеЗначение < ЗначениеСвойства
		Или (Включая И МаксимальноеЗначение = ЗначениеСвойства) Тогда
		ТекстОшибки = СтрШаблон("ru = '%1 Значение <%2> должно быть меньше %3<%4>;'",
								РезультатВалидации.ШаблонБазовойОшибки,
								ЗначениеСвойства,
								?(Включая, "или равно ", ""),
								МаксимальноеЗначение);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьКратность(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема)
	
	Кратность = ПроверяемаяСхема.Получить("multipleOf");
	Если Кратность = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Кратность = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка в схеме! Кратность не может быть равна нулю;'");
	КонецЕсли;
		
	Если Не ЗначениеСвойства % Кратность = 0 Тогда
		ТекстОшибки = СтрШаблон("ru = '%1 Значение <%2> должно быть кратно <%3>;'",
								РезультатВалидации.ШаблонБазовойОшибки,
								ЗначениеСвойства,
								Кратность);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ВалидацияЧисла

#Область ВалидацияМассива

Процедура ВалидироватьМассив(РезультатВалидации, Данные, ПроверяемаяСхема) // BSLLS:Typo-off
	ОписаниеТипа = Новый ОписаниеТипов("Массив");
	ЗначениеСвойства = Данные.Значение;
	
	Если Не ТипЗначенияСоответствуетОписанию(РезультатВалидации, ЗначениеСвойства, ОписаниеТипа) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьМинимумИМаксимумСтрок(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема);
	
	ПроверитьУникальностьЗначений(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема);
	
	Для Каждого ЭлементМассива Из ЗначениеСвойства Цикл
		СтруктураЭлемента = Новый Структура("Ключ, Значение", "items", ЭлементМассива);
		ПроверитьСвойствоПоСхеме(РезультатВалидации, СтруктураЭлемента, ПроверяемаяСхема, Ложь);
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьМинимумИМаксимумСтрок(РезультатВалидации, ПроверяемыйМассив, ПроверяемаяСхема)
	
	МинимумСтрок = ПроверяемаяСхема.Получить("minItems");
	Если Не МинимумСтрок = Неопределено И ПроверяемыйМассив.Количество() < МинимумСтрок Тогда
		ТекстДеталей = СтрШаблон("ru = 'Количество элементов массива <%1> меньше минимального порога <%2>;'",
									ПроверяемыйМассив.Количество(),
									МинимумСтрок);
		ТекстОшибки = СтрШаблон("%1 %2", РезультатВалидации.ШаблонБазовойОшибки, ТекстДеталей);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	МаксимумСтрок = ПроверяемаяСхема.Получить("maxItems");
	Если Не МаксимумСтрок = Неопределено И ПроверяемыйМассив.Количество() > МаксимумСтрок Тогда
		ТекстДеталей = СтрШаблон("ru = 'Количество элементов массива <%1> больше максимального порога <%2>;'",
									ПроверяемыйМассив.Количество(),
									МаксимумСтрок);
		ТекстОшибки = СтрШаблон("%1 %2", РезультатВалидации.ШаблонБазовойОшибки, ТекстДеталей);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьУникальностьЗначений(РезультатВалидации, ПроверяемыйМассив, ПроверяемаяСхема)
	
	УникальныеЗначения = ПроверяемаяСхема.Получить("uniqueItems");
	
	Если Не УникальныеЗначения = Истина Тогда
		Возврат;
	КонецЕсли;
	
	СвернутыйМассив = пбп_ПереадресацияКлиентСервер.СвернутьМассив(ПроверяемыйМассив);
	
	Если Не СвернутыйМассив.Количество() = ПроверяемыйМассив.Количество() Тогда
		ТекстОшибки = СтрШаблон("ru = '%1 Значения в массиве не уникальны;'", РезультатВалидации.ШаблонБазовойОшибки);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ВалидацияМассива

#Область ВалидацияОбъекта

Процедура ВалидироватьОбъект(РезультатВалидации, Данные, ПроверяемаяСхема) // BSLLS:Typo-off
	
	ОписаниеТипа = Новый ОписаниеТипов("Структура, Соответствие");
	ЗначениеСвойства = Данные.Значение;
	
	Если Не ТипЗначенияСоответствуетОписанию(РезультатВалидации, ЗначениеСвойства, ОписаниеТипа) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьНаличиеОбязательныхСвойств(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема);
	
	ПроверитьКоличествоСвойств(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема);

	ОписаниеДополнительныхСвойств =  ПроверяемаяСхема.Получить("additionalProperties");
	
	СписокСвойств = ПроверяемаяСхема.Получить("properties");
	Если СписокСвойств = Неопределено Тогда
		// Если свойства не определены - значит все свойства что есть, дополнительные.
		// Передадим пустое соответсвие в качестве контекста
		СписокСвойств = Новый Соответствие;
	КонецЕсли;
	Для Каждого Свойство Из ЗначениеСвойства Цикл
		ПроверитьСвойствоПоСхеме(РезультатВалидации, Свойство, СписокСвойств, ОписаниеДополнительныхСвойств);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаличиеОбязательныхСвойств(РезультатВалидации, ПроверяемыйОбъект, ПроверяемаяСхема)
	
	МассивОбязательныхПараметров = ПроверяемаяСхема.Получить("required");
	Если МассивОбязательныхПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ИмяОбязательногоСвойства Из МассивОбязательныхПараметров Цикл
		ПроверитьНаличиеОбязательногоСвойстваПоИмени(РезультатВалидации, ПроверяемыйОбъект, ИмяОбязательногоСвойства);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаличиеОбязательногоСвойстваПоИмени(РезультатВалидации, ПроверяемыйОбъект, ИмяОбязательногоСвойства)
	
	СвойствоНайдено = Ложь;
	Если ТипЗнч(ПроверяемыйОбъект) = Тип("Структура") Тогда
		СвойствоНайдено = ПроверяемыйОбъект.Свойство(ИмяОбязательногоСвойства);
	Иначе
		СвойствоНайдено = Не ПроверяемыйОбъект.Получить(ИмяОбязательногоСвойства) = Неопределено;
	КонецЕсли;
	Если СвойствоНайдено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = СтрШаблон("ru = '%1 Отсутствует обязательное свойство <%2>;'",
								РезультатВалидации.ШаблонБазовойОшибки,
								ИмяОбязательногоСвойства);
	РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
	
КонецПроцедуры

Процедура ПроверитьКоличествоСвойств(РезультатВалидации, ЗначениеСвойства, ПроверяемаяСхема)
	
	КоличествоСвойств = ЗначениеСвойства.Количество();
	МинимумСвойств = ПроверяемаяСхема.Получить("minProperties");
	Если Не МинимумСвойств = Неопределено И КоличествоСвойств < МинимумСвойств Тогда
		ТекстДеталей = СтрШаблон("ru = 'Количество свойств объекта <%1> меньше минимального порога <%2>;'",
									КоличествоСвойств,
									МинимумСвойств);
		ТекстОшибки = СтрШаблон("%1 %2", РезультатВалидации.ШаблонБазовойОшибки, ТекстДеталей);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	МаксимумСвойств = ПроверяемаяСхема.Получить("maxProperties");
	Если Не МаксимумСвойств = Неопределено И КоличествоСвойств > МаксимумСвойств Тогда
		ТекстДеталей = СтрШаблон("ru = 'Количество свойств объекта <%1> больше максимального порога <%2>;'",
									КоличествоСвойств,
									МаксимумСвойств);
		ТекстОшибки = СтрШаблон("%1 %2", РезультатВалидации.ШаблонБазовойОшибки, ТекстДеталей);
		РезультатВалидации.Ошибки.Добавить(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ВалидацияОбъекта

Процедура ВалидироватьБулево(РезультатВалидации, Данные, ПроверяемаяСхема)  // BSLLS:Typo-off
	
	ОписаниеТипа = Новый ОписаниеТипов("Булево");
	ЗначениеСвойства = Данные.Значение;
	
	ТипЗначенияСоответствуетОписанию(РезультатВалидации, ЗначениеСвойства, ОписаниеТипа);
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
