
#Область ПрограммныйИнтерфейс

#Область Справочники

Процедура Справочник_пбп_НастройкиИнтеграции(ОбъектОбработки, РезультатОбработки, СостояниеСообщения,
	ТипОбъекта, МетодХранения, Задержка, ФорматСообщения, ТекстОшибки, ДатаРегистрации, СсылкаНаОбъект, Функции) Экспорт
	
	Поток = "ОтправкаНастройкиИнтеграции";
	
	СтруктураИстории = пбп_ИнтеграцииШина
		.ИнициализироватьСтруктуруЗаписиИсторииИнтеграции(Поток, , Ложь);
	
	Попытка
		МетаданныеОбъект = Метаданные.Справочники.пбп_НастройкиИнтеграции;
		
		СоставПолей = пбп_ИнтеграцииШина.ПолучитьОписаниеПолейПоМетаданным(МетаданныеОбъект, , ОбъектОбработки, СтруктураИстории);
		пбп_ИнтеграцииШина.УдалитьНеиспользуемыеРеквизиты(СоставПолей);
		
		Данные = пбп_ИнтеграцииШина.ВыгрузитьВПлатформу(ОбъектОбработки, СоставПолей, , СтруктураИстории);
		
		РезультатОбработки = пбп_КоннекторHTTP.ОбъектВJson(Данные);
	Исключение
		ТекстОшибки = пбп_ИнтеграцииСервер.ПолучитьПодробноеПредставлениеОшибкиИсключения(
			НСтр("ru = 'Не удалось сформировать сообщение для отправки по причине'"),
			ИнформацияОбОшибке());
	КонецПопытки;
	
	пбп_ИнтеграцииШина.ЗаписатьРезультатВИсториюИнтеграции(СтруктураИстории, ТекстОшибки, РезультатОбработки, Ложь);
	
КонецПроцедуры

Процедура Справочник_пбп_ИнтеграционныеПотоки(ОбъектОбработки, РезультатОбработки, СостояниеСообщения,
	ТипОбъекта, МетодХранения, Задержка, ФорматСообщения, ТекстОшибки, ДатаРегистрации, СсылкаНаОбъект, Функции) Экспорт
	
	Поток = "ОтправкаИнтеграционногоПотока";
	
	СтруктураИстории = пбп_ИнтеграцииШина
		.ИнициализироватьСтруктуруЗаписиИсторииИнтеграции(Поток, , Ложь);
	
	Попытка
		МетаданныеОбъект = Метаданные.Справочники.пбп_ИнтеграционныеПотоки;
		
		СоставПолей = ПоляВыгрузки_Справочник_пбп_ИнтеграционныеПотоки();
		
		Данные = пбп_ИнтеграцииШина.ВыгрузитьВПлатформу(ОбъектОбработки, СоставПолей, , СтруктураИстории);
		
		РезультатОбработки = пбп_КоннекторHTTP.ОбъектВJson(Данные);
	Исключение
		ТекстОшибки = пбп_ИнтеграцииСервер.ПолучитьПодробноеПредставлениеОшибкиИсключения(
			НСтр("ru = 'Не удалось сформировать сообщение для отправки по причине'"),
			ИнформацияОбОшибке());
	КонецПопытки;
	
	пбп_ИнтеграцииШина.ЗаписатьРезультатВИсториюИнтеграции(СтруктураИстории, ТекстОшибки, РезультатОбработки, Ложь);
	
КонецПроцедуры

#КонецОбласти // Справочники

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолеВыгрузки_ИнтегрируемаяСистема() Экспорт
	Возврат "ИдентификаторНастройки";
КонецФункции

Функция ПолеВыгрузки_ТипИнтеграции() Экспорт
	Возврат "ИмяПредопределенныхДанных";
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ПоляВыгрузки_Справочник_пбп_ИнтеграционныеПотоки()
	
	Результат = пбп_ИнтеграцииШина.КонструкторСоставаПолей();
	
	Поля = пбп_ИнтеграцииШина.КонструкторПолейСТипом();
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "Ссылка", "ref");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "Код", "code");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "Наименование", "name");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "ЭтоГруппа", "isGroup");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "Родитель.ИдентификаторНастройки", "parent");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "ИдентификаторНастройки", "identifier");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "ИзмененВручную", "changed");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "КлючРегламентногоЗадания", "schedulerKey");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "КоличествоДнейХранения", "daysOfStorageSuccess");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "КоличествоДнейХраненияОшибок", "daysOfStorageError");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "НаправлениеПотока", "threadDirection");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "НастройкаИнтеграции", "integrationSettings", , , Истина);
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "ПользовательскаяФункция", "userFunction");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "ТочкаВхода", "endpoint");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "ХранитьНомераВерсий", "storeVersionNumbers");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "Метод", "method");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(Поля, "Порт", "port");
	
	ПоляТЧ = пбп_ИнтеграцииШина.КонструкторПолейСТипом();
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(ПоляТЧ, "Имя", "name");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(ПоляТЧ, "Тип", "type");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(ПоляТЧ, "ПараметрURL", "inURL");
	пбп_ИнтеграцииШина.ДополнитьПоляПолемСТипом(ПоляТЧ, "ЗначениеПоУмолчанию", "defaultValue");
	
	пбп_ИнтеграцииШина.ДобавитьПоляТабличнойЧастиВСоставПолей(Результат, "ПараметрыВхода", ПоляТЧ);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции