
&Вместо("ИнициализироватьПредопределенныеЗначения")
Функция Мок_ИнициализироватьПредопределенныеЗначения(МенеджерОбъекта)
	
	ПараметрыМетода = Мокито.МассивПараметров(МенеджерОбъекта);
	
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(пбп_ПредопределенныеЗначения,
		"ИнициализироватьПредопределенныеЗначения",
		ПараметрыМетода,
		ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(МенеджерОбъекта);
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции
