
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой()									// новый
		И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда	// копирование
		
		Элементы.ТипСоответствия.ТолькоПросмотр = Истина;
		Элементы.Объект2.ВыбиратьТип = Ложь;
		Элементы.Объект1.ВыбиратьТип = Ложь;
		ОбъектОбязателен = Параметры.ЗначенияЗаполнения.Количество() > 0 И Параметры.ЗначенияЗаполнения.Свойство("Объект1");
		Элементы.Объект1.ТолькоПросмотр = ОбъектОбязателен;
		
	ИначеЕсли Параметры.Ключ.Пустой()								// новый
		И Параметры.ЗначенияЗаполнения.Количество() > 0				// заполняется при переходе из объекта
		И Параметры.ЗначенияЗаполнения.Свойство("Объект1")			// есть свойство
		И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда	// не копирование
		
		ТипОбъект1 = ТипЗнч(Параметры.ЗначенияЗаполнения.Объект1);
		ДанныеИзменены = Ложь;
		
		Если ДанныеИзменены Тогда
			
			Элементы.Объект2.ВыбиратьТип = Ложь;
			Элементы.Объект1.ВыбиратьТип = Ложь;
			Элементы.Объект1.ТолькоПросмотр = Истина;
			Элементы.ТипСоответствия.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Параметры.Ключ.Пустой()
		И ЭтаФорма.ВладелецФормы.Родитель.Окно.Содержимое.Количество() > 1 Тогда
		// Форма открывается из Объекта1
		
		Элементы.Объект2.ВыбиратьТип = Ложь;
		Элементы.Объект1.ВыбиратьТип = Ложь;
		Элементы.Объект1.ТолькоПросмотр = Истина;
		Элементы.ТипСоответствия.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы