// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

///////////////////////////////////////////////////////////////////////////////
//

#Область ПрограммныйИнтерфейс

// Загрузить настройки формы
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения	 - форма, с которой выполняется команда
//
Асинх Процедура ЗагрузитьНастройкиФормы(Форма) Экспорт
	
	Диалог = СоздатьДиалогВыбораФайлаНастроек(Истина);
	
	ОповещениеЗавершениеЗагрузки = Новый ОписаниеОповещения("Подключаемый_ПослеЗагрузкиНастроек", Форма);
	
	Результат = Ждать Диалог.ВыбратьАсинх();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗагрузитьНастройкиФормыПослеВыбораФайла(Форма, Результат[0]);
		пбп_ПереадресацияКлиент.СообщитьПользователю(НСтр("ru = 'Загрузка настроек из файла завершена'"));
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОповещениеЗавершениеЗагрузки);
	
КонецПроцедуры

// Сохранить настройки формы
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения	 - форма, с которой выполняется команда
//
Асинх Процедура СохранитьНастройкиФормы(Форма) Экспорт
	
	Диалог = СоздатьДиалогВыбораФайлаНастроек(Ложь);
	
	Результат = Ждать Диалог.ВыбратьАсинх();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		СохранитьНастройкиФормыПослеВыборФайла(Форма, Результат[0]);
		пбп_ПереадресацияКлиент.СообщитьПользователю(НСтр("ru = 'Сохранение настроек в файл завершено'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция СоздатьДиалогВыбораФайлаНастроек(ЭтоЗагрузка)
	
	Если ЭтоЗагрузка Тогда
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок		= НСтр("ru = 'Выберите файл для загрузки настроек'");
	Иначе
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		Диалог.Заголовок		= НСтр("ru = 'Выберите файл для сохранения настроек'");
	КонецЕсли;
	
	Диалог.МножественныйВыбор	= Ложь;
	Диалог.Фильтр				= "Расширяемый язык разметки (*.xml)|*.xml";
	
	Возврат Диалог;
	
КонецФункции

Процедура ЗагрузитьНастройкиФормыПослеВыбораФайла(Форма, ПутьКФайлу)
	
	Попытка
		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ПутьКФайлу);
		АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, Новый УникальныйИдентификатор);
		
		ЗначенияРеквизитов = пбп_ПодключаемыеКомандыВызовСервера.ЗагрузитьНастройкиФормы(
			Форма.ИмяФормы, Форма.АдресХранилищаСвойствФормы, АдресФайлаВХранилище);
		
		ЗаполнитьФормуПолученнымиИзФайлаЗначениями(Форма, ЗначенияРеквизитов);
	Исключение
		пбп_ПереадресацияКлиент.СообщитьПользователю(
			НСтр("ru = 'Ошибка при чтении файла: '") + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьФормуПолученнымиИзФайлаЗначениями(ФормаСтруктура, ЗначенияРеквизитов, ЭтоОбъект = Ложь)
	
	Для Каждого КлючИЗначение Из ЗначенияРеквизитов Цикл
		Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			Если ТипЗнч(КлючИЗначение.Значение) = Тип("Структура") Тогда
				ЗаполнитьФормуПолученнымиИзФайлаЗначениями(ФормаСтруктура.Объект, КлючИЗначение.Значение, Истина);
			ИначеЕсли ТипЗнч(КлючИЗначение.Значение) = Тип("Массив") Тогда
					ТабличнаяЧасть = ФормаСтруктура[КлючИЗначение.Ключ];
					
					ТабличнаяЧасть.Очистить();
					Для Каждого СтрокаМассива Из КлючИЗначение.Значение Цикл
						ЗаполнитьФормуПолученнымиИзФайлаЗначениями(ТабличнаяЧасть.Добавить(), СтрокаМассива);
					КонецЦикла;
			Иначе
				ФормаСтруктура[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СохранитьНастройкиФормыПослеВыборФайла(Форма, ПутьКФайлу)
	
	СтруктураРеквизитов = ПолучитьИзВременногоХранилища(Форма.АдресХранилищаСвойствФормы);
	
	Попытка
		ЗначенияРеквизитов = Новый Структура;
		ЗначенияРеквизитов = ЗаполнитьЗначенияФормыПередСохранением(Форма, ЗначенияРеквизитов, СтруктураРеквизитов);

		АдресФайлаВХранилище = пбп_ПодключаемыеКомандыВызовСервера.СохранитьНастройкиФормы(
			Форма.ИмяФормы, ЗначенияРеквизитов);
		
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаВХранилище);
		ДвоичныеДанныеФайла.Записать(ПутьКФайлу);
	Исключение
		пбп_ПереадресацияКлиент.СообщитьПользователю(
			НСтр("ru = 'Ошибка при сохранении файла: '") + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Функция ЗаполнитьЗначенияФормыПередСохранением(ФормаСтруктура, ЗначенияРеквизитов, СтруктураРеквизитов)
	
	ЗначенияРеквизитов = пбп_ПодключаемыеКомандыКлиентСерверСлужебный
		.СкопироватьСтруктуруЗначенийРеквизитовИзСвойствФормы(СтруктураРеквизитов);
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("Структура") Тогда
			Если КлючИЗначение.Ключ = "Объект" Тогда
				СтруктураОбъекта = Новый Структура;
				ЗначенияРеквизитов.Вставить(КлючИЗначение.Ключ, ЗаполнитьЗначенияФормыПередСохранением(ФормаСтруктура.Объект,
					СтруктураОбъекта, КлючИЗначение.Значение));
			Иначе
				МассивЗначений = Новый Массив;
				Для Каждого СтрокаТаблицы Из ФормаСтруктура[КлючИЗначение.Ключ] Цикл
					НоваяСтрока = пбп_ПодключаемыеКомандыКлиентСерверСлужебный
						.СкопироватьСтруктуруЗначенийРеквизитовИзСвойствФормы(КлючИЗначение.Значение);
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
					
					МассивЗначений.Добавить(НоваяСтрока);
				КонецЦикла;
				
				ЗначенияРеквизитов.Вставить(КлючИЗначение.Ключ, МассивЗначений);
			КонецЕсли;
		Иначе
			ЗначенияРеквизитов.Вставить(КлючИЗначение.Ключ, ФормаСтруктура[КлючИЗначение.Ключ]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции