// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

////////////////////////////////////////////////////////////////////////////////
// Строковые функции клиент сервер служебный: Аналог общего модуля БСП

#Область СлужебныйПрограммныйИнтерфейс

#Область ПереадресацияМетодов

// См. __СтроковыеФункцииСлужебныйКлиентСервер.РазложитьСтрокуВМассивПодстрок.
Функция РазложитьСтрокуВМассивПодстрок(Знач Значение, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, 
	СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Модуль = ПолучитьМодуль();
	Возврат Модуль.РазложитьСтрокуВМассивПодстрок(Значение, Разделитель, ПропускатьПустыеСтроки,
		СокращатьНепечатаемыеСимволы);
	
КонецФункции 

// См. __СтроковыеФункцииСлужебныйКлиентСервер.ПодставитьПараметрыВСтроку.
Функция ПодставитьПараметрыВСтроку(Знач ШаблонСтроки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	Модуль = ПолучитьМодуль();
	Возврат Модуль.ПодставитьПараметрыВСтроку(ШаблонСтроки, Параметр1, Параметр2, Параметр3, Параметр4 , Параметр5,
		Параметр6, Параметр7, Параметр8, Параметр9);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьМодуль()
	
	#Если Клиент Тогда
		Возврат __ОбщегоНазначенияКлиент.ОбщийМодуль(
			"СтроковыеФункцииКлиентСервер",
			"__СтроковыеФункцииКлиентСервер");
	#Иначе
		Возврат __ОбщегоНазначенияВызовСервера.ОбщийМодуль(
			"СтроковыеФункцииКлиентСервер",
			"__СтроковыеФункцииКлиентСервер");
	#КонецЕсли
	
КонецФункции

#КонецОбласти