////////////////////////////////////////////////////////////////////////////////
// Работа с диалогами (сервер): для серверных методов работы с диалогами.

#Область ПрограммныйИнтерфейс

// Процедура выполняет стандартные действия при создании на сервере в форме списка. 
// 
// Параметры:
//  Отказ                - Булево.
//  СтандартнаяОбработка - Булево.
//  ТекущаяФорма         - УправляемаяФорма.
//  СтрПар               - Структура.
// 
Процедура СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ТекущаяФорма, СтрПар = Неопределено) Экспорт
	
	ПолноеИмяОбъекта = __ОбщегоНазначенияСервер.ПолучитьИмяОбъектаПоИмениФормы(ТекущаяФорма.ИмяФормы, Истина);
	ПолноеИмяОбъекта = ПолноеИмяОбъекта + ".ФормаСписка";
	
КонецПроцедуры // СписокПриСозданииНаСервере()

// Процедура выполняет стандартные действия при создании на сервере в форме выбора. 
// 
// Параметры:
//  Отказ                - Булево.
//  СтандартнаяОбработка - Булево.
//  ТекущаяФорма         - УправляемаяФорма.
//  СтрПар               - Структура.
// 
Процедура ФормаВыбораПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ТекущаяФорма, СтрПар = Неопределено) Экспорт
	
	ПолноеИмяОбъекта = __ОбщегоНазначенияСервер.ПолучитьИмяОбъектаПоИмениФормы(ТекущаяФорма.ИмяФормы, Истина);
	ПолноеИмяОбъекта = ПолноеИмяОбъекта + ".ФормаВыбора";
	
КонецПроцедуры // СписокПриСозданииНаСервере()

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
