////////////////////////////////////////////////////////////////////////////////
// Работа с диалогами (сервер): для серверных методов работы с диалогами.

#Область ПрограммныйИнтерфейс

// Выполняет стандартные действия при создании на сервере в форме списка.
// 
// Параметры:
//  Отказ                   - Булево.
//  СтандартнаяОбработка    - Булево.
//  ТекущаяФорма            - УправляемаяФорма.
//  ДополнительныеПараметры - Структура.
//
Процедура СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ТекущаяФорма, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПолноеИмяОбъекта = __ОбщегоНазначенияСервер.ПолучитьИмяОбъектаПоИмениФормы(ТекущаяФорма.ИмяФормы, Истина);
	ПолноеИмяОбъекта = СтрШаблон("%1.ФормаСписка", ПолноеИмяОбъекта);
	
КонецПроцедуры

// Выполняет стандартные действия при создании на сервере в форме выбора. 
// 
// Параметры:
//  Отказ                   - Булево.
//  СтандартнаяОбработка    - Булево.
//  ТекущаяФорма            - УправляемаяФорма.
//  ДополнительныеПараметры - Структура.
//
Процедура ФормаВыбораПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ТекущаяФорма, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПолноеИмяОбъекта = __ОбщегоНазначенияСервер.ПолучитьИмяОбъектаПоИмениФормы(ТекущаяФорма.ИмяФормы, Истина);
	ПолноеИмяОбъекта = СтрШаблон("%1.ФормаВыбора", ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
