// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8, включая доработку типовых конфигураций.
//
// Copyright 2017-2024 First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
// e-mail: ivssmirnov@1bit.com
// Версия: 1.0.0.1
//
// Требования: платформа 1С версии 8.3.17 и выше

#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьПредопределенныеЗначения() Экспорт
	
	ТЗПредопределенныхЗначений = __ПредопределенныеЗначенияПереопределяемый.ПредопределенныеЗначения();
	
	ТЗПредопределенныхЗначенийКСозданию = ПредопределенныеЗначенияКСозданию(ТЗПредопределенныхЗначений);
	
	Пока ТЗПредопределенныхЗначенийКСозданию.Следующий() Цикл
		
		СоздатьПредопределенноеЗначение(ТЗПредопределенныхЗначенийКСозданию, ПланыВидовХарактеристик.__ПредопределенныеЗначения);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗначениеПредопределенногоЭлемента(Идентификатор) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	__ПредопределенныеЗначения.Значение КАК Значение,
		|	__ПредопределенныеЗначения.СписокЗначений КАК СписокЗначений,
		|	__ПредопределенныеЗначения.ЗначенияЭлементов.(
		|		Значение КАК Значение
		|	) КАК ЗначенияЭлементов
		|ИЗ
		|	%1 КАК __ПредопределенныеЗначения
		|ГДЕ
		|	__ПредопределенныеЗначения.ИдентификаторНастройки = &ИдентификаторНастройки";
	
	Запрос.УстановитьПараметр("ИдентификаторНастройки", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.СписокЗначений Тогда
			
			Результат = ВыборкаДетальныеЗаписи.ЗначенияЭлементов.Выгрузить().ВыгрузитьКолонку("Значение");
			
		Иначе
			
			Результат = ВыборкаДетальныеЗаписи.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредопределенныеЗначенияКСозданию(ТЗПредопределенныхЗначений, ПутьПоиска = "ПланВидовХарактеристик.__ПредопределенныеЗначения") Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТЗ.Наименование КАК Наименование,
		|	ТЗ.ИдентификаторНастройки КАК ИдентификаторНастройки
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Наименование КАК Наименование,
		|	ВТ.ИдентификаторНастройки КАК ИдентификаторНастройки
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ %1 КАК __ПредопределенныеЗначения
		|		ПО ВТ.ИдентификаторНастройки = __ПредопределенныеЗначения.ИдентификаторНастройки
		|ГДЕ
		|	__ПредопределенныеЗначения.Ссылка ЕСТЬ NULL"; 
	
	Запрос.Текст = СтрШаблон(ТекстЗапроса, ПутьПоиска);
	
	Запрос.УстановитьПараметр("ТЗ", ТЗПредопределенныхЗначений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции

Процедура СоздатьПредопределенноеЗначение(Выборка, МенеджерОбъекта) Экспорт
	
	// ++ Обход ошибки отстутствия модуля БСП, не переносить
	ОбщегоНазначения = Неопределено;
	// -- Обход ошибки отстутствия модуля БСП, не переносить
	
	НовыйПредопределенныйЭлемент = МенеджерОбъекта.СоздатьЭлемент();
	
	ЗаполнитьЗначенияСвойств(НовыйПредопределенныйЭлемент, Выборка);
	
	Попытка;
		НовыйПредопределенныйЭлемент.Записать();
	Исключение;
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти