
#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьПредопределенныеЗначения() Экспорт
	
	ТЗПредопределенныхЗначений = __ПредопределенныеЗначенияПереопределяемый.ПредопределенныеЗначения();
	
	ТЗПредопределенныхЗначенийКСозданию = ПредопределенныеЗначенияКСозданию(ТЗПредопределенныхЗначений);
	
	Пока ТЗПредопределенныхЗначенийКСозданию.Следующий() Цикл
		
		СоздатьПредопределенноеЗначение(ТЗПредопределенныхЗначенийКСозданию);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗначениеПредопределенногоЗначения(Идентификатор) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	__ПредопределенныеЗначения.Значение КАК Значение,
		|	__ПредопределенныеЗначения.СписокЗначений КАК СписокЗначений,
		|	__ПредопределенныеЗначения.ЗначенияЭлементов.(
		|		Значение КАК Значение
		|	) КАК ЗначенияЭлементов
		|ИЗ
		|	%1 КАК __ПредопределенныеЗначения
		|ГДЕ
		|	__ПредопределенныеЗначения.ИдентификаторНастройки = &ИдентификаторНастройки";
	
	Запрос.УстановитьПараметр("ИдентификаторНастройки", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.СписокЗначений Тогда
			
			Результат = ВыборкаДетальныеЗаписи.ЗначенияЭлементов.Выгрузить().ВыгрузитьКолонку("Значение");
			
		Иначе
			
			Результат = ВыборкаДетальныеЗаписи.Значение;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредопределенныеЗначенияКСозданию(ТЗПредопределенныхЗначений, ПутьПоиска = "ПланВидовХарактеристик.__ПредопределенныеЗначения") Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТЗ.Наименование КАК Наименование,
		|	ТЗ.ИдентификаторНастройки КАК ИдентификаторНастройки
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Наименование КАК Наименование,
		|	ВТ.ИдентификаторНастройки КАК ИдентификаторНастройки
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ %1 КАК __ПредопределенныеЗначения
		|		ПО ВТ.ИдентификаторНастройки = __ПредопределенныеЗначения.ИдентификаторНастройки
		|ГДЕ
		|	__ПредопределенныеЗначения.Ссылка ЕСТЬ NULL"; 
	
	Запрос.Текст = СтрШаблон(ТекстЗапроса, ПутьПоиска);
	
	Запрос.УстановитьПараметр("ТЗ", ТЗПредопределенныхЗначений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции 

Процедура СоздатьПредопределенноеЗначение(Выборка, ПутьСоздания = "ПланыВидовХарактеристик.__ПредопределенныеЗначения") Экспорт
	
	СтрукутраПараметров = Новый Структура("НовЗначение", Неопределено);
	
	__БазоваяФункциональностьБИТ.ВыполнитьВБезопасномРежиме("Параметры.НовЗначение = " + ПутьСоздания + ".СоздатьЭлемент()", СтрукутраПараметров);
	
	НовЗначение = СтрукутраПараметров.НовЗначение;
	
	//НовЗначение = ПланыВидовХарактеристик.__ПредопределенныеЗначения.СоздатьЭлемент();
	
	ЗаполнитьЗначенияСвойств(НовЗначение, Выборка);
	
	Попытка;
		НовЗначение.Записать();
	Исключение;
		__БазоваяФункциональностьБИТ.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти