// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

///////////////////////////////////////////////////////////////////////////////
//

#Область СлужебныйПрограммныйИнтерфейс

// Копирует ключи (без значений) структуры значений реквизитов из свойств формы с преобразованием
// структуры в массив для таблиц формы. Для объекта тип значения остается структурой.
//
// Параметры:
//  СтруктураРеквизитов	 - Структура	 - структура, из которой необходимо скопировать ключи
// 
// Возвращаемое значение:
//  Структура - скопированные ключи структуры
//
Функция СкопироватьСтруктуруЗначенийРеквизитовИзСвойствФормы(СтруктураРеквизитов) Экспорт
	
	ЗначенияРеквизитов = Новый Структура;
	Для Каждого РеквизитФормы Из СтруктураРеквизитов Цикл
		Если ТипЗнч(РеквизитФормы.Значение) = Тип("Структура") Тогда
			Если РеквизитФормы.Ключ = "Объект" Тогда
				ЗначенияРеквизитов.Вставить(РеквизитФормы.Ключ, Новый Структура);
			Иначе
				ЗначенияРеквизитов.Вставить(РеквизитФормы.Ключ, Новый Массив);
			КонецЕсли;
		Иначе
			ЗначенияРеквизитов.Вставить(РеквизитФормы.Ключ, Неопределено);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Получить формат даты, учитывая время
//
// Параметры:
//  ФорматДатыБезВремени - Строка	 - формат даты "0_0"
//  ФорматВремени		 - Число	 - формат времени: 0, 1 или 2
// 
// Возвращаемое значение:
//  Строка - строка формата даты с временем вида "0_0_0"
//
Функция ПолучитьФорматДаты(ФорматДатыБезВремени, ФорматВремени) Экспорт
	
	Если Не ЗначениеЗаполнено(ФорматДатыБезВремени) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ФорматДатыБезВремени = "0_0" Тогда
		ФорматДаты = "0_0_0";
	Иначе
		ФорматДаты = СтрШаблон("%1_%2", ФорматДатыБезВремени, ФорматВремени);
	КонецЕсли;
	
	Возврат ФорматДаты;
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс