// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

// Перед записью
//
// Параметры:
//  Источник							 - 	 - 
//  Отказ								 - 	 - 
//  Замещение							 - 	 - 
//  ТолькоЗапись						 - 	 - 
//  ЗаписьФактическогоПериодаДействия	 - 	 - 
//  ЗаписьПерерасчетов					 - 	 - 
//
Процедура ПередЗаписью(Источник, Отказ, Замещение, ТолькоЗапись = Неопределено,
	ЗаписьФактическогоПериодаДействия = Неопределено, ЗаписьПерерасчетов = Неопределено) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Событие = "ПередЗаписью";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ПередЗаписьюПриЗаписи(ИмяМетода, Источник, Отказ, Замещение,
		ТолькоЗапись, ЗаписьФактическогоПериодаДействия, ЗаписьПерерасчетов);
	
КонецПроцедуры

// При записи
//
// Параметры:
//  Источник							 - 	 - 
//  Отказ								 - 	 - 
//  Замещение							 - 	 - 
//  ТолькоЗапись						 - 	 - 
//  ЗаписьФактическогоПериодаДействия	 - 	 - 
//  ЗаписьПерерасчетов					 - 	 - 
//
Процедура ПриЗаписи(Источник, Отказ, Замещение, ТолькоЗапись = Неопределено,
	ЗаписьФактическогоПериодаДействия = Неопределено, ЗаписьПерерасчетов = Неопределено) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Событие = "ПриЗаписи";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ПередЗаписьюПриЗаписи(ИмяМетода, Источник, Отказ, Замещение,
		ТолькоЗапись, ЗаписьФактическогоПериодаДействия, ЗаписьПерерасчетов);
	
КонецПроцедуры

// Обработка заполнения
//
// Параметры:
//  Источник			 - 	 - 
//  ДанныеЗаполнения	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаЗаполнения";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	пбп_ОбработкаСобытий.ОбработкаЗаполнения(ИмяМетода,
		Источник, ДанныеЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

// Обработка проверки заполнения
//
// Параметры:
//  Источник			 - 	 - 
//  Отказ				 - 	 - 
//  ПроверяемыеРеквизиты - 	 - 
//
Процедура ОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Событие = "ОбработкаПроверкиЗаполнения";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	пбп_ОбработкаСобытий.ОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

// Обработка формирования по версии истории данных
//
// Параметры:
//  Источник			 - 	 - 
//  ДанныеВерсии		 - 	 - 
//  НомерВерсии			 - 	 - 
//  КлючЗаписи			 - 	 - 
//  ИсключитьДанные		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаФормированияПоВерсииИсторииДанных(Источник, ДанныеВерсии,
	НомерВерсии, КлючЗаписи, ИсключитьДанные, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаФормированияПоВерсииИсторииДанных";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	пбп_ОбработкаСобытий.ОбработкаФормированияПоВерсииИсторииДанных(ИмяМетода, Источник,
		ДанныеВерсии, НомерВерсии, ИсключитьДанные, СтандартнаяОбработка, КлючЗаписи);
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Процедура ПередЗаписьюПриЗаписи(ИмяМетода, Источник, Отказ, Замещение,
	ТолькоЗапись, ЗаписьФактическогоПериодаДействия, ЗаписьПерерасчетов)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(Отказ);
		ПараметрыМетода.Добавить(Замещение);
		Если ТолькоЗапись <> Неопределено Тогда
			ПараметрыМетода.Добавить(ТолькоЗапись);
		КонецЕсли;
		Если ЗаписьФактическогоПериодаДействия <> Неопределено Тогда
			ПараметрыМетода.Добавить(ЗаписьФактическогоПериодаДействия);
		КонецЕсли;
		Если ЗаписьПерерасчетов <> Неопределено Тогда
			ПараметрыМетода.Добавить(ЗаписьПерерасчетов);
		КонецЕсли;
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник = ПараметрыМетода[0];
		Если ПараметрыМетода[1] Тогда
			Отказ = Истина;
		КонецЕсли;
		Замещение = ПараметрыМетода[2];
		Если ТолькоЗапись <> Неопределено Тогда
			ТолькоЗапись = ПараметрыМетода[3];
		КонецЕсли;
		Если ЗаписьФактическогоПериодаДействия <> Неопределено Тогда
			ЗаписьФактическогоПериодаДействия = ПараметрыМетода[4];
		КонецЕсли;
		Если ЗаписьПерерасчетов <> Неопределено Тогда
			ЗаписьПерерасчетов = ПараметрыМетода[5];
		КонецЕсли;
	Исключение
		ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции