// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

// Перед записью
//
// Параметры:
//  Источник							 - 	 - 
//  Отказ								 - 	 - 
//  Замещение							 - 	 - 
//  ТолькоЗапись						 - 	 - 
//  ЗаписьФактическогоПериодаДействия	 - 	 - 
//  ЗаписьПерерасчетов					 - 	 - 
//
Процедура ПередЗаписью(Источник, Отказ, Замещение, ТолькоЗапись = Неопределено,
	ЗаписьФактическогоПериодаДействия = Неопределено, ЗаписьПерерасчетов = Неопределено) Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

// При записи
//
// Параметры:
//  Источник							 - 	 - 
//  Отказ								 - 	 - 
//  Замещение							 - 	 - 
//  ТолькоЗапись						 - 	 - 
//  ЗаписьФактическогоПериодаДействия	 - 	 - 
//  ЗаписьПерерасчетов					 - 	 - 
//
Процедура ПриЗаписи(Источник, Отказ, Замещение, ТолькоЗапись = Неопределено,
	ЗаписьФактическогоПериодаДействия = Неопределено, ЗаписьПерерасчетов = Неопределено) Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

// Обработка заполнения
//
// Параметры:
//  Источник			 - 	 - 
//  ДанныеЗаполнения	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

// Обработка проверки заполнения
//
// Параметры:
//  Источник			 - 	 - 
//  Отказ				 - 	 - 
//  ПроверяемыеРеквизиты - 	 - 
//
Процедура ОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

// Обработка формирования по версии истории данных
//
// Параметры:
//  Источник			 - 	 - 
//  ДанныеВерсии		 - 	 - 
//  НомерВерсии			 - 	 - 
//  КлючЗаписи			 - 	 - 
//  ИсключитьДанные		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаФормированияПоВерсииИсторииДанных(Источник, ДанныеВерсии,
	НомерВерсии, КлючЗаписи, ИсключитьДанные, СтандартнаяОбработка) Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс