
#Область ПрограммныйИнтерфейс

Функция КлиентRabbitMQ() Экспорт
	
	ИмяМакета = "пбп_PinkRabbitMQ";
	ИмяКомпоненты = "BITERP";
	Идентификатор = "AddIn.BITERP.PinkRabbitMQ";
	
	Если Не ПодключитьВнешнююКомпоненту("ОбщийМакет." + ИмяМакета, ИмяКомпоненты, ТипВнешнейКомпоненты.Native) Тогда
		пбп_Переадресация.СообщитьПользователю("Не удалось подключить внешнюю компоненту RabbitMQ");
		Возврат Неопределено;
	КонецЕсли;
	
	Клиент = Неопределено;
	Попытка
		Клиент  = Новый(Идентификатор);
	Исключение
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("пбп_RabbitMQ", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;
	
	Возврат Клиент;
	
КонецФункции

Процедура Подключиться(Клиент, ПараметрыПодключения) Экспорт
	
	ПроверитьКлиент(Клиент);
	
	Попытка
		Клиент.Connect(
			ПараметрыПодключения.Хост,
			ПараметрыПодключения.Порт,
			ПараметрыПодключения.Логин,
			ПараметрыПодключения.Пароль,
			ПараметрыПодключения.ВиртуальныйХост,
			ПараметрыПодключения.ЧастотаПульса,
			ПараметрыПодключения.ИспользоватьTLS,
			ПараметрыПодключения.Таймаут
		);
	Исключение
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЛогироватьОшибку(Клиент, ОписаниеОшибкиПодключения(), ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗавершитьРаботуСКомпонентой(Клиент) Экспорт
	Клиент = Неопределено;
КонецПроцедуры

#Область РаботаСТочкамиОбмена

Процедура DeclareExchange(Клиент, Параметры) Экспорт
	
	ПроверитьКлиент(Клиент);
	
	Попытка
		Клиент.DeclareExchange(
			Параметры.Имя,
			Параметры.Тип,
			Параметры.НеСоздаватьНовую,
			Параметры.СохранятьСообщения,
			Параметры.АвтоматическоеУдаление,
			Параметры.Аргументы
		);
	Исключение
		lastError = Клиент.GetLastError();
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЛогироватьОшибку(Клиент, ОписаниеОшибкиСозданияТочкиОбмена(Параметры.Имя), ТекстОшибки, lastError);
	КонецПопытки;
	
КонецПроцедуры

Процедура DeleteExchange(Клиент, Имя, УдалитьНеиспользуемую = Ложь) Экспорт
	
	ПроверитьКлиент(Клиент);
	
	Попытка
		Клиент.DeleteExchange(Имя, УдалитьНеиспользуемую);
	Исключение
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЛогироватьОшибку(Клиент, ОписаниеОшибкиУдаленияТочкиОбмена(Имя), ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСОчередями

Процедура DeclareQueue(Клиент, Параметры) Экспорт
	
	ПроверитьКлиент(Клиент);
	
	Попытка
		Клиент.DeclareQueue(
			Параметры.Имя,
			Параметры.НеСоздаватьНовую,
			Параметры.СохранятьСообщения,
			Параметры.ТолькоДляСоединения,
			Параметры.АвтоУдаление,
			Параметры.МаксимальныйПриоритет,
			Параметры.Аргументы
		);
	Исключение
		lastError = Клиент.GetLastError();
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЛогироватьОшибку(Клиент, ОписаниеОшибкиСозданияОчереди(Параметры.Имя), ТекстОшибки, lastError);
	КонецПопытки;
	
КонецПроцедуры

Процедура DeleteQueue(Клиент, Имя, УдалитьНеиспользуемую = Ложь, УдалитьПустую = Ложь) Экспорт
	
	ПроверитьКлиент(Клиент);
	
	Попытка
		Клиент.DeleteQueue(Имя, УдалитьНеиспользуемую, УдалитьПустую);
	Исключение
		lastError = Клиент.GetLastError();
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЛогироватьОшибку(Клиент, ОписаниеОшибкиУдаленияОчереди(Имя), ТекстОшибки, lastError);
	КонецПопытки;
	
КонецПроцедуры

Процедура BindQueue(Клиент, ИмяОчереди, ИмяТочкиОбмена, КлючМаршрутизации, Аргументы = "") Экспорт
	
	ПроверитьКлиент(Клиент);
	
	Попытка
		Клиент.BindQueue(ИмяОчереди, ИмяТочкиОбмена, КлючМаршрутизации, Аргументы);
	Исключение
		lastError = Клиент.GetLastError();
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЛогироватьОшибку(Клиент, ОписаниеОшибкиУстановкиСвязиОчередиСТочкойОбмена(ИмяОчереди, ИмяТочкиОбмена), ТекстОшибки, lastError);
	КонецПопытки;
	
КонецПроцедуры

Процедура UnbindQueue(Клиент, ИмяОчереди, ИмяТочкиОбмена, КлючМаршрутизации) Экспорт
	
	ПроверитьКлиент(Клиент);
	
	Попытка
		Клиент.UnbindQueue(ИмяОчереди, ИмяТочкиОбмена, КлючМаршрутизации);
	Исключение
		lastError = Клиент.GetLastError();
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЛогироватьОшибку(Клиент, ОписаниеОшибкиОтсоединенияОчередиОтТочкиОбмена(ИмяОчереди, ИмяТочкиОбмена), ТекстОшибки, lastError);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПродюсером

Процедура BasicPublish(Клиент, ПараметрыОтправки) Экспорт
	
	ПроверитьКлиент(Клиент);
	
	Попытка
		Клиент.BasicPublish(
			ПараметрыОтправки.ИмяТочки,
			ПараметрыОтправки.КлючМаршрутизации,
			ПараметрыОтправки.ТелоСообщения,
			ПараметрыОтправки.ВремяЖизниСообщения,
			ПараметрыОтправки.СохранятьНаДиск,
			ПараметрыОтправки.Аргументы
		);
	Исключение
		lastError = Клиент.GetLastError();
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОписаниеОшибки = ОписаниеОшибкиПубликацииСообщения(ПараметрыОтправки.ИмяТочки, ПараметрыОтправки.КлючМаршрутизации);
		ЛогироватьОшибку(Клиент, ОписаниеОшибки, ТекстОшибки, lastError);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПотребителем

Функция BasicConsume(Клиент, ПараметрыРегистрации) Экспорт
	
	ПроверитьКлиент(Клиент);
	
	Попытка
		Возврат Клиент.BasicConsume(
			ПараметрыРегистрации.ИмяОчереди,
			ПараметрыРегистрации.ИдПотребителя,
			ПараметрыРегистрации.БезПодтверждения,
			ПараметрыРегистрации.Эксклюзивно,
			ПараметрыРегистрации.РазмерВыборки,
			ПараметрыРегистрации.Аргументы);
	Исключение
		lastError = Клиент.GetLastError();
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОписаниеОшибки = ОписаниеОшибкиРегистрацииПотребителя(ПараметрыРегистрации.ИмяОчереди);
		ЛогироватьОшибку(Клиент, ОписаниеОшибки, ТекстОшибки, lastError);
	КонецПопытки;
	
КонецФункции

Функция BasicConsumeMessage(Клиент, ПараметрыЧтения) Экспорт
	
	СообщениеПрочитано = Ложь;
	ТелоСообщения = "";
	ТегСообщения = 0;
	
	ПроверитьКлиент(Клиент);
	
	Попытка
		СообщениеПрочитано = Клиент.BasicConsumeMessage(
			ПараметрыЧтения.ИдПотребителя,
			ТелоСообщения,
			ТегСообщения,
			ПараметрыЧтения.Таймаут);
	Исключение
		lastError = Клиент.GetLastError();
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОписаниеОшибки = ОписаниеОшибкиЧтенияСообщения();
		ЛогироватьОшибку(Клиент, ОписаниеОшибки, ТекстОшибки, lastError);
	КонецПопытки;
	
	ПараметрыЧтения.Тело = ТелоСообщения;
	ПараметрыЧтения.Тег = ТегСообщения;
	
	// Очищаем память по указателю, который неявной хранится в этой переменной
	ТелоСообщения = "";
	ТегСообщения = 0;
	
	Возврат СообщениеПрочитано;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Инициализирует параметры подключения к серверу RabbitMQ.
//
// Параметры:
//  НастройкиИнтеграции	 - СправочникСсылка.пбп_НастройкиИнтеграции - Ссылка на элемент с настройками.
// 
// Возвращаемое значение:
//  Структура - см. ПараметрыПодключения
//
Функция ИнициализироватьПараметрыПодключения(НастройкиИнтеграции) Экспорт
	
	СтруктураНастроек = пбп_ИнтеграцииСлужебный.ПолучитьСтруктуруНастроекИнтеграции(НастройкиИнтеграции);
	
	ПараметрыПодключения = ПараметрыПодключения();
	ПараметрыПодключения.Хост = СтруктураНастроек.СтрокаПодключения;
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, СтруктураНастроек);
	
	ДопНастройки = пбп_ИнтеграцииСлужебный.ПолучитьСтруктуруДополнительныхНастроекИнтеграции(НастройкиИнтеграции);
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ДопНастройки);
	Если ПараметрыПодключения.Таймаут = 0 Тогда
		ПараметрыПодключения.Таймаут = ВремяОжиданияОтветаНаКоманды();
	КонецЕсли;
	
	Возврат ПараметрыПодключения;
	
КонецФункции

// Возвращает параметры подключения к серверу RabbitMQ.
// 
// Возвращаемое значение:
//  Структура - Параметры подключения:
//  * Хост				 - Строка - Адрес сервера (по умолчанию: "localhost")
//  * Порт				 - Число - Порт AMQP-протокола (обычно 5672 или 5671 для TLS)
//  * Логин				 - Строка - Имя пользователя
//  * Пароль			 - Строка - Пароль пользователя
//  * ВиртуальныйХост	 - Строка - Виртуальный хост RabbitMQ (по умолчанию: "/")
//  * ЧастотаПульса		 - Число - Параметр pingRate (в компоненте не реализован, передаётся как 0)
//  * ИспользоватьTLS	 - Булево - Использовать TLS-соединение (secure), по умолчанию Ложь
//  * Таймаут			 - Число - Таймаут подключения в секундах (по умолчанию 5)
//
Функция ПараметрыПодключения() Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("Хост", "localhost");
	Параметры.Вставить("Порт", 5672);
	Параметры.Вставить("Логин", "");
	Параметры.Вставить("Пароль", "");
	Параметры.Вставить("ВиртуальныйХост", "/");
	Параметры.Вставить("ЧастотаПульса", 0);
	Параметры.Вставить("ИспользоватьTLS", Ложь);
	Параметры.Вставить("Таймаут", ВремяОжиданияОтветаНаКоманды());
	
	Возврат Параметры;
	
КонецФункции

// Возвращает параметры для создания точки обмена.
//
// Параметры:
//  Имя				 - Строка										 - Имя точки обмена
//  ТипТочкиОбмена	 - ПеречислениеСсылка.пбп_ТипыТочкиОбменаRabbitMQ	 - Тип точки обмена
// 
// Возвращаемое значение:
//  Структура - Параметры точки обмена:
//  * Имя						 - Строка
//  * Тип						 - Строка
//  * НеСоздаватьНовую			 - Булево
//  * СохранятьСообщения		 - Булево
//  * АвтоматическоеУдаление	 - Булево
//  * Аргументы					 - Строка
//
Функция ПараметрыExchange(Имя, ТипТочкиОбмена = Неопределено) Экспорт
	
	Параметры = Новый Структура;
	
	Если ТипТочкиОбмена = Неопределено Тогда
		ТипТочкиОбмена = Перечисления.пбп_ТипыТочкиОбменаRabbitMQ.direct;
	КонецЕсли;
	ТипТочкиОбменаСтрокой = пбп_RabbitMQПовтИсп.ПолучитьТипТочкиОбменаСтрокой(ТипТочкиОбмена);
	
	Параметры.Вставить("Имя", Имя);
	Параметры.Вставить("Тип", ТипТочкиОбменаСтрокой);
	Параметры.Вставить("НеСоздаватьНовую", Ложь); // onlyCheckIfExists
	Параметры.Вставить("СохранятьСообщения", Ложь); // durable
	Параметры.Вставить("АвтоматическоеУдаление", Ложь); // autodelete
	Параметры.Вставить("Аргументы", ""); // произвольные свойства в формате Json-объект. Пример: {"x-message-ttl": 60000}
	
	Возврат Параметры;
	
КонецФункции

// Возвращает параметры для создания очереди.
//
// Параметры:
//  Имя	 - Строка - Имя очереди
// 
// Возвращаемое значение:
//  Структура - - Параметры очереди:
//  * Имя					 - Строка - Имя очереди
//  * НеСоздаватьНовую		 - Булево - Если Истина, очередь не создаётся, а только проверяется наличие
//  * СохранятьСообщения	 - Булево - Если Истина, сообщения будут сохраняться на диск (durable)
//  * ТолькоДляСоединения	 - Булево - Очередь эксклюзивна для текущего подключения (exclusive)
//  * АвтоУдаление			 - Булево - Очередь будет удалена после отключения потребителя (auto-delete)
//  * МаксимальныйПриоритет	 - Число - Максимальный приоритет сообщений (0 = не используется)
//  * Аргументы				 - Строка - Дополнительные параметры очереди в JSON-формате, пример: {"x-message-ttl": 60000}
//                                     Документация: https://www.rabbitmq.com/queues.html#optional-arguments
//
Функция ПараметрыQueue(Имя) Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("Имя", Имя);
	Параметры.Вставить("НеСоздаватьНовую", Ложь);
	Параметры.Вставить("СохранятьСообщения", Ложь);
	Параметры.Вставить("ТолькоДляСоединения", Ложь);
	Параметры.Вставить("АвтоУдаление", Ложь);
	Параметры.Вставить("МаксимальныйПриоритет", 0);
	Параметры.Вставить("Аргументы", "");
	
	Возврат Параметры;
	
КонецФункции

// Возвращает параметры для отправки сообщения в RabbitMQ.
//
// Параметры:
//  ИмяТочки			 - Строка	 - Имя точки обмена (exchange), в которую будет отправлено сообщение.
//  	Если указано "", будет использована встроенная exchange по умолчанию (default exchange).
//  КлючМаршрутизации	 - Строка	 - Ключ маршрутизации (routingKey), используется для определения очереди получателя.
//  ТелоСообщения		 - Строка	 - Содержимое сообщения (payload). Может быть любым сериализованным текстом.
// 
// Возвращаемое значение:
//  Структура - Параметры отправки сообщения:
//   * ИмяТочки				 - Строка - Имя exchange.
//   * КлючМаршрутизации	 - Строка - routingKey.
//   * ТелоСообщения		 - Строка - Payload.
//   * ВремяЖизниСообщения	 - Число  - TTL (в миллисекундах), по умолчанию 0 (не ограничено).
//   * СохранятьНаДиск		 - Булево - Признак durability (Истина - сохраняется на диск).
//   * Аргументы			 - Строка - Дополнительные параметры в формате JSON (например, заголовки).
//
// Пример:
//  Параметры = ПараметрыОтправкиСообщения("my-exchange", "user.created", Сообщение);
//  Параметры.ВремяЖизниСообщения = 60000;
//  Параметры.СохранятьНаДиск = Истина;
//
Функция ПараметрыОтправкиСообщения(ИмяТочки, КлючМаршрутизации, ТелоСообщения) Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("ИмяТочки", ИмяТочки);
	Параметры.Вставить("КлючМаршрутизации", КлючМаршрутизации);
	Параметры.Вставить("ТелоСообщения", ТелоСообщения);
	Параметры.Вставить("ВремяЖизниСообщения", 0);
	Параметры.Вставить("СохранятьНаДиск", Ложь);
	Параметры.Вставить("Аргументы", "");
	
	Возврат Параметры;
	
КонецФункции

// Возвращает структуру параметров регистрации потребителя.
//
// Параметры:
//  ИмяОчереди		 - Строка - Имя очереди, из которой читаем
//  ИдПотребителя	 - Строка - [НЕ РЕАЛИЗОВАНО], можно оставить ""
//  РазмерВыборки	 - Число  - Кол-во сообщений, загружаемых в кэш (рекомендуемый диапазон 100-1000)
// 
// Возвращает:
//  Структура с параметрами для BasicConsume:
//
//  * ИмяОчереди		 - Строка - Очередь из которой будем читать сообщения.
//  * ИдПотребителя		 - Строка - [НЕ РЕАЛИЗОВАНО], можно оставить ""
//  * БезПодтверждения	 - Булево - Если Истина сообщения удаляются сразу, без ack
//  * Эксклюзивно		 - Булево - Если Истина очередь захватывается монопольно
//  * РазмерВыборки		 - Число  - Оптимально от 100 до 1000
//  * Аргументы			 - Строка - JSON-объект (опц.), например: {"x-stream-offset": "first"}
//
Функция ПараметрыРегистрацииПотребителя(ИмяОчереди, ИдПотребителя = "", РазмерВыборки = 100) Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("ИмяОчереди", ИмяОчереди);
	Параметры.Вставить("ИдПотребителя", "");
	Параметры.Вставить("БезПодтверждения", Ложь);
	Параметры.Вставить("Эксклюзивно", Ложь);
	Параметры.Вставить("РазмерВыборки", РазмерВыборки);
	Параметры.Вставить("Аргументы", "");
	
	Возврат Параметры;
	
КонецФункции

// Возвращает параметры для чтения одного сообщения из очереди.
//
// Параметры:
//  ИдПотребителя	 - Строка - [НЕ РЕАЛИЗОВАНО], можно оставить ""
//  Таймаут			 - Число - Таймаут ожидания сообщения в миллисекундах. Не рекомендуется ставить параметр слшком низким,
//								т.к. сообщение просто может не успеть прийти из очереди. Рекомендуемый диапазон 3000-60000.
//
// Возвращает:
//  Структура:
//   * Тело		 - Строка - Тело сообщения
//   * Тег		 - Число - Тег сообщения
//   * Таймаут	 - Число - Время ожидания в миллисекундах (по умолчанию 5000)
//
Функция ПараметрыЧтенияСообщения(ИдПотребителя = "", Таймаут = 5000) Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("ИдПотребителя", "");
	Параметры.Вставить("Тело", "");
	Параметры.Вставить("Тег", 0);
	Параметры.Вставить("Таймаут", Таймаут);
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЛогироватьОшибку(Клиент, ОписаниеОшибки, ТекстОшибки, lastError = "")
	
	ЗавершитьРаботуСКомпонентой(Клиент);
	
	Комментарий = ОбернутьОшибку(ОписаниеОшибки, ТекстОшибки);
	Если Не ПустаяСтрока(lastError) Тогда
		Комментарий = ОбернутьОшибку(Комментарий, lastError)
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("пбп_RabbitMQ", УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
	
	ВызватьИсключение Комментарий;
	
КонецПроцедуры

Функция ОбернутьОшибку(Знач ИсходнаяОшибка, Ошибка)
	Возврат СтрШаблон("%1: %2", ИсходнаяОшибка, Ошибка);
КонецФункции

Процедура ПроверитьКлиент(Клиент)
	
	Если Клиент = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Компонент RabbitMQ не инициализирована!';
			|en = 'The RabbitMQ component is not initialized!'");
	КонецЕсли;
	
КонецПроцедуры

#Область ОписанияОшибок

Функция ОписаниеОшибкиПодключения()
	Возврат НСтр("ru = 'Ошибка подключения к RabbitMQ'; en = 'Error connecting to RabbitMQ'");
КонецФункции

Функция ОписаниеОшибкиСозданияТочкиОбмена(ИмяТочкиОбмена)
	Возврат СтрШаблон(НСтр("ru = 'Ошибка при создании точки обмена %1'; en = 'Error when creating an exchange point %1'"),
		ИмяТочкиОбмена);
КонецФункции

Функция ОписаниеОшибкиУдаленияТочкиОбмена(ИмяТочкиОбмена)
	Возврат СтрШаблон(НСтр("ru = 'Ошибка при удалении точки обмена %1'; en = 'Error when deleting an exchange point %1'"),
		ИмяТочкиОбмена);
КонецФункции

Функция ОписаниеОшибкиСозданияОчереди(ИмяОчереди)
	Возврат СтрШаблон(НСтр("ru = 'Ошибка при создании очереди %1'; en = 'Error when creating a queue %1'"), ИмяОчереди);
КонецФункции

Функция ОписаниеОшибкиУдаленияОчереди(ИмяОчереди)
	Возврат СтрШаблон(НСтр("ru = 'Ошибка при удалении очереди %1'; en = 'Error when deleting a queue %1'"), ИмяОчереди);
КонецФункции

Функция ОписаниеОшибкиУстановкиСвязиОчередиСТочкойОбмена(ИмяОчереди, ИмяТочкиОбмена)
	Возврат СтрШаблон(НСтр("ru = 'Ошибка при установке связи очереди %1 с точкой обмена %2';
		|en = 'Error when connecting queue %1 to exchange point %2'"),
		ИмяОчереди,
		ИмяТочкиОбмена);
КонецФункции

Функция ОписаниеОшибкиОтсоединенияОчередиОтТочкиОбмена(ИмяОчереди, ИмяТочкиОбмена)
	Возврат СтрШаблон(НСтр("ru = 'Ошибка при отсоединении очереди %1 от точки обмена %2';
		|en = 'Error when disconnecting queue %1 from exchange point %2'"),
		ИмяОчереди,
		ИмяТочкиОбмена);
КонецФункции

Функция ОписаниеОшибкиПубликацииСообщения(ИмяТочкиОбмена, КлючМаршрутизации)
	Возврат СтрШаблон(НСтр(
			"ru = 'Ошибка при отправке сообщения в точку обмена %1 с ключом маршрутизации %2';
			|en = 'Error while publishing message to exchange %1 with routing key %2'"
		),
		ИмяТочкиОбмена,
		КлючМаршрутизации);
КонецФункции

Функция ОписаниеОшибкиРегистрацииПотребителя(ИмяОчереди)
	Возврат СтрШаблон(НСтр(
			"ru = 'Ошибка при регистрации потребителя для очереди %1';
			|en = 'Error registering consumer for queue %1'"
		), ИмяОчереди);
КонецФункции

Функция ОписаниеОшибкиЧтенияСообщения()
	Возврат НСтр("ru = 'Ошибка при чтении сообщения из очереди';
		|en = 'Error reading message from queue'");
КонецФункции

#КонецОбласти

Функция ВремяОжиданияОтветаНаКоманды()
	Возврат 5;
КонецФункции

#КонецОбласти