// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись незагруженного сообщения обмена.
//
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров для записи. Ключи:
//   * ИнтеграционныйПоток - СправочникСсылка.пбп_ИнтеграционныеПотоки - интеграционный поток
//   * ДатаЗагрузки - Дата - дата загрузки объекта
//   * ИдентификаторСообщения - Строка - идентификатор сообщения обмена
//   * ОписаниеОшибки - Строка - причина, по которой сообщение было отклонено
//   * СодержимоеСообщения - ХранилищеЗначения - содержимое сообщения обмена
//
Процедура ДобавитьЗапись(ПараметрыЗаписи) Экспорт
	
	Если ТипЗнч(ПараметрыЗаписи) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru = 'Некорректный тип параметра'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.ИнтеграционныйПоток) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан интеграционный поток'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.ДатаЗагрузки) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана дата загрузки'");
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыЗаписи);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Изменяет запись незагруженного сообщения обмена.
//
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров для записи. Ключи:
//   * ИнтеграционныйПоток - СправочникСсылка.пбп_ИнтеграционныеПотоки - интеграционный поток
//   * ДатаЗагрузки - Дата - дата загрузки объекта
//   * ИдентификаторСообщения - Строка - идентификатор сообщения обмена
//   * ОписаниеОшибки - Строка - причина, по которой сообщение было отклонено
//   * СодержимоеСообщения - ХранилищеЗначения - содержимое сообщения обмена
//
Процедура ИзменитьЗапись(ПараметрыЗаписи) Экспорт
	
	Если ТипЗнч(ПараметрыЗаписи) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru = 'Некорректный тип параметра'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.ИнтеграционныйПоток) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан интеграционный поток'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.ДатаЗагрузки) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана дата загрузки'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.ИдентификаторСообщения) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан идентификатор сообщения'");
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИнтеграционныйПоток.Установить(ПараметрыЗаписи.ИнтеграционныйПоток);
	НаборЗаписей.Отбор.ДатаЗагрузки.Установить(ПараметрыЗаписи.ДатаЗагрузки);
	НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ПараметрыЗаписи.ИдентификаторСообщения);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		
		Запись = НаборЗаписей[0];
		
		Для Каждого КлючИЗначение Из ПараметрыЗаписи Цикл
			
			Запись[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

// Удаляет записи незагруженных сообщений обмена.
//
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров для записи. Ключи:
//   * ИнтеграционныйПоток - СправочникСсылка.пбп_ИнтеграционныеПотоки - интеграционный поток
//   * ДатаЗагрузки - Дата - дата загрузки объекта
//   * ИдентификаторСообщения - Строка - идентификатор сообщения обмена
//
Процедура УдалитьЗаписи(ПараметрыЗаписи) Экспорт
	
	Если ТипЗнч(ПараметрыЗаписи) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru = 'Некорректный тип параметра'");
	КонецЕсли;
	
	ИменаИзмерений = Новый Соответствие;
	ИменаИзмерений.Вставить("ИнтеграционныйПоток", Истина);
	ИменаИзмерений.Вставить("ДатаЗагрузки", Истина);
	ИменаИзмерений.Вставить("ИдентификаторСообщения", Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	ЕстьОтбор = Ложь;
	
	Для Каждого КлючИЗначение Из ПараметрыЗаписи Цикл
		
		Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИменаИзмерений.Получить(КлючИЗначение.Ключ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей.Отбор[КлючИЗначение.Ключ].Установить(КлючИЗначение.Значение);
		ЕстьОтбор = Истина;
		
	КонецЦикла;
	
	Если Не ЕстьОтбор Тогда
		ВызватьИсключение НСтр("ru = 'Не указан ключ удаления записей'");
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
