// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

// Обработка получения данных выбора
//
// Параметры:
//  Источник			 - СправочникМенеджер, ПеречислениеМенеджер, ДокументМенеджер, ПланВидовХарактеристикМенеджер, ПланСчетовМенеджер,
// ПланВидовРасчетаМенеджер, ПланОбменаМенеджер, БизнесПроцессМенеджер, ЗадачаМенеджер - источник подписки на событие
//  ДанныеВыбора		 - СписокЗначений	 - данные выбора
//  Параметры			 - Структура		 - параметры
//  СтандартнаяОбработка - Булево			 - стандартная обработка
//
Процедура ОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаПолученияДанныхВыбора";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(ДанныеВыбора);
			ПараметрыМетода.Добавить(Параметры);
			ПараметрыМетода.Добавить(СтандартнаяОбработка);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник				= ПараметрыМетода[0];
			ДанныеВыбора			= ПараметрыМетода[1];
			Параметры				= ПараметрыМетода[2];
			СтандартнаяОбработка	= ПараметрыМетода[3];
		Исключение
			ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка получения формы
//
// Параметры:
//  Источник				 - СправочникМенеджер, ПеречислениеМенеджер, 
// ОбработкаМенеджер, ДокументМенеджер, ЖурналДокументовМенеджер, РегистрСведенийМенеджер,
// РегистрНакопленияМенеджер, ОтчетМенеджер, ПланВидовХарактеристикМенеджер,
// ПланСчетовМенеджер, РегистрБухгалтерииМенеджер, ПланВидовРасчетаМенеджер, РегистрРасчетаМенеджер,
// ПланОбменаМенеджер, БизнесПроцессМенеджер, ЗадачаМенеджер - источник подписки на событие
//  ВидФормы				 - Строка	 - имя стандартной формы
//  Параметры				 - Структура - параметры формы
//  ВыбраннаяФорма			 - Строка	 - имя открываемой формы
//  ДополнительнаяИнформация - Структура - дополнительная информация
//  СтандартнаяОбработка	 - Булево	 - стандартная обработка
//
Процедура ОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаПолученияФормы";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(ВидФормы);
			ПараметрыМетода.Добавить(Параметры);
			ПараметрыМетода.Добавить(ВыбраннаяФорма);
			ПараметрыМетода.Добавить(ДополнительнаяИнформация);
			ПараметрыМетода.Добавить(СтандартнаяОбработка);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник					= ПараметрыМетода[0];
			ДанныеВыбора				= ПараметрыМетода[1];
			Параметры					= ПараметрыМетода[2];
			ВыбраннаяФорма				= ПараметрыМетода[3];
			ДополнительнаяИнформация	= ПараметрыМетода[4];
			СтандартнаяОбработка		= ПараметрыМетода[5];
		Исключение
			ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка получения полей представления
//
// Параметры:
//  Источник			 - СправочникМенеджер, ДокументМенеджер, ПланВидовХарактеристикМенеджер, ПланСчетовМенеджер,
// ПланВидовРасчетаМенеджер, ПланОбменаМенеджер, БизнесПроцессМенеджер, ЗадачаМенеджер - источник подписки на событие
//  Поля				 - Массив	 - имена полей
//  СтандартнаяОбработка - Булево	 - стандартная обработка
//
Процедура ОбработкаПолученияПолейПредставления(Источник, Поля, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаПолученияПолейПредставления";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(Поля);
			ПараметрыМетода.Добавить(СтандартнаяОбработка);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник				= ПараметрыМетода[0];
			Поля					= ПараметрыМетода[1];
			СтандартнаяОбработка	= ПараметрыМетода[2];
		Исключение
			ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка получения представления
//
// Параметры:
//  Источник			 - СправочникМенеджер, ДокументМенеджер, ПланВидовХарактеристикМенеджер, ПланСчетовМенеджер,
// ПланВидовРасчетаМенеджер, ПланОбменаМенеджер, БизнесПроцессМенеджер, ЗадачаМенеджер - источник подписки на событие
//  Данные				 - Структура	 - значения полей, из которых формируется представление
//  Представление		 - Строка		 - строка, в которую нужно поместить представление объекта или ссылки
//  СтандартнаяОбработка - Булево		 - стандартная обработка
//
Процедура ОбработкаПолученияПредставления(Источник, Данные, Представление, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаПолученияПредставления";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(Данные);
			ПараметрыМетода.Добавить(Представление);
			ПараметрыМетода.Добавить(СтандартнаяОбработка);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник				= ПараметрыМетода[0];
			Поля					= ПараметрыМетода[1];
			Представление			= ПараметрыМетода[2];
			СтандартнаяОбработка	= ПараметрыМетода[3];
		Исключение
			ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка после записи версий истории данных
//
// Параметры:
//  Источник			 - СправочникМенеджер, КонстантаМенеджер, ДокументМенеджер,
// РегистрСведенийМенеджер, ПланВидовХарактеристикМенеджер, ПланСчетовМенеджер, ПланВидовРасчетаМенеджер,
// ПланОбменаМенеджер, БизнесПроцессМенеджер, ЗадачаМенеджер - источник подписки на событие
//  ИнформацияОЗаписиВерсий	 - КоллекцияИнформацииОЗаписиВерсииИсторииДанных 	 - информация о записи версий истории данных
//
Процедура ОбработкаПослеЗаписиВерсийИсторииДанных(Источник, ИнформацияОЗаписиВерсий) Экспорт
	
	Событие = "ОбработкаПослеЗаписиВерсийИсторииДанных";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(ИнформацияОЗаписиВерсий);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник				= ПараметрыМетода[0];
			ИнформацияОЗаписиВерсий	= ПараметрыМетода[1];
		Исключение
			ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс