#Область СлужебныйПрограммныйИнтерфейс

//Используем мок ЮТест.Данные().HTTPСервисЗапрос

// Регистрация теста в тестовой системе
Процедура ИсполняемыеСценарии() Экспорт
	
	// Добавляем тест 'ПроверкаМетодаЗапроса' в набор тестов
	ЮТТесты.ДобавитьТест("ПроверкаМетодаЗапроса");
	
КонецПроцедуры

// Процедура тестирования метода HTTP-запроса
Процедура ПроверкаМетодаЗапроса() Экспорт
	
	// Создание объекта HTTP-запроса с указанием метода GET
	Запрос = ЮТест.Данные().HTTPСервисЗапрос().Метод("GET");

	// Проверка, что метод запроса установлен корректно
	ЮТест.ОжидаетЧто(Запрос.HTTPМетод).Равно("GET");
	
КонецПроцедуры

#КонецОбласти