// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8, включая доработку типовых конфигураций.
//
// Copyright 2017-2024 First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
// e-mail: ivssmirnov@1bit.com
// Версия: 1.0.0.1
//
// Требования: платформа 1С версии 8.3.17 и выше

////////////////////////////////////////////////////////////////////////////////
// Общего назначения служебный (клиент) сервер: для клиентских и серверных функций общего назначения

#Область СлужебныйПрограммныйИнтерфейс

#Область ПереадресацияМетодов

// См. __ОбщегоНазначенияСлужебныйКлиентСервер.УстановитьСвойствоЭлементаФормы.
Процедура УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ИмяЭлемента, ИмяСвойства, Значение) Экспорт
	
	Модуль = ПолучитьМодуль();
	Модуль.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ИмяЭлемента, ИмяСвойства, Значение);
	
КонецПроцедуры

// См. __ОбщегоНазначенияСлужебныйКлиентСервер.СвойствоСтруктуры.
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт

	Модуль = ПолучитьМодуль();
	Возврат Модуль.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
	
КонецФункции

// См. __ОбщегоНазначенияСлужебныйКлиентСервер.ДополнитьМассив.
Процедура ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения = Ложь) Экспорт

	Модуль = ПолучитьМодуль();
	Модуль.ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения);
	
КонецПроцедуры

// См. __ОбщегоНазначенияСлужебныйКлиентСервер.СвернутьМассив.
Функция СвернутьМассив(Знач Массив) Экспорт
	
	Модуль = ПолучитьМодуль();
	Возврат Модуль.СвернутьМассив(Массив);
	
КонецФункции

// См. __ОбщегоНазначенияСлужебныйКлиентСервер.ЗначениеСвойстваЭлементаФормы.
Функция ЗначениеСвойстваЭлементаФормы(ЭлементыФормы, ИмяЭлемента, ИмяСвойства) Экспорт
	
	Модуль = ПолучитьМодуль();
	Возврат Модуль.ЗначениеСвойстваЭлементаФормы(ЭлементыФормы, ИмяЭлемента, ИмяСвойства);
	
КонецФункции

// См. __ОбщегоНазначенияСлужебныйКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта.
Функция ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита) Экспорт
	
	Модуль = ПолучитьМодуль();
	Возврат Модуль.ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита);
	
КонецФункции

// См. __ОбщегоНазначенияСлужебныйКлиентСервер.ДополнитьСтруктуру.
Процедура ДополнитьСтруктуру(Приемник, Источник, Заменять = Неопределено) Экспорт
	
	Модуль = ПолучитьМодуль();
	Модуль.ДополнитьСтруктуру(Приемник, Источник, Заменять);
	
КонецПроцедуры

// См. __ОбщегоНазначенияСлужебныйКлиентСервер.ЗначениеВМассиве.
Функция ЗначениеВМассиве(Знач Значение) Экспорт
	
	Модуль = ПолучитьМодуль();
	Возврат Модуль.ЗначениеВМассиве(Значение);
	
КонецФункции

// См. __ОбщегоНазначенияСлужебныйКлиентСервер.Проверить.
Процедура Проверить(Знач Условие, Знач Сообщение = "", Знач КонтекстПроверки = "") Экспорт
	
	Модуль = ПолучитьМодуль();
	Модуль.Проверить(Условие, Сообщение, КонтекстПроверки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область МетодыАналогиБСП

// Аналог метода БСП.
//
Функция СообщениеПользователю(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных,
		Знач Поле,
		Знач ПутьКДанным = "",
		Отказ = Ложь,
		ЭтоОбъект = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	
	Отказ = Истина;
	
	Возврат Сообщение;
	
КонецФункции

#КонецОбласти

Функция ПолучитьМодуль()
	Возврат __ОбщегоНазначенияВызовСервера.ОбщийМодуль(
		"ОбщегоНазначенияКлиентСервер",
		"__ОбщегоНазначенияКлиентСервер");
КонецФункции

#КонецОбласти
