// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

////////////////////////////////////////////////////////////////////////////////
// Общего назначения (клиент): для клиентских и серверных функций общего назначения

#Область ПрограммныйИнтерфейс

// Упаковывает ДанныеФормыКоллекция в массив структур. 
// Может использоваться для передачи таблицы между клиентом и сервером.
//
// Параметры:
//  ДанныеФормыКоллекция - ДанныеФормыКоллекция - Данные формы коллекции
//  ИменаКолонок		 - Массив - Массив колонок.
// 
// Возвращаемое значение:
// Массив - Массив структур.
//
Функция УпаковатьДанныеФормыКоллекция(ДанныеФормыКоллекция, ИменаКолонок) Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ДанныеФормыКоллекция Цикл
		
		МодельСтроки = Новый Структура;
		
		Для Каждого Элемент Из ИменаКолонок Цикл
			
			Если ТипЗнч(ИменаКолонок) = Тип("Структура") Тогда
				ИмяКолонки = Элемент.Ключ;
			Иначе
				ИмяКолонки = Элемент;
			КонецЕсли;
			
			МодельСтроки.Вставить(ИмяКолонки, СтрокаТаблицы[ИмяКолонки]);
			
		КонецЦикла;
		
		Результат.Добавить(МодельСтроки);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Разбирает строку с разделителями и упаковывает значения в массив.
//
// Параметры:
//  ИсходнаяСтрока	 - Строка - Исходная строка.
//  Разделитель		 - Строка - Разделитель.
// 
// Возвращаемое значение:
// Массив - Массив подстрок.
//
Функция РазобратьСтрокуСРазделителями(ИсходнаяСтрока, Разделитель = ",") Экспорт
	
	Результат = Новый Массив;
	
	// Разделитель бывает длиной строки > 1, учитывая особенность "СтрЗаменить",
	// заменим его на редкий односимвольный разделитель - Символ(9786).
	Сепаратор = Символ(9786);
	Образец = СтрЗаменить(ИсходнаяСтрока, Разделитель, Сепаратор);
	Результат = СтрРазделить(Образец, Сепаратор, Ложь);
	
	Возврат Результат;
	
КонецФункции

// Получает номер месяца числом по строковому представлению
//
// Параметры:
//  МесяцСтрокойСокр - Строка - первые 3 буквы названия месяца
// 
// Возвращаемое значение:
//  Число - номер месяца числом
//
Функция ПолучитьНомерМесяцаПоСтроковомуПредставлению(МесяцСтрокойСокр) Экспорт
	
	Если МесяцСтрокойСокр = "Янв"
		Или МесяцСтрокойСокр = "Jan" Тогда
		МесяцЧислом = 1;
	ИначеЕсли МесяцСтрокойСокр = "Фев"
		Или МесяцСтрокойСокр = "Feb" Тогда
		МесяцЧислом = 2;
	ИначеЕсли МесяцСтрокойСокр = "Мар"
		Или МесяцСтрокойСокр = "Mar" Тогда
		МесяцЧислом = 3;
	ИначеЕсли МесяцСтрокойСокр = "Апр"
		Или МесяцСтрокойСокр = "Apr" Тогда
		МесяцЧислом = 4;
	ИначеЕсли МесяцСтрокойСокр = "Май"
		Или МесяцСтрокойСокр = "May" Тогда
		МесяцЧислом = 5;
	ИначеЕсли МесяцСтрокойСокр = "Июн"
		Или МесяцСтрокойСокр = "Jun" Тогда
		МесяцЧислом = 6;
	ИначеЕсли МесяцСтрокойСокр = "Июл"
		Или МесяцСтрокойСокр = "Jul" Тогда
		МесяцЧислом = 7;
	ИначеЕсли МесяцСтрокойСокр = "Авг"
		Или МесяцСтрокойСокр = "Aug" Тогда
		МесяцЧислом = 8;
	ИначеЕсли МесяцСтрокойСокр = "Сен"
		Или МесяцСтрокойСокр = "Sep" Тогда
		МесяцЧислом = 9;
	ИначеЕсли МесяцСтрокойСокр = "Окт"
		Или МесяцСтрокойСокр = "Oct" Тогда
		МесяцЧислом = 10;
	ИначеЕсли МесяцСтрокойСокр = "Ноя"
		Или МесяцСтрокойСокр = "Nov" Тогда
		МесяцЧислом = 11;
	ИначеЕсли МесяцСтрокойСокр = "Dec"
		Или МесяцСтрокойСокр = "Дек" Тогда
		МесяцЧислом = 12;
	Иначе
		МесяцЧислом = 0;
	КонецЕсли;
	
	Возврат МесяцЧислом;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура УдалитьНедопустимыеСимволы(Строка) Экспорт
	НедопустимыеСимволы = """'`/\[]{}:;|-=?*<>,.()+#№@!%^&~«»";
	Строка = СтрСоединить(СтрРазделить(Строка, НедопустимыеСимволы, Истина));
КонецПроцедуры

#КонецОбласти
