// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

// Процедура - При открытии
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - модифицируемая форма
//  Отказ	 - Булево - если Истина, то объект не будет создан
//
Процедура ПриОткрытии(Форма, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОбработчика = "ПриОткрытии";
	Если Не СуществуетОбработчикСобытия(Форма.ИмяФормы, ИмяОбработчика) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяМетода = ПолучитьИмяМетода(Форма, ИмяОбработчика);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Форма);
		ПараметрыМетода.Добавить(Отказ);
		
		ВызватьМетод(ИмяМетода, ПараметрыМетода);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - После записи
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - модифицируемая форма
//  ПараметрыЗаписи	 - Структура - параметры записи
//
Процедура ПослеЗаписи(Форма, ПараметрыЗаписи) Экспорт
	
	ИмяОбработчика = "ПослеЗаписи";
	Если Не СуществуетОбработчикСобытия(Форма.ИмяФормы, ИмяОбработчика) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяМетода = ПолучитьИмяМетода(Форма, ИмяОбработчика);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Форма);
		ПараметрыМетода.Добавить(ПараметрыЗаписи);
		
		ВызватьМетод(ИмяМетода, ПараметрыМетода);
	КонецЕсли;
	
КонецПроцедуры

// Функция - Существует обработчик события
//
// Параметры:
//  ИмяФормы	 - Строка - Форма.ИмяФормы
//  Обработчик	 - Строка - Имя проверяемого обработчика
// 
// Возвращаемое значение:
//  Булево - Возвращает истину, если в списке форм найдена форма
//
Функция СуществуетОбработчикСобытия(ИмяФормы, Обработчик = "") Экспорт
	
	Если Обработчик = "ПриОткрытии" Тогда
		Список = пбп_МодификацияКонфигурацииКлиентПовтИсп.СписокФормПриОткрытии();
	ИначеЕсли Обработчик = "ПередЗаписью" Тогда
		Список = пбп_МодификацияКонфигурацииКлиентПовтИсп.СписокФормПередЗаписью();
	ИначеЕсли Обработчик = "ПослеЗаписи" Тогда
		Список = пбп_МодификацияКонфигурацииКлиентПовтИсп.СписокФормПослеЗаписи();
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Список.Получить(ИмяФормы) <> Неопределено;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьИмяМетода(Форма, ИмяПроцедурыВход)
	
	ИмяФормы = Форма.ИмяФормы;
	ЧастиИмениФормы = пбп_ПереадресацияКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяФормы, ".");
	
	КолЭлементов = ЧастиИмениФормы.Количество();
	Если КолЭлементов = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Удалим класс
	ЧастиИмениФормы.Удалить(0);
	Если КолЭлементов > 2 Тогда
		// Удалим слово "Форма"
		ЧастиИмениФормы.Удалить(1);
	КонецЕсли;
	
	ИмяМодуля = "пбп_МодификацияКонфигурацииКлиентПереопределяемый";
	ИмяПроцедуры = СтрСоединить(ЧастиИмениФормы, "") + ИмяПроцедурыВход;
	ИмяМетода = ИмяМодуля + "." + ИмяПроцедуры;
	
	Возврат ИмяМетода;
	
КонецФункции

Процедура ВызватьМетод(ИмяМетода, Параметры)
	
	ПараметрыСтрока = "";
	Если Параметры <> Неопределено И Параметры.Количество() > 0 Тогда
		Для Индекс = 0 По Параметры.ВГраница() Цикл 
			ПараметрыСтрока = ПараметрыСтрока + "Параметры[" + XMLСтрока(Индекс) + "],";
		КонецЦикла;
		ПараметрыСтрока = Сред(ПараметрыСтрока, 1, СтрДлина(ПараметрыСтрока) - 1);
	КонецЕсли;

	Попытка
	#Если Не ВебКлиент Тогда
		Выполнить(ИмяМетода + "(" + ПараметрыСтрока + ")");
	#Иначе
		Результат = Вычислить(ИмяМетода + "(" + ПараметрыСтрока + ")");
	#КонецЕсли
	Исключение
		ТекстСообщения = СтрШаблон("ru = 'Не удалось выполнить метод ""%1"", по причине: %2'",
			ИмяМетода, ОписаниеОшибки());
		ВызватьИсключение НСтр(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

Процедура ДемоРаботаСФормамиФормаДокументаПриОткрытии(Форма, Отказ) Экспорт
	
	пбп_ПереадресацияКлиент.СообщитьПользователю(НСтр("ru = 'Проверка'"));
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции