
#Область ПрограммныйИнтерфейс

Функция ПредопределенныеЗначения() Экспорт	
	
	Результат = ТаблицаПредопределенных();
	
	//Добавление
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Количество дней хранения истории интеграции";
	НоваяНастройка.ИдентификаторНастройки = "КолДнейХраненияИсторииИнтеграции";
	
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Количество дней хранения ошибок истории интеграции";
	НоваяНастройка.ИдентификаторНастройки = "КолДнейХраненияОшибокИсторииИнтеграции";
	
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Тест";
	НоваяНастройка.ИдентификаторНастройки = "Тест";
	//КонецДобавления
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ТаблицаПредопределенных()
	
	Результат = Новый ТаблицаЗначений;
	
	ОписаниеСтрока = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(150));
	
	Результат.Колонки.Добавить("ИдентификаторНастройки", ОписаниеСтрока);
	Результат.Колонки.Добавить("Наименование", ОписаниеСтрока);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти