#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает значение ПВХ по имени.
//
// Параметры:
//  Имя - Строка - Имя переменной ПВХ.
// 
// Возвращаемое значение:
//  ПроизвольныйТип - Значение переменной ПВХ.
// 
Функция ПолучитьЗначение(Имя) Экспорт
	
	// ++ Обход ошибки отстутствия модуля БСП, не переносить
	ОбщегоНазначения = Неопределено;
	ОбщегоНазначенияКлиентСервер = Неопределено;
	// -- Обход ошибки отстутствия модуля БСП, не переносить
	
	УстановитьПривилегированныйРежим(Истина);
	
	Значение = Неопределено;
	
	Если ПланыВидовХарактеристик.__ПредопределенныеЗначения[Имя].СписокЗначений Тогда
		Значение = ОбщегоНазначения.ВыгрузитьКолонку(
			ПланыВидовХарактеристик.__ПредопределенныеЗначения[Имя].ЗначенияЭлементов, "Значение", Истина);
	ИначеЕсли ПланыВидовХарактеристик.__ПредопределенныеЗначения[Имя].Пароль Тогда
		Значение = ПолучитьПарольПоИмени(Имя);
	Иначе
		Значение = ПланыВидовХарактеристик.__ПредопределенныеЗначения[Имя].Значение;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Значение;
	
КонецФункции

// Возвращает соответствие предопределенных элементов ПВХ по имени.
//
// Параметры:
//  Имя - Строка - Имена переменных ПВХ, перечисленные через запятую.
// 
// Возвращаемое значение:
//  - Соответствие - Соответствие имен и значений переменных ПВХ.
// 
Функция ПолучитьПредопределенныеЗначения(Имена) Экспорт
	
	// ++ Обход ошибки отстутствия модуля БСП, не переносить
	ОбщегоНазначения = Неопределено;
	ОбщегоНазначенияКлиентСервер = Неопределено;
	СтроковыеФункцииКлиентСервер = Неопределено;
	// -- Обход ошибки отстутствия модуля БСП, не переносить
	
	УстановитьПривилегированныйРежим(Истина);
	
	СоответствиеЗначений = Новый Соответствие;
	
	МассивИмен = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Имена);
	МассивИмен = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивИмен);
	
	Если Не МассивИмен.Количество() Тогда
		Возврат СоответствиеЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	__ПредопределенныеЗначения.Ссылка КАК ПредопределенноеЗначение,
	               |	__ПредопределенныеЗначения.ИмяПредопределенныхДанных КАК Имя
	               |ПОМЕСТИТЬ ПредопределенныеЗначения
	               |ИЗ
	               |	ПланВидовХарактеристик.__ПредопределенныеЗначения КАК __ПредопределенныеЗначения
	               |ГДЕ
	               |	__ПредопределенныеЗначения.ИмяПредопределенныхДанных В(&МассивИмен)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредопределенныеЗначения.Имя КАК Имя,
	               |	__ПредопределенныеЗначения.Значение КАК Значение,
	               |	ПУСТАЯТАБЛИЦА.( КАК Значение) КАК ЗначенияЭлементов,
	               |	__ПредопределенныеЗначения.Пароль КАК Пароль,
	               |	ЛОЖЬ КАК СписокЗначений
	               |ИЗ
	               |	ПредопределенныеЗначения КАК ПредопределенныеЗначения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.__ПредопределенныеЗначения КАК __ПредопределенныеЗначения
	               |		ПО ПредопределенныеЗначения.ПредопределенноеЗначение = __ПредопределенныеЗначения.Ссылка
	               |			И (НЕ __ПредопределенныеЗначения.СписокЗначений)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПредопределенныеЗначения.Имя,
	               |	НЕОПРЕДЕЛЕНО,
	               |	__ПредопределенныеЗначения.ЗначенияЭлементов.(
	               |		Значение
	               |	),
	               |	ЛОЖЬ,
	               |	ИСТИНА
	               |ИЗ
	               |	ПредопределенныеЗначения КАК ПредопределенныеЗначения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.__ПредопределенныеЗначения КАК __ПредопределенныеЗначения
	               |		ПО ПредопределенныеЗначения.ПредопределенноеЗначение = __ПредопределенныеЗначения.Ссылка
	               |			И (__ПредопределенныеЗначения.СписокЗначений)";
	
	Запрос.УстановитьПараметр("МассивИмен", МассивИмен);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Значение = Неопределено;
		
		Если Выборка.Пароль Тогда
			Значение = ПолучитьПарольПоИмени(Выборка.Имя);
		ИначеЕсли Выборка.СписокЗначений Тогда
			Значение = ОбщегоНазначения.ВыгрузитьКолонку(Выборка.ЗначенияЭлементов.Выгрузить(), "Значение", Истина);
		Иначе
			Значение = Выборка.Значение;
		КонецЕсли;
		
		СоответствиеЗначений.Вставить(Выборка.Имя, Значение);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СоответствиеЗначений;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПарольПоИмени(Имя)
	
	// ++ Обход ошибки отстутствия модуля БСП, не переносить
	ОбщегоНазначения = Неопределено;
	ОбщегоНазначенияКлиентСервер = Неопределено;
	// -- Обход ошибки отстутствия модуля БСП, не переносить
	
	Значение = Неопределено;
	
	ДанныеХранилища = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			Строка(ПланыВидовХарактеристик.__ПредопределенныеЗначения[Имя].УникальныйИдентификатор()));
		
	Если ТипЗнч(ДанныеХранилища) = Тип("Структура") Тогда
		Значение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеХранилища, "bit_password", "");
	Иначе
		Значение = "";
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли