// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

#Область ЗаполнениеДанных

// Заполняет таблицу предопределенных элементов справочника
//  ПланыВидовХарактеристикСсылка.пбп_ПредопределенныеЗначения.
//
// Параметры:
//  Таблица	 - ТаблицаЗначений - Таблица предопределенных элементов.
//
Процедура ПредопределенныеЗначения(Таблица) Экспорт
	
	ОписаниеЧисло = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,0));
	
	// Добавление
	НоваяНастройка = Таблица.Добавить();
	НоваяНастройка.Наименование = "Интеграции";
	НоваяНастройка.ИдентификаторНастройки = "Интеграции";
	НоваяНастройка.ЭтоГруппа = Истина;
	НоваяНастройка.УровеньИерархии = 0;
	
	НоваяНастройка = Таблица.Добавить();
	НоваяНастройка.Наименование = "Интеграции локал";
	НоваяНастройка.ИдентификаторНастройки = "Интеграции_локал";
	НоваяНастройка.ЭтоГруппа = Истина;
	НоваяНастройка.ИдентификаторРодитель = "Интеграции";
	НоваяНастройка.УровеньИерархии = 1;
	
	НоваяНастройка = Таблица.Добавить();
	НоваяНастройка.Наименование = "Тестовая";
	НоваяНастройка.ИдентификаторНастройки = "Тестовая";
	НоваяНастройка.ЭтоГруппа = Истина;
	
	НоваяНастройка = Таблица.Добавить();
	НоваяНастройка.Наименование = "Количество дней хранения истории интеграции";
	НоваяНастройка.ИдентификаторНастройки = "КолДнейХраненияИсторииИнтеграции";
	НоваяНастройка.Пароль = Ложь;
	НоваяНастройка.СписокЗначений = Ложь;
	НоваяНастройка.ТипЗначения = ОписаниеЧисло;
	НоваяНастройка.ИдентификаторРодитель = "Интеграции";
	
	НоваяНастройка = Таблица.Добавить();
	НоваяНастройка.Наименование = "Количество дней хранения ошибок истории интеграции";
	НоваяНастройка.ИдентификаторНастройки = "КолДнейХраненияОшибокИсторииИнтеграции";
	НоваяНастройка.Пароль = Ложь;
	НоваяНастройка.СписокЗначений = Ложь;
	НоваяНастройка.ТипЗначения = ОписаниеЧисло;
	НоваяНастройка.ИдентификаторРодитель = "Интеграции";
	
	НоваяНастройка = Таблица.Добавить();
	НоваяНастройка.Наименование = "Тест булево";
	НоваяНастройка.ИдентификаторНастройки = "Тест_булево";
	НоваяНастройка.Пароль = Ложь;
	НоваяНастройка.СписокЗначений = Ложь;
	НоваяНастройка.ТипЗначения = Новый ОписаниеТипов("Булево");
	НоваяНастройка.ИдентификаторРодитель = "Тестовая";
	НоваяНастройка.Кэшируется = Истина;
	
	НоваяНастройка = Таблица.Добавить();
	НоваяНастройка.Наименование = "Тест список";
	НоваяНастройка.ИдентификаторНастройки = "Тест_список";
	НоваяНастройка.Пароль = Ложь;
	НоваяНастройка.СписокЗначений = Истина;
	НоваяНастройка.ТипЗначения = Новый ОписаниеТипов("Строка");
	// КонецДобавления
	
КонецПроцедуры

// Заполняет таблицу предопределенных элементов справочника СправочникСсылка.пбп_ИнтегрируемыеСистемы.
//
// Параметры:
//  Таблица	 - ТаблицаЗначений - Таблица предопределенных элементов.
//
Процедура ПредопределенныеЗначенияИнтегрируемыеСистемы(Таблица) Экспорт
	
	// Добавление
	НоваяСистема = Таблица.Добавить();
	НоваяСистема.Наименование = "Система N";
	НоваяСистема.ИдентификаторНастройки = "СистемаN";
	
	НоваяСистема = Таблица.Добавить();
	НоваяСистема.Наименование = "Rabbit Mq";
	НоваяСистема.ИдентификаторНастройки = "RabbitMq";
	
	НоваяСистема = Таблица.Добавить();
	НоваяСистема.Наименование = "Kafka";
	НоваяСистема.ИдентификаторНастройки = "Kafka";
	
	НоваяСистема = Таблица.Добавить();
	НоваяСистема.Наименование = "Active directory";
	НоваяСистема.ИдентификаторНастройки = "ActiveDirectory";
	// КонецДобавления
	
КонецПроцедуры

// Заполняет таблицу предопределенных элементов справочника СправочникСсылка.пбп_ИнтеграционныеПотоки.
//
// Параметры:
//  Таблица	 - ТаблицаЗначений - Таблица предопределенных элементов.
//
Процедура ПредопределенныеЗначенияИнтеграционныеПотоки(Таблица) Экспорт
	
	// Добавление
	НовыйМетод = Таблица.Добавить();
	НовыйМетод.Наименование = "Интеграционный поток системы N";
	НовыйМетод.ИдентификаторНастройки = "ИнтеграционныйПотокСистемыN";
	НовыйМетод.НаправлениеПотока = Перечисления.пбп_НаправленияИнтеграционныхПотоков.Исходящий;
	// КонецДобавления
	
КонецПроцедуры

// Заполняет таблицу предопределенных элементов справочника СправочникСсылка.пбп_НастройкиИнтеграции.
//
// Параметры:
//  Таблица	 - ТаблицаЗначений - Таблица предопределенных элементов.
//
Процедура ПредопределенныеЗначенияНастройкиИнтеграции(Таблица) Экспорт
	
	// Добавление
	НоваяНастройка = Таблица.Добавить();
	НоваяНастройка.Наименование = "Интеграция с системой N";
	НоваяНастройка.ИдентификаторНастройки = "ИнтеграцияССистемойN";
	
	НоваяНастройка = Таблица.Добавить();
	НоваяНастройка.Наименование = "Rabbit Mq";
	НоваяНастройка.ИдентификаторНастройки = "RabbitMq";
	НоваяНастройка.ИнтегрируемаяСистема = пбп_ИнтеграцииСервер.ИнтегрируемаяСистема("RabbitMq");
	НоваяНастройка.ТипИнтеграции = Справочники.пбп_ТипыИнтеграций.RabbitMq;
	НоваяНастройка.ТипАвторизации = Перечисления.пбп_ТипыАвторизации.Базовая;
	
	НоваяНастройка = Таблица.Добавить();
	НоваяНастройка.Наименование = "Simple Kafka";
	НоваяНастройка.ИдентификаторНастройки = "SimpleKafka";
	НоваяНастройка.ИнтегрируемаяСистема = пбп_ИнтеграцииСервер.ИнтегрируемаяСистема("Kafka");
	НоваяНастройка.ТипИнтеграции = Справочники.пбп_ТипыИнтеграций.Kafka;
	НоваяНастройка.ТипАвторизации = Перечисления.пбп_ТипыАвторизации.Базовая;
	
	НоваяНастройка = Таблица.Добавить();
	НоваяНастройка.Наименование = "Active directory";
	НоваяНастройка.ИдентификаторНастройки = "ActiveDirectory";
	НоваяНастройка.СтрокаПодключения = "Provider=""ADsDSOObject""";
	НоваяНастройка.ИнтегрируемаяСистема = пбп_ИнтеграцииСервер.ИнтегрируемаяСистема("ActiveDirectory");
	НоваяНастройка.ТипИнтеграции = Справочники.пбп_ТипыИнтеграций.COM;
	НоваяНастройка.ТипАвторизации = Перечисления.пбп_ТипыАвторизации.Базовая;
	НоваяНастройка.ИмяОбъекта = "ADODB.Connection";
	// КонецДобавления
	
КонецПроцедуры

// Заполняет таблицу предопределенных элементов справочника СправочникСсылка.пбп_ТипСоответствияОбъектовИБ.
//
// Параметры:
//  Таблица	 - ТаблицаЗначений - Таблица предопределенных элементов.
//
Процедура ПредопределенныеЗначенияТипСоответствияОбъектовИБ(Таблица) Экспорт
	
	// Добавление
	НовыйТипСоответствия = Таблица.Добавить();
	НовыйТипСоответствия.Наименование = "Тест";
	НовыйТипСоответствия.ИдентификаторНастройки = "Тест";
	НовыйТипСоответствия.Кэшируется = Истина;
	// КонецДобавления
	
КонецПроцедуры

#КонецОбласти

#Область СтруктурыКолонокТаблиц

// Возвращает колонки предопределенные значения
//
// Возвращаемое значение:
//  Массив - Список имен полей
//
Функция КолонкиПредопределенныеЗначения() Экспорт
	
	Колонки = Новый Массив;
	
	// Добавление
	Колонки.Добавить("Пароль");
	Колонки.Добавить("СписокЗначений");
	Колонки.Добавить("ТипЗначения");
	Колонки.Добавить("Кэшируется");
	// КонецДобавления
	
	Возврат Колонки;
	
КонецФункции

// Возвращает колонки интегрируемые системы
//
// Возвращаемое значение:
//  Массив - Список имен полей
//
Функция КолонкиИнтегрируемыеСистемы() Экспорт
	
	Колонки = Новый Массив;
	
	// Добавление
	
	// КонецДобавления
	
	Возврат Колонки;
	
КонецФункции

// Возвращает колонки интеграционные потоки
//
// Возвращаемое значение:
//  Массив - Список имен полей
//
Функция КолонкиИнтеграционныеПотоки() Экспорт
	
	Колонки = Новый Массив;
	
	// Добавление
	Колонки.Добавить("НаправлениеПотока");
	Колонки.Добавить("КлючРегламентногоЗадания");
	// КонецДобавления
	
	Возврат Колонки;
	
КонецФункции

// Возвращает колонки настройки интеграции
//
// Возвращаемое значение:
//  Массив - Список имен полей
//
Функция КолонкиНастройкиИнтеграции() Экспорт
	
	Колонки = Новый Массив;
	
	// Добавление
	Колонки.Добавить("ИнтегрируемаяСистема");
	Колонки.Добавить("ТипИнтеграции");
	Колонки.Добавить("СтрокаПодключения");
	Колонки.Добавить("ТипАвторизации");
	Колонки.Добавить("ИмяОбъекта");
	// КонецДобавления
	
	Возврат Колонки;
	
КонецФункции

// Возвращает колонки тип соответствия объектов ИБ
//
// Возвращаемое значение:
//  Массив - Список имен полей
//
Функция КолонкиТипСоответствияОбъектовИБ() Экспорт
	
	Колонки = Новый Массив;
	
	// Добавление
	Колонки.Добавить("Кэшируется");
	// КонецДобавления
	
	Возврат Колонки;
	
КонецФункции

#КонецОбласти

#Область ДобавляемыеПоляДляРасчетаХеша

// Возвращает поля для расчета хеша
// 
// Возвращаемое значение:
//  Массив - Массив имен полей для расчета хеша
//
Функция ДобавляемыеПоляДляРасчетаХешаПредопределенныеЗначения() Экспорт
	
	Колонки = Новый Массив;
	
	// Добавление
	Колонки.Добавить("Пароль");
	Колонки.Добавить("СписокЗначений");
	Колонки.Добавить("ТипЗначения");
	Колонки.Добавить("Кэшируется");
	// КонецДобавления
	
	Возврат Колонки;
	
КонецФункции

// Возвращает поля для расчета хеша
// 
// Возвращаемое значение:
//  Массив - Массив имен полей для расчета хеша
//
Функция ДобавляемыеПоляДляРасчетаХешаИнтегрируемыеСистемы() Экспорт
	
	Колонки = Новый Массив;
	
	// Добавление
	
	// КонецДобавления
	
	Возврат Колонки;
	
КонецФункции

// Возвращает поля для расчета хеша
// 
// Возвращаемое значение:
//  Массив - Массив имен полей для расчета хеша
//
Функция ДобавляемыеПоляДляРасчетаХешаИнтеграционныеПотоки() Экспорт
	
	Колонки = Новый Массив;
	
	// Добавление
	Колонки.Добавить("НаправлениеПотока");
	Колонки.Добавить("КлючРегламентногоЗадания");
	// КонецДобавления
	
	Возврат Колонки;
	
КонецФункции

// Возвращает поля для расчета хеша
// 
// Возвращаемое значение:
//  Массив - Массив имен полей для расчета хеша
//
Функция ДобавляемыеПоляДляРасчетаХешаНастройкиИнтеграции() Экспорт
	
	Колонки = Новый Массив;
	
	// Добавление
	
	// КонецДобавления
	
	Возврат Колонки;
	
КонецФункции

// Возвращает поля для расчета хеша
// 
// Возвращаемое значение:
//  Массив - Массив имен полей для расчета хеша
//
Функция ДобавляемыеПоляДляРасчетаХешаТипСоответствияОбъектовИБ() Экспорт
	
	Колонки = Новый Массив;
	
	// Добавление
	Колонки.Добавить("Кэшируется");
	// КонецДобавления
	
	Возврат Колонки;
	
КонецФункции

#КонецОбласти

#Область СтандартныеПоля

// Возвращает список стандартных полей, добавляемых к таблице предопределенных значений
//
// Возвращаемое значение:
//  Массив - Массив имен стандартных полей
//
Функция ДобавляемыеСтандартныеПоля() Экспорт
	
	Поля = Новый Массив;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ИдентификаторНастройки");
	Поля.Добавить("ЭтоГруппа");
	Поля.Добавить("Родитель");
	
	Поля.Добавить(пбп_ПредопределенныеЗначенияСлужебный.ИмяПоляПредопределенности());
	
	Возврат Поля;
	
КонецФункции

// Возвращает список стандартных полей, удаляемых из таблицы предопределенных значений
//
// Возвращаемое значение:
//  Массив - Массив имен стандартных полей
//
Функция УдаляемыеСтандартныеПоля() Экспорт
	
	Поля = Новый Массив;
	
	Поля.Добавить(пбп_ПредопределенныеЗначенияСлужебный.ИмяПоляПредопределенности());
	
	Возврат Поля;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

// Возвращает общие колонки с описанием типов для таблицы предопределенных значений
// 
// Параметры:
//  Менеджер - СправочникМенеджер, ПланВидовХарактеристикМенеджер	 - менеджер объекта метаданных.
//
// Возвращаемое значение:
//  Структура - где ключ - имя колонки, значение - описание типов колонки
//
Функция ОбщиеКолонкиСОписаниемТипов(Менеджер) Экспорт
	
	массив = Новый Массив;
	массив.Добавить(ТипЗнч(Менеджер.ПустаяСсылка()));
	ОписаниеТиповЭлемента = Новый ОписаниеТипов(массив);
	
	Колонки = Новый Структура;
	
	ОписаниеСтрока = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеБулево = Новый ОписаниеТипов("Булево");
	
	Колонки.Вставить("УровеньИерархии", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(2,0)));
	Колонки.Вставить("ИдентификаторРодитель", ОписаниеСтрока);
	
	Колонки.Вставить("Служебный_ХешСумма", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(32)));
	Колонки.Вставить("Служебный_ОбновитьЭлемент", ОписаниеБулево);
	Колонки.Вставить("Служебный_УстановитьФлагРучноеИзменение", ОписаниеБулево);
	Колонки.Вставить("Служебный_ПредопределенныйЭлемент", ОписаниеТиповЭлемента);
	Колонки.Вставить("Служебный_СоздатьЗаписьРегистра", ОписаниеБулево);
	Колонки.Вставить("Служебный_Иерархический", ОписаниеБулево);
	Колонки.Вставить("Служебный_ИерархияГруппИЭлементов", ОписаниеБулево);
	
	Возврат Колонки;
	
КонецФункции

#КонецОбласти