
#Область ПрограммныйИнтерфейс

// Возвращает таблицу предопределенных элементов справочника
// ПланыВидовХарактеристикСсылка.пбп_ПредопределенныеЗначения.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица заполненная предопределенными элементами.
//
Функция ПредопределенныеЗначения() Экспорт
	
	Результат = ТаблицаПредопределенных();

	ОписаниеЧисло = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,0));
	
	// Добавление
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Интеграции";
	НоваяНастройка.ИдентификаторНастройки = "Интеграции";
	НоваяНастройка.ЭтоГруппа = Истина;
	НоваяНастройка.УровеньИерархии = 0;
	
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Интеграции локал";
	НоваяНастройка.ИдентификаторНастройки = "Интеграции_локал";
	НоваяНастройка.ЭтоГруппа = Истина;
	НоваяНастройка.Родитель = "Интеграции";
	НоваяНастройка.УровеньИерархии = 1;
	
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Тестовая";
	НоваяНастройка.ИдентификаторНастройки = "Тестовая";
	НоваяНастройка.ЭтоГруппа = Истина;
	
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Количество дней хранения истории интеграции";
	НоваяНастройка.ИдентификаторНастройки = "КолДнейХраненияИсторииИнтеграции";
	НоваяНастройка.Пароль = Ложь;
	НоваяНастройка.СписокЗначений = Ложь;
	НоваяНастройка.ТипЗначения = ОписаниеЧисло;
	НоваяНастройка.Родитель = "Интеграции";
	
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Количество дней хранения ошибок истории интеграции";
	НоваяНастройка.ИдентификаторНастройки = "КолДнейХраненияОшибокИсторииИнтеграции";
	НоваяНастройка.Пароль = Ложь;
	НоваяНастройка.СписокЗначений = Ложь;
	НоваяНастройка.ТипЗначения = ОписаниеЧисло;
	НоваяНастройка.Родитель = "Интеграции";
	
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Тест_бул";
	НоваяНастройка.ИдентификаторНастройки = "Тест_бул";
	НоваяНастройка.Пароль = Ложь;
	НоваяНастройка.СписокЗначений = Ложь;
	НоваяНастройка.ТипЗначения = Новый ОписаниеТипов("Булево");
	НоваяНастройка.Родитель = "Тестовая";
	
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Тест_список";
	НоваяНастройка.ИдентификаторНастройки = "Тест_список";
	НоваяНастройка.Пароль = Ложь;
	НоваяНастройка.СписокЗначений = Истина;
	НоваяНастройка.ТипЗначения = Новый ОписаниеТипов("Строка");
	// КонецДобавления
	
	Возврат Результат;
	
КонецФункции

// Возвращает таблицу предопределенных элементов справочника СправочникСсылка.пбп_ИнтегрируемыеСистемы.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица заполненная предопределенными элементами.
//
Функция ПредопределенныеЗначенияИнтегрируемыеСистемы() Экспорт
	
	Результат = ТаблицаПредопределенныхИнтегрируемыеСистемы();
	
	// Добавление
	НоваяСистема = Результат.Добавить();
	НоваяСистема.Наименование = "Система N";
	НоваяСистема.ИдентификаторНастройки = "СистемаN";
	
	НоваяСистема = Результат.Добавить();
	НоваяСистема.Наименование = "Rabbit Mq";
	НоваяСистема.ИдентификаторНастройки = "RabbitMq";
	
	НоваяСистема = Результат.Добавить();
	НоваяСистема.Наименование = "Kafka";
	НоваяСистема.ИдентификаторНастройки = "Kafka";
	
	НоваяСистема = Результат.Добавить();
	НоваяСистема.Наименование = "Active directory";
	НоваяСистема.ИдентификаторНастройки = "ActiveDirectory";
	// КонецДобавления
	
	Возврат Результат;
	
КонецФункции

// Возвращает таблицу предопределенных элементов справочника СправочникСсылка.пбп_МетодыИнтеграции.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица заполненная предопределенными элементами.
//
Функция ПредопределенныеЗначенияИнтеграционныеПотоки() Экспорт
	
	Результат = ТаблицаПредопределенныхИнтеграционныеПотоки();
	
	// Добавление
	НовыйМетод = Результат.Добавить();
	НовыйМетод.Наименование = "Интеграционный поток системы N";
	НовыйМетод.ИдентификаторНастройки = "ИнтеграционныйПотокСистемыN";
	// КонецДобавления
	// НачалоУдаления
	НовыйМетод = Результат.Добавить();
	НовыйМетод.Наименование = "SFTP исх";
	НовыйМетод.ИдентификаторНастройки = "SFTPИсх";
	
	НовыйМетод = Результат.Добавить();
	НовыйМетод.Наименование = "SFTP вх";
	НовыйМетод.ИдентификаторНастройки = "SFTPВх";
	
	НовыйМетод = Результат.Добавить();
	НовыйМетод.Наименование = "Каталог исх";
	НовыйМетод.ИдентификаторНастройки = "КаталогИсх";
	
	НовыйМетод = Результат.Добавить();
	НовыйМетод.Наименование = "Каталог вх";
	НовыйМетод.ИдентификаторНастройки = "КаталогВх";
	
	НовыйМетод = Результат.Добавить();
	НовыйМетод.Наименование = "Rest вх";
	НовыйМетод.ИдентификаторНастройки = "RESTВх";
	
	НовыйМетод = Результат.Добавить();
	НовыйМетод.Наименование = "Rest исх";
	НовыйМетод.ИдентификаторНастройки = "RESTИсх";
	
	НовыйМетод = Результат.Добавить();
	НовыйМетод.Наименование = "COM";
	НовыйМетод.ИдентификаторНастройки = "COM";
	// КонецУдаления
	
	Возврат Результат;
	
КонецФункции

// Возвращает таблицу предопределенных элементов справочника СправочникСсылка.пбп_НастройкиИнтеграции.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица заполненная предопределенными элементами.
//
Функция ПредопределенныеЗначенияНастройкиИнтеграции() Экспорт
	
	Результат = ТаблицаПредопределенныхНастройкиИнтеграции();
	
	// Добавление
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Интеграция с системой N";
	НоваяНастройка.ИдентификаторНастройки = "ИнтеграцияССистемойN";
	
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Rabbit Mq";
	НоваяНастройка.ИдентификаторНастройки = "RabbitMq";
	НоваяНастройка.ИнтегрируемаяСистема = пбп_ИнтеграцииСлужебный.ИнтегрируемаяСистема("RabbitMq");
	НоваяНастройка.ТипИнтеграции = Справочники.пбп_ТипыИнтеграций.RabbitMq;
	НоваяНастройка.ТипАвторизации = Перечисления.пбп_ТипыАвторизации.Базовая;
	
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Simple Kafka";
	НоваяНастройка.ИдентификаторНастройки = "SimpleKafka";
	НоваяНастройка.ИнтегрируемаяСистема = пбп_ИнтеграцииСлужебный.ИнтегрируемаяСистема("Kafka");
	НоваяНастройка.ТипИнтеграции = Справочники.пбп_ТипыИнтеграций.Kafka;
	НоваяНастройка.ТипАвторизации = Перечисления.пбп_ТипыАвторизации.Базовая;
	
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Active directory";
	НоваяНастройка.ИдентификаторНастройки = "ActiveDirectory";
	НоваяНастройка.СтрокаПодключения = "Provider=""ADsDSOObject""";
	НоваяНастройка.ИнтегрируемаяСистема = пбп_ИнтеграцииСлужебный.ИнтегрируемаяСистема("ActiveDirectory");
	НоваяНастройка.ТипИнтеграции = Справочники.пбп_ТипыИнтеграций.COM;
	НоваяНастройка.ТипАвторизации = Перечисления.пбп_ТипыАвторизации.Базовая;
	НоваяНастройка.ИмяОбъекта = "ADODB.Connection";
	// КонецДобавления
	// НачалоУдаления
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "SFTP";
	НоваяНастройка.ИдентификаторНастройки = "SFTP";
	НоваяНастройка.ИнтегрируемаяСистема = пбп_ИнтеграцииСлужебный.ИнтегрируемаяСистема("СистемаN");
	НоваяНастройка.ТипИнтеграции = Справочники.пбп_ТипыИнтеграций.SFTP;
	НоваяНастройка.ТипАвторизации = Перечисления.пбп_ТипыАвторизации.Базовая;
	
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Каталог";
	НоваяНастройка.ИдентификаторНастройки = "Каталог";
	НоваяНастройка.ИнтегрируемаяСистема = пбп_ИнтеграцииСлужебный.ИнтегрируемаяСистема("СистемаN");
	НоваяНастройка.ТипИнтеграции = Справочники.пбп_ТипыИнтеграций.Локальный;
	НоваяНастройка.ТипАвторизации = Перечисления.пбп_ТипыАвторизации.Базовая;
	
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "REST API";
	НоваяНастройка.ИдентификаторНастройки = "RestAPI";
	НоваяНастройка.ИнтегрируемаяСистема = пбп_ИнтеграцииСлужебный.ИнтегрируемаяСистема("СистемаN");
	НоваяНастройка.ТипИнтеграции = Справочники.пбп_ТипыИнтеграций.RESTAPI;
	НоваяНастройка.ТипАвторизации = Перечисления.пбп_ТипыАвторизации.Базовая;
	// КонецУдаления
	
	Возврат Результат;
	
КонецФункции

// Возвращает таблицу предопределенных элементов справочника СправочникСсылка.пбп_ТипСоответствияОбъектовИБ.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица заполненная предопределенными элементами.
//
Функция ПредопределенныеЗначенияТипСоответствияОбъектовИБ() Экспорт
	
	Результат = ТаблицаПредопределенныхТипСоответствияОбъектовИБ();
	
	// Добавление
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Тест";
	НоваяНастройка.ИдентификаторНастройки = "Тест";
	// КонецДобавления
	
	Возврат Результат;
	
КонецФункции

// Добавляет общие колонки таблицы предопределенных значений.
//
// Параметры:
//  Таблица - ТаблицаЗначений - Таблица для заполнения предопределенными.
//
Процедура ОбщиеКолонкиТаблицыПредопределенныхЗначений(Таблица) Экспорт
	
	ОписаниеСтрока = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(150));
	ОписаниеБулево = Новый ОписаниеТипов("Булево");
	
	Таблица.Колонки.Добавить("ИдентификаторНастройки", ОписаниеСтрока);
	Таблица.Колонки.Добавить("Наименование", ОписаниеСтрока);
	Таблица.Колонки.Добавить("ЭтоГруппа", ОписаниеБулево);
	Таблица.Колонки.Добавить("Родитель", ОписаниеСтрока);
	Таблица.Колонки.Добавить("УровеньИерархии", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(2,0)));
	// Служебные колонки
	Таблица.Колонки.Добавить("Служеб_ОбновитьРасположениеЭлемента", ОписаниеБулево);
	Таблица.Колонки.Добавить("Служеб_СсылкаНаПредопределенныйЭлемент", Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ТаблицаПредопределенных()
	
	ОписаниеБулево = Новый ОписаниеТипов("Булево");
	
	Результат = Новый ТаблицаЗначений;
	
	ОбщиеКолонкиТаблицыПредопределенныхЗначений(Результат);
	
	Результат.Колонки.Добавить("Пароль", ОписаниеБулево);
	Результат.Колонки.Добавить("СписокЗначений", ОписаниеБулево);
	Результат.Колонки.Добавить("ТипЗначения", Новый ОписаниеТипов("ОписаниеТипов"));
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаПредопределенныхИнтегрируемыеСистемы()
	
	Результат = Новый ТаблицаЗначений;
	
	ОбщиеКолонкиТаблицыПредопределенныхЗначений(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаПредопределенныхИнтеграционныеПотоки()
	
	Результат = Новый ТаблицаЗначений;
	
	ОбщиеКолонкиТаблицыПредопределенныхЗначений(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаПредопределенныхНастройкиИнтеграции()
	
	Результат = Новый ТаблицаЗначений;
	
	ОбщиеКолонкиТаблицыПредопределенныхЗначений(Результат);
	
	Результат.Колонки.Добавить("ИнтегрируемаяСистема"	, Новый ОписаниеТипов("СправочникСсылка.пбп_ИнтегрируемыеСистемы"));
	Результат.Колонки.Добавить("ТипИнтеграции"			, Новый ОписаниеТипов("СправочникСсылка.пбп_ТипыИнтеграций"));
	Результат.Колонки.Добавить("СтрокаПодключения"		, пбп_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(200));
	Результат.Колонки.Добавить("ТипАвторизации"			, Новый ОписаниеТипов("ПеречислениеСсылка.пбп_ТипыАвторизации"));
	Результат.Колонки.Добавить("ИмяОбъекта"				, пбп_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(100));
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаПредопределенныхТипСоответствияОбъектовИБ()
	
	Результат = Новый ТаблицаЗначений;
	
	ОбщиеКолонкиТаблицыПредопределенныхЗначений(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти