// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

// Процедура - При открытии
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - модифицируемая форма
//  Отказ	 - Булево - если Истина, то объект не будет создан
//
Процедура ПриОткрытии(Форма, Отказ) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "ТипМетаданных.ИмяОбработки.Форма.ИмяФормы" Тогда
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - После записи
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - модифицируемая форма
//  ПараметрыЗаписи	 - Структура - параметры записи
//
Процедура ПослеЗаписи(Форма, ПараметрыЗаписи) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "ТипМетаданных.ИмяОбработки.Форма.ИмяФормы" Тогда
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - Существует обработчик события
//
// Параметры:
//  ИмяФормы	 - Строка - Форма.ИмяФормы
//  Обработчик	 - Строка - Имя проверяемого обработчика
// 
// Возвращаемое значение:
//  Булево - Возвращает истину, если в списке форм найдена форма
//
Функция СуществуетОбработчикСобытия(ИмяФормы, Обработчик = "") Экспорт
	
	Если Обработчик = "ПриОткрытии" Тогда
		Список = __МодификацияКонфигурацииКлиентПовтИсп.СписокФормПриОткрытии();
	ИначеЕсли Обработчик = "ПередЗаписью" Тогда
		Список = __МодификацияКонфигурацииКлиентПовтИсп.СписокФормПередЗаписью();
	ИначеЕсли Обработчик = "ПослеЗаписи" Тогда
		Список = __МодификацияКонфигурацииКлиентПовтИсп.СписокФормПослеЗаписи();
	КонецЕсли;
	
	Возврат Список.Получить(ИмяФормы) <> Неопределено;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс