// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает значение ПВХ по идентификатору.
//
// Параметры:
//  Идентификатор - Строка - Идентификатор переменной ПВХ.
// 
// Возвращаемое значение:
//  ПроизвольныйТип - Значение переменной ПВХ.
// 
Функция ПолучитьЗначение(Ссылка, ВыбрасыватьИсключение = Ложь, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Значение = ЗначенияПредопределенныхЭлементов(Ссылка);
	
	Если Значение = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Возвращает соответствие предопределенных элементов ПВХ по Идентификаторам.
//
// Параметры:
//  Идентификаторы - Строка - Идентификаторы переменных ПВХ, перечисленные через запятую.
//  ВРазрезеКлючей - Булево - Признак получения данных в виде соответствия, где Ключ - Имя переменной.
// 
// Возвращаемое значение:
//  - Соответствие - Соответствие имен и значений переменных ПВХ.
//  - Массив - Массив значений переменных ПВХ.
// 
Функция ПолучитьЗначения(Ссылки, ВыбрасыватьИсключение = Ложь, ВРазрезеКлючей = Ложь) Экспорт
	
	Значения = ЗначенияПредопределенныхЭлементов(Ссылки, Истина, ВРазрезеКлючей);
	
	Возврат Значения;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Значения предопределенных элементов по идентификаторам
//
// Параметры:
//  Ссылки					 - ПланВидовХарактеристикСсылка.пбп_ПредопределенныеЗначения - ссылка на предопределенный элемент.
//							 - Массив из ПланВидовХарактеристикСсылка.пбп_ПредопределенныеЗначения - ссылки на предопределенные элементы.
//  МножественныйВыбор		 - Булево - Ложь - вернется одно значение произвольного типа,
//								        Истина - вернется массив или соответствие в разрезе ключей со значениями
//  ВРазрезеКлючей			 - Булево - Ложь - вернется массив значений без учета идентификаторов,
//								        Истина - вернется соответствие со значениями в разрезе ключей
//  ВыбрасыватьИсключение	 - Булево - выбрасывать исключение, если есть ошибки.
//
// Возвращаемое значение:
//  Массив - содержит значение предопределенных элементов в порядке, в котором были переданы идентификаторы.
//  Соответствие из КлючИЗначение - список идентификаторов и значений элементов:
//   * Ключ - Строка - ИдентификаторНастройки;
//   * Значение - Произвольный - значение элемента
//
Функция ЗначенияПредопределенныхЭлементов(Знач Ссылки, МножественныйВыбор = Ложь, ВРазрезеКлючей = Ложь, ВыбрасыватьИсключение = Ложь)
	
	Если ТипЗнч(Ссылки) = Тип("ПланВидовХарактеристикСсылка.пбп_ПредопределенныеЗначения") Тогда
		Ссылки = пбп_ПереадресацияКлиентСервер.ЗначениеВМассиве(Ссылки);
	КонецЕсли;
	
	Результат = Неопределено;
	Если МножественныйВыбор Тогда
		Если ВРазрезеКлючей Тогда
			Результат = Новый Соответствие;
		Иначе
			Результат = Новый Массив;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Ссылки) <> Тип("Массив") Тогда
		Если ВыбрасыватьИсключение Тогда
			ВызватьИсключение (пбп_ПереадресацияКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Неверный тип первого параметра ''%1'', ожидалось <Массив>'"),
				"Ссылки"),
				КатегорияОшибки.ОшибкаКонфигурации);
		КонецЕсли;
		
		Возврат Результат;
	КонецЕсли;
	
	ДанныеПредопределенныхЗначений = ПолучитьДанныеПредопределенныхЗначений(Ссылки, МножественныйВыбор);
	ВыборкаСписок = ДанныеПредопределенныхЗначений.ВыборкаСписок;
	ВыборкаЗначения = ДанныеПредопределенныхЗначений.ВыборкаЗначения;
	
	// список значений
	Пока ВыборкаСписок.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаСписок.Выбрать();
		Значение = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Значение.Добавить(ВыборкаДетальныеЗаписи.Значение);
		КонецЦикла;
		пбп_ПредопределенныеЗначения.ДополнитьЗначенияПредопределенных(
			Результат, Значение, ВыборкаСписок.Ссылка, МножественныйВыбор);
	КонецЦикла;
	
	// значение и пароль
	Пока ВыборкаЗначения.Следующий() Цикл
		Если ВыборкаЗначения.Пароль Тогда
			УИД = ВыборкаЗначения.Ссылка.УникальныйИдентификатор();
			Значение = ПолучитьПарольПоИдентификатору(УИД);
		Иначе
			Значение = ВыборкаЗначения.Значение;
		КонецЕсли;
		пбп_ПредопределенныеЗначения.ДополнитьЗначенияПредопределенных(
			Результат, Значение, ВыборкаЗначения.Ссылка, МножественныйВыбор);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеПредопределенныхЗначений(Ссылки, МножественныйВыбор = Ложь)
	
	ДанныеПредопределенныхЗначений = Новый Структура;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	пбп_ПредопределенныеЗначения.Ссылка КАК Ссылка,
		|	пбп_ПредопределенныеЗначения.СписокЗначений КАК СписокЗначений,
		|	пбп_ПредопределенныеЗначения.Пароль КАК Пароль,
		|	пбп_ПредопределенныеЗначения.Значение КАК Значение
		//|	пбп_ПредопределенныеЗначения.ИдентификаторНастройки КАК Идентификатор
		|ПОМЕСТИТЬ Предопределенные
		|ИЗ
		|	ПланВидовХарактеристик.пбп_ПредопределенныеЗначения КАК пбп_ПредопределенныеЗначения
		|ГДЕ
		|	пбп_ПредопределенныеЗначения.Ссылка В(&Ссылки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПредопределенныеЗначения.Ссылка КАК Ссылка,
		|	ПредопределенныеЗначения.СписокЗначений КАК СписокЗначений,
		|	ПредопределенныеЗначения.Пароль КАК Пароль,
		|	ВЫБОР
		|		КОГДА ПредопределенныеЗначения.СписокЗначений
		|			ТОГДА пбп_ПредопределенныеЗначенияЗначенияЭлементов.Значение
		|		КОГДА НЕ ПредопределенныеЗначения.Пароль
		|			ТОГДА ПредопределенныеЗначения.Значение
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Значение
		//|	ПредопределенныеЗначения.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ ЗначенияПредопределенных
		|ИЗ
		|	Предопределенные КАК ПредопределенныеЗначения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.пбп_ПредопределенныеЗначения.ЗначенияЭлементов КАК пбп_ПредопределенныеЗначенияЗначенияЭлементов
		|		ПО ПредопределенныеЗначения.Ссылка = пбп_ПредопределенныеЗначенияЗначенияЭлементов.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПредопределенных.Ссылка Как Ссылка,
		|	ЗначенияПредопределенных.Значение КАК Значение
		//|	ЗначенияПредопределенных.Идентификатор КАК Идентификатор
		|ИЗ
		|	ЗначенияПредопределенных КАК ЗначенияПредопределенных
		|ГДЕ
		|	ЗначенияПредопределенных.СписокЗначений
		|	И НЕ ЗначенияПредопределенных.Значение ЕСТЬ NULL
		|ИТОГИ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПредопределенных.Ссылка КАК Ссылка,
		|	ЗначенияПредопределенных.Пароль КАК Пароль,
		|	ЗначенияПредопределенных.Значение КАК Значение
		//|	ЗначенияПредопределенных.Идентификатор КАК Идентификатор
		|ИЗ
		|	ЗначенияПредопределенных КАК ЗначенияПредопределенных
		|ГДЕ
		|	НЕ ЗначенияПредопределенных.СписокЗначений";
	
	Если Не МножественныйВыбор Тогда
		Схема = Новый СхемаЗапроса;
		Схема.УстановитьТекстЗапроса(ТекстЗапроса);
		ОператорВыбрать = Схема.ПакетЗапросов[0].Операторы[0];
		//ВыражениеОтбора = 
		//	Новый ВыражениеСхемыЗапроса("пбп_ПредопределенныеЗначения.Ссылка = &Ссылки");
	
		ОператорВыбрать.КоличествоПолучаемыхЗаписей = 1;
		//ОператорВыбрать.Отбор.Установить(0, ВыражениеОтбора);
		ТекстЗапроса = Схема.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеПредопределенныхЗначений.Вставить("ВыборкаСписок",
		РезультатыЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	ДанныеПредопределенныхЗначений.Вставить("ВыборкаЗначения", РезультатыЗапроса[3].Выбрать());
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДанныеПредопределенныхЗначений;
	
КонецФункции

Функция ПолучитьПарольПоИдентификатору(УИД)
	
	ДанныеХранилища = пбп_Переадресация.ПрочитатьДанныеИзБезопасногоХранилища(Строка(УИД));
	
	Значение = "";
	Если ТипЗнч(ДанныеХранилища) = Тип("Структура") Тогда
		Значение = пбп_ПереадресацияКлиентСервер.СвойствоСтруктуры(ДанныеХранилища, "bit_password", "");
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли