#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты
		.ДобавитьТестовыйНабор("Тесты функции ОписаниеТипаЧисло")
			.ДобавитьТест("ТестДолженСоздатьТипЧисло")
			.ДобавитьТест("ТестДолженВернутьОписаниеЧислаСКорректнымЗнаком")
			.ДобавитьТест("ТестДолженУстановитьЗнакЛюбойПриОтсутствииЯвнойУказки");
			
	ЮТТесты.ДобавитьТест("ТестПолученияТаблицыДатЗаПериод");


КонецПроцедуры

#КонецОбласти


#Область Тесты

Процедура ТестДолженСоздатьТипЧисло() Экспорт
	
	Описание = пбп_Переадресация.ОписаниеТипаЧисло(10, 2, ДопустимыйЗнак.Неотрицательный);
	ЮТест.ОжидаетЧто(Тип(Описание)).Равно(Тип("Число"));

КонецПроцедуры

Процедура ТестДолженВернутьОписаниеЧислаСКорректнымЗнаком() Экспорт
	
	Описание = пбп_Переадресация.ОписаниеТипаЧисло(10, 2, ДопустимыйЗнак.Неотрицательный);
	Проверка = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Неотрицательный));

	ЮТест.ОжидаетЧто(Проверка).Равно(Проверка);

КонецПроцедуры

Процедура ТестДолженУстановитьЗнакЛюбойПриОтсутствииЯвнойУказки() Экспорт

	Описание = пбп_Переадресация.ОписаниеТипаЧисло(10, 2);
	Проверка = пбп_Переадресация.ОписаниеТипаЧисло(10, 2, ДопустимыйЗнак.Любой);

	ЮТест.ОжидаетЧто(Описание).Равно(Проверка);

КонецПроцедуры

Процедура ТестПолученияТаблицыДатЗаПериод() Экспорт 
	
	НачалоПериода = '20200101';
	ОкончаниеПериода = '20200110';
	Интервал = "День";

	Результат = пбп_ОбщегоНазначенияСервер.ПолучитьТаблицуДатЗаПериод(НачалоПериода, ОкончаниеПериода, Интервал);

	ОжидаемыйРезультат = Новый ТаблицаЗначений;
	ОжидаемыйРезультат.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ДобавитьСтрокуВТаблицу(ОжидаемыйРезультат, '20200101');
	ДобавитьСтрокуВТаблицу(ОжидаемыйРезультат, '20200102');
	ДобавитьСтрокуВТаблицу(ОжидаемыйРезультат, '20200103');
	ДобавитьСтрокуВТаблицу(ОжидаемыйРезультат, '20200104');
	ДобавитьСтрокуВТаблицу(ОжидаемыйРезультат, '20200105');
	ДобавитьСтрокуВТаблицу(ОжидаемыйРезультат, '20200106');
	ДобавитьСтрокуВТаблицу(ОжидаемыйРезультат, '20200107');
	ДобавитьСтрокуВТаблицу(ОжидаемыйРезультат, '20200108');
	ДобавитьСтрокуВТаблицу(ОжидаемыйРезультат, '20200109');
	ДобавитьСтрокуВТаблицу(ОжидаемыйРезультат, '20200110');

	ЮТест.ОжидаетЧто(Результат.Количество()).Равно(ОжидаемыйРезультат.Количество());

	Для каждого Строка Из Результат Цикл
		ЮТест.ОжидаетЧто(Строка.Период).Равно(ОжидаемыйРезультат[Результат.Индекс(Строка)].Период);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокуВТаблицу(Таблица, Дата) Экспорт
	
	Строка = Таблица.Добавить();
	Строка.Период = Дата;
	
КонецПроцедуры

#КонецОбласти

