
#Область ПрограммныйИнтерфейс

#Область Справочники

// Процедура-пример обработчика Datareon ESB.
// Вызов данной процедуры прописывается в самой шине для соответствующего типа сообщения обмена.
// Подсистема обмена Datareon (поставляемая вендором шины), выполняет указанный в шине вызов,
// передавая в параметры процедуры контекст обмена.
// Набор параметров предопределенный и соответствует вызову из подсистемы вендора шины.
//
// Параметры:
//  СообщениеОбмена				 - Строка	 - данные сообщения обмена
//  Источник					 - Строка, ПланОбменаСсылка, СправочникСсылка.пбп_ИнтегрируемыеСистемы -
//                                 имя ИС-источника сообщения или уже найденная ссылка узла
//  Идентификатор				 - Строка	 - внутренний идентификатор сообщения в очереди шины
//  СостояниеСообщения			 - ПеречислениеСсылка	 - состояние загрузки сообщения обмена
//  Задержка					 - Число	 - количество секунд для повторной загрузки в случае ошибки
// или повторной обработки сообщения обмена (в этом случае сообщение не удаляется из входящей очереди шины)
//  КоличествоПопытокОжидания	 - Число	 - количество попыток загрузки в случае повторной обработки сообщения.
// После указанного количества попыток загрузки, сообщение заархивируется и будет удалено из входящей очереди)
//  Функции						 - Массив	 - названия функций для доп. обработки
//  ТекстОшибки					 - Строка	 - текст ошибки обмена (будет видна в шине, в том числе)
//
Процедура Справочник_пбп_ИнтеграционныеПотоки(СообщениеОбмена, Источник, Идентификатор,
	СостояниеСообщения, Задержка, КоличествоПопытокОжидания, Функции, ТекстОшибки) Экспорт
	
	Поток = "ПолучениеИнтеграционногоПотока";
	
	СтруктураИстории = пбп_ИнтеграцииШина.ИнициализироватьСтруктуруЗаписиИсторииИнтеграции(
		Поток, СообщениеОбмена);
	
	Попытка
		ОбъектXDTO = пбп_ИнтеграцииСлужебный.ПолучитьОбъектXDTOИзСообщенияОбменаJSON(СообщениеОбмена);
		
		ПараметрыОбмена = пбп_ИнтеграцииШина.ИнициализироватьПараметрыОбмена(
			Поток, Источник, Задержка, КоличествоПопытокОжидания,
			Функции, ТекстОшибки, СтруктураИстории, Истина);
		
		ПараметрыСообщения = пбп_ИнтеграцииШина.ИнициализироватьПараметрыСообщения(
			Справочники.пбп_ИнтеграционныеПотоки, ОбъектXDTO,
			Идентификатор, СостояниеСообщения, Ложь, Ложь);
		
		пбп_ИнтеграцииШина.ЗагрузитьИзПлатформы(ПараметрыОбмена, ПараметрыСообщения);
		Задержка = ПараметрыОбмена.Задержка;
		ТекстОшибки = ПараметрыОбмена.ТекстОшибки;
	Исключение
		ТекстОшибки = пбп_ИнтеграцииСервер.ПолучитьПодробноеПредставлениеОшибкиИсключения(
			НСтр("ru = 'Не удалось обработать полученное сообщение'"),
			ИнформацияОбОшибке());
	КонецПопытки;
	
	пбп_ИнтеграцииШина.ЗаписатьРезультатВИсториюИнтеграции(СтруктураИстории, ТекстОшибки);
	
КонецПроцедуры

Процедура Справочник_пбп_НастройкиИнтеграции(СообщениеОбмена, Источник, Идентификатор,
	СостояниеСообщения, Задержка, КоличествоПопытокОжидания, Функции, ТекстОшибки) Экспорт
	
	Поток = "ПолучениеНастройкиИнтеграции";
	
	СтруктураИстории = пбп_ИнтеграцииШина.ИнициализироватьСтруктуруЗаписиИсторииИнтеграции(
		Поток, СообщениеОбмена, Истина, Истина, Истина);
	
	ИнтегрируемаяСистема = пбп_ИнтеграцииСервер.ИнтегрируемаяСистема(Источник);
	
	Если ЗначениеЗаполнено(ИнтегрируемаяСистема) Тогда
		СтруктураИстории.ИнтегрируемаяСистема = ИнтегрируемаяСистема;
	КонецЕсли;
	
	Попытка
		ОбъектXDTO = пбп_ИнтеграцииСлужебный.ПолучитьОбъектXDTOИзСообщенияОбменаJSON(СообщениеОбмена);
		
		МенеджерОбъекта = Справочники.пбп_НастройкиИнтеграции;
		
		ПараметрыОбмена = пбп_ИнтеграцииШина.ИнициализироватьПараметрыОбмена(
			Поток, Источник, Задержка, КоличествоПопытокОжидания,
			Функции, ТекстОшибки, СтруктураИстории, Истина);
		
		ПараметрыСообщения = пбп_ИнтеграцииШина.ИнициализироватьПараметрыСообщения(
			МенеджерОбъекта, ОбъектXDTO,
			Идентификатор, СостояниеСообщения, Ложь, Ложь);
		
		пбп_ИнтеграцииШина.ЗагрузитьИзПлатформы(ПараметрыОбмена, ПараметрыСообщения);
		Задержка = ПараметрыОбмена.Задержка;
		ТекстОшибки = ПараметрыОбмена.ТекстОшибки;
	Исключение
		ТекстОшибки = пбп_ИнтеграцииСервер.ПолучитьПодробноеПредставлениеОшибкиИсключения(
			НСтр("ru = 'Не удалось обработать полученное сообщение'"),
			ИнформацияОбОшибке());
	КонецПопытки;
	
	пбп_ИнтеграцииШина.ЗаписатьРезультатВИсториюИнтеграции(СтруктураИстории, ТекстОшибки);
	
КонецПроцедуры

Процедура Документ_ДемоРаботаСФормами(СообщениеОбмена, Источник, Идентификатор,
	СостояниеСообщения, Задержка, КоличествоПопытокОжидания, Функции, ТекстОшибки) Экспорт
	
	Поток = "ПолучениеДемоДокумента";
	
	СтруктураИстории = пбп_ИнтеграцииШина.ИнициализироватьСтруктуруЗаписиИсторииИнтеграции(
		Поток, СообщениеОбмена);
	
	Попытка
		ОбъектXDTO = пбп_ИнтеграцииСлужебный.ПолучитьОбъектXDTOИзСообщенияОбменаJSON(СообщениеОбмена);
		
		ПараметрыОбмена = пбп_ИнтеграцииШина.ИнициализироватьПараметрыОбмена(
			Поток, Источник, Задержка, КоличествоПопытокОжидания,
			Функции, ТекстОшибки, СтруктураИстории, Истина);
		
		ПараметрыСообщения = пбп_ИнтеграцииШина.ИнициализироватьПараметрыСообщения(
			Документы.ДемоРаботаСФормами, ОбъектXDTO,
			Идентификатор, СостояниеСообщения, Ложь, Ложь);
		
		пбп_ИнтеграцииШина.ЗагрузитьИзПлатформы(ПараметрыОбмена, ПараметрыСообщения);
		Задержка = ПараметрыОбмена.Задержка;
		ТекстОшибки = ПараметрыОбмена.ТекстОшибки;
	Исключение
		ТекстОшибки = пбп_ИнтеграцииСервер.ПолучитьПодробноеПредставлениеОшибкиИсключения(
			НСтр("ru = 'Не удалось обработать полученное сообщение'"),
			ИнформацияОбОшибке());
	КонецПопытки;
	
	пбп_ИнтеграцииШина.ЗаписатьРезультатВИсториюИнтеграции(СтруктураИстории, ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти // Справочники

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

#Область ИнтеграционныеПотоки

Функция Справочник_пбп_ИнтеграционныеПотоки_ПоляНеОбрабатываемыеУниверсальнойЗагрузкой() Экспорт
	
	Поля = Новый Массив;
	Поля.Добавить("Код");
	
	Возврат Поля;
	
КонецФункции

Функция Справочник_пбп_ИнтеграционныеПотоки_СоответствиеПолейИсточникаИПриемника() Экспорт
	
	Поля = пбп_ИнтеграцииШина.КонструкторСоответствияПолейИсточникаИПриемника();
	
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "ref"			,	"Ссылка", , Истина);
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "name"			,	"Наименование");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "isGroup"		,	"ЭтоГруппа");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "parent"			,	"Родитель.ИдентификаторНастройки");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "identifier"		,	"ИдентификаторНастройки");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "changed"		,	"ИзмененВручную");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "schedulerKey"	,	"КлючРегламентногоЗадания");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "daysOfStorageSuccess"	, "КоличествоДнейХранения");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "daysOfStorageError"		, "КоличествоДнейХраненияОшибок");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "threadDirection"		, "НаправлениеПотока");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "integrationSettings"	, "НастройкаИнтеграции", , Истина);
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "userFunction"			, "ПользовательскаяФункция", , Истина);
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(
		Поля, "functionCode", "ПользовательскаяФункция.Код");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(
		Поля, "functionName", "ПользовательскаяФункция.Наименование");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "endpoint"				, "ТочкаВхода");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "storeVersionNumbers"	, "ХранитьНомераВерсий");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "method"					, "Метод");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "port"					, "Порт");
	
	Возврат Поля;
	
КонецФункции

Функция Справочник_пбп_ИнтеграционныеПотоки_ПоляПоиска() Экспорт

	ПоляПоиска = Новый Соответствие;
	ПоляПоиска.Вставить("Ссылка", пбп_ПереадресацияКлиентСервер.ЗначениеВМассиве("ИдентификаторНастройки"));

	ПоляФункции = Новый Массив;
	ПоляФункции.Добавить(пбп_ИнтеграцииШина.ГруппаПолейПоиска("Код, Наименование"));
	ПоляПоиска.Вставить("ПользовательскаяФункция", ПоляФункции);

	Возврат ПоляПоиска;

КонецФункции

Функция Справочник_пбп_ИнтеграционныеПотоки_СоответствиеТиповПолей() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// В данном потоке не нужно, так как составных типов данных нет
	
	Возврат Соответствие;
	
КонецФункции

Процедура Справочник_пбп_ИнтеграционныеПотоки_Постобработка(ОбъектОбработки, ОбъектXDTO, СтруктураИстории) Экспорт
	
	// Не требуется
	
КонецПроцедуры

#КонецОбласти // ИнтеграционныеПотоки

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область ДемоРаботаСФормами

Функция Документ_ДемоРаботаСФормами_СоответствиеПолейИсточникаИПриемника() Экспорт
	
	Поля = пбп_ИнтеграцииШина.КонструкторСоответствияПолейИсточникаИПриемника();
	
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "Ссылка"		, "Ссылка", , Истина);
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "Дата"		,"Наименование");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "Комментарий", "Комментарий");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "ДатаДокументаОснования", "ДокументОснование.Дата");
	пбп_ИнтеграцииШина.ДополнитьСоответствиеПолейИсточникаИПриемника(Поля, "Комментарий", "ДокументОснование.Комментарий");
	
	Возврат Поля;
	
КонецФункции

Функция Документ_ДемоРаботаСФормами_ПоляПоиска() Экспорт

	ПоляПоиска = Новый Соответствие;

	ПоляСсылки = Новый Массив;
	ПоляСсылки.Добавить(пбп_ИнтеграцииШина.ИмяПоляПоискаПоВнешнемуИдентификатору());
	ПоляСсылки.Добавить(пбп_ИнтеграцииШина.ГруппаПолейПоиска("Дата, Комментарий"));
	ПоляПоиска.Вставить("Ссылка", ПоляСсылки);
	
	ПоляСсылки = Новый Массив;
	ПоляСсылки.Добавить(пбп_ИнтеграцииШина.ГруппаПолейПоиска("ДокументОснование.Дата, ДокументОснование.Комментарий"));
	ПоляПоиска.Вставить("ДокументОснование", ПоляСсылки);

	Возврат ПоляПоиска;

КонецФункции

#КонецОбласти // ДемоРаботаСФормами
