// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает записи задержки получения сообщений обмена.
//
// Параметры:
//  ИнтегрируемаяСистема - СправочникСсылка.пбп_ИнтегрируемыеСистемы, Строка - система или идентификатор настройки
//  НомерПопыткиЗагрузки - Число - номер попытки загрузки сообщения обмена
//
// Возвращаемое значение:
//  ТаблицаЗначений - записи регистра задержки получения сообщений обмена
//
Функция ПолучитьЗаписи(ИнтегрируемаяСистема = Неопределено, НомерПопыткиЗагрузки = 0) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	пбп_ЗадержкаПолученияСообщенийОбмена.ИнтегрируемаяСистема КАК ИнтегрируемаяСистема,
	|	пбп_ЗадержкаПолученияСообщенийОбмена.НомерПопыткиЗагрузки КАК НомерПопыткиЗагрузки,
	|	пбп_ЗадержкаПолученияСообщенийОбмена.ВремяЗадержки КАК ВремяЗадержки
	|ИЗ
	|	РегистрСведений.пбп_ЗадержкаПолученияСообщенийОбмена КАК пбп_ЗадержкаПолученияСообщенийОбмена
	|УПОРЯДОЧИТЬ ПО
	|	НомерПопыткиЗагрузки";
	
	Если ЗначениеЗаполнено(ИнтегрируемаяСистема) Тогда
		Если ТипЗнч(ИнтегрируемаяСистема) = Тип("Строка") Тогда
			ИнтегрируемаяСистема = пбп_ИнтеграцииСервер.ИнтегрируемаяСистема(ИнтегрируемаяСистема);
		КонецЕсли;
		Запрос.УстановитьПараметр("ИнтегрируемаяСистема", ИнтегрируемаяСистема);
		УсловияЗапроса = "пбп_ЗадержкаПолученияСообщенийОбмена.ИнтегрируемаяСистема = &ИнтегрируемаяСистема";
		Запрос = пбп_СхемыЗапросов.ДобавитьОтборВЗапрос(Запрос, УсловияЗапроса);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерПопыткиЗагрузки) Тогда
		Запрос.УстановитьПараметр("НомерПопыткиЗагрузки", НомерПопыткиЗагрузки);
		УсловияЗапроса = "пбп_ЗадержкаПолученияСообщенийОбмена.НомерПопыткиЗагрузки = &НомерПопыткиЗагрузки";
		Запрос = пбп_СхемыЗапросов.ДобавитьОтборВЗапрос(Запрос, УсловияЗапроса);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Добавляет запись задержки получения сообщений обмена.
//
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров для записи. Ключи:
//   * ИнтегрируемаяСистема - СправочникСсылка.пбп_ИнтегрируемыеСистемы - интегрируемая система
//   * НомерПопыткиЗагрузки - Число - номер попытки загрузки сообщения обмена
//   * ВремяЗадержки - Число - время задержки в секундах
//
Процедура ДобавитьЗапись(ПараметрыЗаписи) Экспорт
	
	Если ТипЗнч(ПараметрыЗаписи) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru = 'Некорректный тип параметра'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.ИнтегрируемаяСистема) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана интегрируемая система'");
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыЗаписи);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Изменяет запись задержки получения сообщений обмена.
//
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров для записи. Ключи:
//   * ИнтегрируемаяСистема - СправочникСсылка.пбп_ИнтегрируемыеСистемы - интегрируемая система
//   * НомерПопыткиЗагрузки - Число - номер попытки загрузки сообщения обмена
//   * ВремяЗадержки - Число - время задержки в секундах
//
Процедура ИзменитьЗапись(ПараметрыЗаписи) Экспорт
	
	Если ТипЗнч(ПараметрыЗаписи) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru = 'Некорректный тип параметра'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.ИнтегрируемаяСистема) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана интегрируемая система'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.НомерПопыткиЗагрузки) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан номер попытки загрузки'");
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИнтегрируемаяСистема.Установить(ПараметрыЗаписи.ИнтегрируемаяСистема);
	НаборЗаписей.Отбор.НомерПопыткиЗагрузки.Установить(ПараметрыЗаписи.НомерПопыткиЗагрузки);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		
		Запись = НаборЗаписей[0];
		
		Для Каждого КлючИЗначение Из ПараметрыЗаписи Цикл
			
			Запись[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

// Удаляет записи задержки получения сообщений обмена.
//
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров для записи. Ключи:
//   * ИнтегрируемаяСистема - СправочникСсылка.пбп_ИнтегрируемыеСистемы - интегрируемая система
//   * НомерПопыткиЗагрузки - Число - номер попытки загрузки сообщения обмена
//
Процедура УдалитьЗаписи(ПараметрыЗаписи) Экспорт
	
	Если ТипЗнч(ПараметрыЗаписи) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru = 'Некорректный тип параметра'");
	КонецЕсли;
	
	ИменаИзмерений = Новый Соответствие;
	ИменаИзмерений.Вставить("ИнтегрируемаяСистема", Истина);
	ИменаИзмерений.Вставить("НомерПопыткиЗагрузки", Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	ЕстьОтбор = Ложь;
	
	Для Каждого КлючИЗначение Из ПараметрыЗаписи Цикл
		
		Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИменаИзмерений.Получить(КлючИЗначение.Ключ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей.Отбор[КлючИЗначение.Ключ].Установить(КлючИЗначение.Значение);
		ЕстьОтбор = Истина;
		
	КонецЦикла;
	
	Если Не ЕстьОтбор Тогда
		ВызватьИсключение НСтр("ru = 'Не указан ключ удаления записей'");
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
