// BSLLS:NestedFunctionInParameters-off

#Область ПрограммныйИнтерфейс

// Проверяет каждый объект массива на ошибки валидации, и возвращает идентификаторы ошибок валидации.
//
// Параметры:
//  МассивОбъектов			 - Массив	 - массив объектов из JSON
//  Спецификация			 - Строка	 - текст схемы спецификации Open API
//  СтруктураИзСхемыОтвет	 - Структура - структура идентификатор - результат валидации
//  ОтветДанные				 - Массив	 - Ответ на запрос
//  ИмяСхемы				 - Строка	 - имя схемы спецификации Open API
// 
// Возвращаемое значение:
//  Массив - Идентификаторы элементов с ошибками
//
Функция ВалидироватьОбъекты(Знач МассивОбъектов, Знач Спецификация, СтруктураИзСхемыОтвет, ОтветДанные, ИмяСхемы) Экспорт
	
	ИдентификаторыОшибокВалидации = Новый Массив;
	
	Если МассивСодержитПримитивныеТипы(МассивОбъектов) Тогда
		Если ВалидироватьПримитивныеТипы(МассивОбъектов, Спецификация, СтруктураИзСхемыОтвет, ОтветДанные, ИмяСхемы) Тогда
			ИдентификаторыОшибокВалидации.Добавить();
		КонецЕсли;
		Возврат ИдентификаторыОшибокВалидации;
	КонецЕсли;
	
	МассивОбъектов = ПреобразоватьМассивОбъектов(МассивОбъектов);
	
	Для Каждого ОбъектМассива Из МассивОбъектов Цикл
		РезультатВалидации = Валидировать(ОбъектМассива, ИмяСхемы, Спецификация);
		
		Если Не РезультатВалидации.Результат Тогда
			ТекстСообщения = "";
			Для Каждого Ошибка Из РезультатВалидации.Ошибки Цикл
				ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", Символы.ПС) + Ошибка;
			КонецЦикла;
			
			СтатусОбъекта = пбп_Переадресация.СкопироватьРекурсивно(СтруктураИзСхемыОтвет);
			СтатусОбъекта.Идентификатор = ОбъектМассива.Идентификатор;
			СтатусОбъекта.Статус = ТекстСообщения;
			
			ОтветДанные.Добавить(СтатусОбъекта);
			ИдентификаторыОшибокВалидации.Добавить(ОбъектМассива.Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИдентификаторыОшибокВалидации;
	
КонецФункции

// Проверяет массив примитивных типов на ошибки валидации, возвращает Ложь, если ошибок нет.
//
// Параметры:
//  ВходящийМассив			 - Массив	 - Массив содержащий примитивные типы.
//  Спецификация			 - Строка	 - Спецификация openAPI
//  СтруктураИзСхемыОтвет	 - Структура - Структура ответа
//  ОтветДанные				 - Массив	- Ответ на запрос
//  ИмяСхемы				 - Строка	 - имя схемы спецификации Open API
// 
// Возвращаемое значение:
//  Булево - Ложь, если ошибок нет, иначе истина.
//
Функция ВалидироватьПримитивныеТипы(Знач ВходящийМассив, Знач Спецификация, СтруктураИзСхемыОтвет, ОтветДанные, ИмяСхемы) Экспорт
	
	ИдентификаторыОшибокВалидации = Новый Массив;
	
	РезультатВалидации = Валидировать(ВходящийМассив, ИмяСхемы, Спецификация);
	
	ОшибкаВалидации = Ложь;
	Если Не РезультатВалидации.Результат Тогда
		ТекстСообщения = "";
		Для Каждого Ошибка Из РезультатВалидации.Ошибки Цикл
			ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", Символы.ПС) + Ошибка;
		КонецЦикла;
		
		СтатусОбъекта = пбп_Переадресация.СкопироватьРекурсивно(СтруктураИзСхемыОтвет);
		СтатусОбъекта.Статус = ТекстСообщения;
		
		ОтветДанные.Добавить(СтатусОбъекта);
		
		ОшибкаВалидации = Истина;
	КонецЕсли;
	
	Возврат ОшибкаВалидации;
	
КонецФункции

// Возвращает список ошибок модели данных.
//
// Параметры:
//  МодельДанных - Структура, Соответствие, Массив, Строка, Число - Проверяемый объект.
//  ИмяСхемы     - Строка - Имя схемы данных из спецификации.
//  Спецификация - Строка - Спецификация OpenAPI 3.0 в формате JSON.
// 
// Возвращаемое значение:
//  Структура - Структура результата валидации. см. Обработки.пбп_ВалидаторПакетов.КонструкторРезультатВалидации 
//
Функция Валидировать(Знач МодельДанных, Знач ИмяСхемы, Знач Спецификация) Экспорт // BSLLS:Typo-off
	Обработка = Обработки.пбп_ВалидаторПакетов.Создать();
	РезультатВалидации = Обработка.Валидировать(МодельДанных, ИмяСхемы, Спецификация);
	Возврат РезультатВалидации;
КонецФункции

// Конвертирует передаваемое значение в значение типа JSON
//
// Параметры:
//  ВхЗначение - Произвольный - значение, которое необходимо конвертировать
// 
// Возвращаемое значение:
//  Произвольный - конвертирование значение
//
Функция ЗначениеJSON(ВхЗначение) Экспорт
	
	Преобразованное = Неопределено;
	
	ТипЗначения = ТипЗнч(ВхЗначение);
	
	Если СтрНайти(Строка(ТипЗначения), "Перечисление.") > 0 Тогда
		Преобразованное = ПолучитьЗначениеПеречисления(ВхЗначение, ТипЗначения);
	ИначеЕсли ТипЗначения = Тип("Булево") Или ТипЗначения = Тип("Число") Тогда
		Преобразованное = ВхЗначение;
	Иначе
		Преобразованное = XMLСтрока(ВхЗначение);
	КонецЕсли;
	
	Возврат Преобразованное;
	
КонецФункции

// Возвращает имя перечисления по его синониму
//
// Параметры:
//  ВхЗначение	 - ПеречислениеСсылка - ссылка на перечисление, имя которого необходимо вывести
//  ТипЗначения	 - Тип - тип перечисления
// 
// Возвращаемое значение:
//  Строка - имя перечисления
//
Функция ПолучитьЗначениеПеречисления(ВхЗначение, ТипЗначения = Неопределено) Экспорт
	
	ЗначениеПеречисления = "";
	
	Если ТипЗначения = Неопределено Тогда
		ТипЗначения = ТипЗнч(ВхЗначение);
	КонецЕсли;
	
	МетаданныеПоТипу = Метаданные.НайтиПоТипу(ТипЗначения);
	Для Каждого СтрокаЗначения Из МетаданныеПоТипу.ЗначенияПеречисления Цикл
		Если СтрокаЗначения.Синоним = Строка(ВхЗначение) Тогда
			ЗначениеПеречисления = СтрокаЗначения.Имя;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначениеПеречисления;
	
КонецФункции

// Инициализирует структуру объекта из схемы спецификации Open API
//
// Параметры:
//  Схемы		 - Соответствие - см. пбп_ВалидаторПакетовПовтИсп.СхемыДанныхСпецификации
//  ИмяОбъекта	 - Строка - имя объекта спецификации схему которой необходимо инициализировать.
//  Если необходимо получить схему вложенного в другой объект объекта, необходимо указать путь к нему через
//  точку. Например, если необходимо получить схему табличной части товары документа реализация товаров и услуг,
//  то следует передать следующее значение, соответствующее схеме: "РеализацияТоваровУслуг.Товары"
// 
// Возвращаемое значение:
//  Структура - инициализированная по типам структура
//
Функция ИнициализироватьСтруктуруОбъектаИзСхемы(Схемы, ИмяОбъекта) Экспорт
	
	СвойстваОбъекта = ПолучитьСхемуСвойствОбъекта(Схемы, ИмяОбъекта);
	
	СтруктураОбъекта = Новый Структура;
	
	Для Каждого КлючИЗначение Из СвойстваОбъекта Цикл
		ТипИзСхемы = КлючИЗначение.Значение.Получить("type");
		Если ТипИзСхемы = "integer" Тогда
			БазовоеЗначение = 0;
		ИначеЕсли ТипИзСхемы = "boolean" Тогда
			БазовоеЗначение = Ложь;
		ИначеЕсли ТипИзСхемы = "object" Тогда
			БазовоеЗначение = Новый Структура;
		ИначеЕсли ТипИзСхемы = "array" Тогда
			БазовоеЗначение = Новый Массив;
		Иначе
			БазовоеЗначение = "";
		КонецЕсли;
		
		СтруктураОбъекта.Вставить(КлючИЗначение.Ключ, БазовоеЗначение);
	КонецЦикла;
	
	Возврат СтруктураОбъекта;
	
КонецФункции

// Заполняет данные по схеме спецификации Open API из выборки результата запроса
// Данные выборки запроса должны иметь такие же наименовая колонок, как и структура схемы
//
// Параметры:
//  СтрокаДанных	 - СтрокаТаблицыЗначений, ВыборкаРезультатаЗапроса - строка, из которой необходимо заполнить строку структуры
//  СтруктураИзСхемы - Структура - см. ИнициализироватьСтруктуруОбъектаИзСхемы
// 
// Возвращаемое значение:
//  Структура - заполненная структура данными из запроса
//
Функция ЗаполнитьДанныеПоСхемеИзЗапроса(СтрокаДанных, СтруктураИзСхемы) Экспорт
	
	СтруктураДанных = пбп_Переадресация.СкопироватьРекурсивно(СтруктураИзСхемы);
	
	Для Каждого КлючИЗначение Из СтруктураИзСхемы Цикл
		Попытка
			СтароеЗначение = СтрокаДанных[КлючИЗначение.Ключ];
			ИтоговоеЗначение = ЗначениеJSON(СтароеЗначение);
		Исключение
			ИтоговоеЗначение = КлючИЗначение.Значение;
		КонецПопытки;
		
		СтруктураДанных[КлючИЗначение.Ключ] = ИтоговоеЗначение;
	КонецЦикла;
	
	Возврат СтруктураДанных;
	
КонецФункции

// Конвертировует массив объектов, полученный из JSON, в таблицу значений по схеме спецификации Open API
//
// Параметры:
//  Схемы							 - Соответствие - см. пбп_ВалидаторПакетовПовтИсп.СхемыДанныхСпецификации
//  ИмяОбъекта						 - Строка - имя объекта спецификации схему которой необходимо инициализировать
//  МассивОбъектов					 - Массив - массив объектов, полученный из чтения JSON
//  ИдентификаторыОшибокВалидации	 - Массив - идентификаторы объектов, по которым были ошибки валидации
//  Идентификатор					 - Строка - наименование поля идентификатора объекта
//  НеконвертируемыеИдентификаторы	 - Массив - наименования полей, где хранятся идентификаторы, которые не
//  нужно конвертировать в тип УникальныйИдентификатор - они остаются с типом Строка. Например, для записи
//  в регистр пбп_СостоянияПредопределенныхЭлементов в поле ИдентификаторСистемы
//  КонвертироватьИдентификаторы	 - Булево - по умолчанию Ложь, если Истина, тогда идентификаторы конвертируются
//  из типа Строка в тип УникальныйИдентификатор
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица сконвертированных по типам значений
//
Функция КонвертироватьМассивОбъектовВТаблицуЗначенийПоСхеме(Схемы,
	ИмяОбъекта, МассивОбъектов, ИдентификаторыОшибокВалидации = Неопределено,
	Идентификатор = "Идентификатор", НеконвертируемыеИдентификаторы = Неопределено,
	КонвертироватьИдентификаторы = Ложь) Экспорт
	
	Если КонвертироватьИдентификаторы Тогда
		НеконвертируемыеИдентификаторы = Новый Массив;
	Иначе
		Если Не ЗначениеЗаполнено(НеконвертируемыеИдентификаторы) Тогда
			НеконвертируемыеИдентификаторы = Новый Массив;
			НеконвертируемыеИдентификаторы.Добавить(Идентификатор);
		КонецЕсли;
	КонецЕсли;
	
	СвойстваОбъекта = ПолучитьСхемуСвойствОбъекта(Схемы, ИмяОбъекта);
	ТаблицаОбъектов = Новый ТаблицаЗначений;
	ИнициализироватьТаблицуЗначенийИзСхемыСвойствОбъектов(СвойстваОбъекта, НеконвертируемыеИдентификаторы, ТаблицаОбъектов);
	
	ОписанияТипов = ПолучитьОписанияТиповКонвертации();
	
	СтруктураИдентификаторов = ПолучитьСтруктуруИдентификаторов(Идентификатор,
		ИдентификаторыОшибокВалидации, НеконвертируемыеИдентификаторы);
	
	ПоляВерхнегоУровня = ПолучитьИменаПолейВерхнегоУровня(МассивОбъектов);
	
	ПереместитьВложенныеОбъектыВКонец(МассивОбъектов);
	
	ЗаполнитьСтрокиТаблицыЗначенийПоСхеме(ОписанияТипов,
		МассивОбъектов, СтруктураИдентификаторов,
		ТаблицаОбъектов, ПоляВерхнегоУровня);
	
	Возврат ТаблицаОбъектов;
	
КонецФункции

Процедура ИнициализироватьТаблицуЗначенийИзСхемыСвойствОбъектов(СвойстваОбъекта, НеконвертируемыеИдентификаторы, ТаблицаОбъектов, ИмяТаблицы = "") Экспорт
	
	Для Каждого КлючИЗначение Из СвойстваОбъекта Цикл
		ТипИзСхемы = КлючИЗначение.Значение.Получить("type");
		Если ТипИзСхемы = "integer" Тогда
			ТипКолонки = КонвертироватьТипЧисло(КлючИЗначение);
		ИначеЕсли ТипИзСхемы = "boolean" Тогда
			ТипКолонки = Новый ОписаниеТипов("Булево");
		ИначеЕсли ТипИзСхемы = "string" Тогда
			ТипКолонки = КонвертироватьТипСтрока(КлючИЗначение, НеконвертируемыеИдентификаторы);
		ИначеЕсли ТипИзСхемы = "array" Тогда
			СвойстваЭлементов = КлючИЗначение.Значение.Получить("items");
			Если СвойстваЭлементов.Получить("type") <> Неопределено
				И СвойстваЭлементов.Получить("type") = "object" Тогда
				ВложенныеСвойства = СвойстваЭлементов.Получить("properties");
				ИнициализироватьТаблицуЗначенийИзСхемыСвойствОбъектов(ВложенныеСвойства, НеконвертируемыеИдентификаторы, ТаблицаОбъектов, КлючИЗначение.Ключ);
				Продолжить;
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
		
		ИмяКолонки = ?(Не ПустаяСтрока(ИмяТаблицы), ИмяТаблицы + "_" + КлючИЗначение.Ключ, КлючИЗначение.Ключ);
		
		ТаблицаОбъектов.Колонки.Добавить(ИмяКолонки, ТипКолонки);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСхемуСвойствОбъекта(Схемы, ИмяОбъекта)
	
	МассивРазделителей = СтрРазделить(ИмяОбъекта, ".");
	ПерваяИтерация = Истина;
	СхемаОбъекта = Схемы;
	Для Каждого ЭлементМассива Из МассивРазделителей Цикл
		СхемаОбъекта = СхемаОбъекта.Получить(ЭлементМассива);
		
		Если Не ПерваяИтерация Тогда
			СхемаОбъекта = СхемаОбъекта.Получить("items");
		КонецЕсли;
		
		СхемаОбъекта = СхемаОбъекта.Получить("properties");
		
		Если ПерваяИтерация Тогда
			ПерваяИтерация = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СхемаОбъекта;
	
КонецФункции

Функция ПолучитьИменаПолейВерхнегоУровня(МассивОбъектов)
	
	ПоляВерхнегоУровня = Новый Массив;
	
	Для Каждого ОбъектМассива Из МассивОбъектов Цикл
		Для Каждого КлючИЗначение Из ОбъектМассива Цикл
			Если Не ЭтоМассивСтруктур(КлючИЗначение.Значение) Тогда
				ПоляВерхнегоУровня.Добавить(КлючИЗначение.Ключ);
			КонецЕсли;
		КонецЦикла;
		
		Прервать;
	КонецЦикла;
	
	Возврат ПоляВерхнегоУровня;
	
КонецФункции

Процедура ПереместитьВложенныеОбъектыВКонец(МассивОбъектов)
	
	Для Каждого ОбъектМассива Из МассивОбъектов Цикл
		СтруктураМассивовСтруктур = Новый Структура;
		
		Для Каждого КлючИЗначение Из ОбъектМассива Цикл
			Если ЭтоМассивСтруктур(КлючИЗначение.Значение) Тогда
				СтруктураМассивовСтруктур.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
				ОбъектМассива.Удалить(КлючИЗначение.Ключ);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого КлючИЗначение Из СтруктураМассивовСтруктур Цикл
			ОбъектМассива.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокиТаблицыЗначенийПоСхеме(ОписанияТипов,
	МассивОбъектов, СтруктураИдентификаторов, ТаблицаОбъектов, ПоляВерхнегоУровня,
	ТекущаяСтрока = Неопределено, ИмяОбъекта = "", ПрошлаяСтрока = Неопределено)
	
	Для Каждого ОбъектМассива Из МассивОбъектов Цикл
		Если ПустаяСтрока(ИмяОбъекта) И СтруктураИдентификаторов.ОшибкиВалидации <> Неопределено
			И СтруктураИдентификаторов.ОшибкиВалидации.Найти(
			ОбъектМассива[СтруктураИдентификаторов.ПолеИдентификатора]) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Если заполняется вложенная в объект верхнего уровня структура, то заполняем в эту же строку
		Если ТекущаяСтрока = Неопределено Тогда
			НоваяСтрока = ДобавитьНовуюСтрокуВерхнеуровневогоОбъекта(ТаблицаОбъектов,
				ИмяОбъекта, ПрошлаяСтрока, ПоляВерхнегоУровня);
		Иначе
			НоваяСтрока = ТекущаяСтрока;
			ТекущаяСтрока = Неопределено;
		КонецЕсли;
		
		ЭтоПерваяСтрокаВложеннойСтруктуры = Истина;
		Для Каждого КлючИЗначение Из ОбъектМассива Цикл
			ИмяПоля = ?(Не ПустаяСтрока(ИмяОбъекта), ИмяОбъекта + "_" + КлючИЗначение.Ключ, КлючИЗначение.Ключ);
			Если ЭтоМассивСтруктур(КлючИЗначение.Значение) Тогда
				ТекущаяСтрока = НоваяСтрока;
				// Если после массива структур заполняется следующая структура, то нужно предусмотреть
				// перенос на новую строку с заполнением реквизитов верхнеуровневого объекта
				Если ЭтоПерваяСтрокаВложеннойСтруктуры Тогда
					ЗаполнитьСтрокиТаблицыЗначенийПоСхеме(ОписанияТипов,
						КлючИЗначение.Значение, СтруктураИдентификаторов, ТаблицаОбъектов,
						ПоляВерхнегоУровня, ТекущаяСтрока, ИмяПоля);
					
					ЭтоПерваяСтрокаВложеннойСтруктуры = Ложь;
				Иначе
					ЗаполнитьСтрокиТаблицыЗначенийПоСхеме(ОписанияТипов,
						КлючИЗначение.Значение, СтруктураИдентификаторов, ТаблицаОбъектов,
						ПоляВерхнегоУровня, , ИмяПоля, ТекущаяСтрока);
				КонецЕсли;
			Иначе
				ЗаполнитьЗначениемПримитивногоТипа(ТаблицаОбъектов, НоваяСтрока,
					КлючИЗначение, ИмяПоля, СтруктураИдентификаторов.Неконвертируемые, ОписанияТипов);
			КонецЕсли;
		КонецЦикла;
		
		ПрошлаяСтрока = НоваяСтрока;
	КонецЦикла;
	
КонецПроцедуры

Функция ДобавитьНовуюСтрокуВерхнеуровневогоОбъекта(ТаблицаОбъектов, ИмяТекущегоОбъекта, ПрошлаяСтрока, ПоляВерхнегоУровня)
	
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	Если Не ПустаяСтрока(ИмяТекущегоОбъекта) Тогда
		Для Каждого КолонкаТаблицы Из ТаблицаОбъектов.Колонки Цикл
			Если ПоляВерхнегоУровня.Найти(КолонкаТаблицы.Имя) <> Неопределено Тогда
				НоваяСтрока[КолонкаТаблицы.Имя] = ПрошлаяСтрока[КолонкаТаблицы.Имя];
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

Функция ЭтоМассивСтруктур(Значение)
	
	Возврат ТипЗнч(Значение) = Тип("Массив")
		И Значение.Количество()
		И ТипЗнч(Значение[0]) = Тип("Структура");
	
КонецФункции

Процедура ЗаполнитьЗначениемПримитивногоТипа(ТаблицаОбъектов, НоваяСтрока,
	КлючИЗначение, ИмяПоля, Неконвертируемые, ОписанияТипов)
	
	ТипКолонки = ТаблицаОбъектов.Колонки[ИмяПоля].ТипЗначения;
	Если ТипКолонки = ОписанияТипов.UUID И Неконвертируемые.Найти(ИмяПоля) = Неопределено Тогда
		Если Не ПустаяСтрока(КлючИЗначение.Значение) Тогда
			НоваяСтрока[ИмяПоля] = Новый УникальныйИдентификатор(КлючИЗначение.Значение);
		Иначе
			НоваяСтрока[ИмяПоля] = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
		КонецЕсли;
	ИначеЕсли ТипКолонки = ОписанияТипов.ДатаВремя
		Или ТипКолонки = ОписанияТипов.Дата
		Или ТипКолонки = ОписанияТипов.Время Тогда
		ТипКонвертации = Тип("Дата");
		НоваяСтрока[ИмяПоля] = XMLЗначение(Тип("Дата"), КлючИЗначение.Значение);
	Иначе
		НоваяСтрока[ИмяПоля] = КлючИЗначение.Значение;
	КонецЕсли;
	
КонецПроцедуры

Функция ПреобразоватьМассивОбъектов(Знач МассивОбъектов)
	
	ВходящийТип = ТипЗнч(МассивОбъектов);
	
	Если ВходящийТип = Тип("Структура") Тогда
		Возврат пбп_ПереадресацияКлиентСервер.ЗначениеВМассиве(МассивОбъектов);
	КонецЕсли;
	
	Возврат МассивОбъектов;
	
КонецФункции

Функция МассивСодержитПримитивныеТипы(ИсходныйМассив)
	
	Если ТипЗнч(ИсходныйМассив) = Тип("Массив") И ЗначениеЗаполнено(ИсходныйМассив)
		И пбп_ОбщегоНазначенияСервер.ЭтоПримитивныйТип(ТипЗнч(ИсходныйМассив[0])) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьОписанияТиповКонвертации()
	
	ОписанияТипов = Новый Структура;
	ОписанияТипов.Вставить("UUID"		, Новый ОписаниеТипов("УникальныйИдентификатор"));
	ОписанияТипов.Вставить("ДатаВремя"	, Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ОписанияТипов.Вставить("Дата"		, Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ОписанияТипов.Вставить("Время"		, Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Время)));
	
	Возврат ОписанияТипов;
	
КонецФункции

Функция ПолучитьСтруктуруИдентификаторов(Идентификатор, ИдентификаторыОшибокВалидации, НеконвертируемыеИдентификаторы)
	
	СтруктураИдентификаторов = Новый Структура;
	СтруктураИдентификаторов.Вставить("ПолеИдентификатора"	, Идентификатор);
	СтруктураИдентификаторов.Вставить("ОшибкиВалидации"		, ИдентификаторыОшибокВалидации);
	СтруктураИдентификаторов.Вставить("Неконвертируемые"	, НеконвертируемыеИдентификаторы);
	
	Возврат СтруктураИдентификаторов;
	
КонецФункции

Функция КонвертироватьТипЧисло(КлючИЗначение)
	
	Если КлючИЗначение.Значение.Получить("maximum") <> Неопределено Тогда
		КоличествоСимволов = СтрДлина(Формат(КлючИЗначение.Значение.Получить("maximum"), "ЧГ="));
		ТипКолонки = пбп_Переадресация.ОписаниеТипаЧисло(КоличествоСимволов);
	Иначе
		ТипКолонки = пбп_Переадресация.ОписаниеТипаЧисло(10);
	КонецЕсли;
	
КонецФункции

Функция КонвертироватьТипСтрока(КлючИЗначение, НеконвертируемыеИдентификаторы)
	
	Если КлючИЗначение.Значение.Получить("format") <> Неопределено Тогда
		ФорматСтроки = КлючИЗначение.Значение.Получить("format");
		// Идентификатор остается строкой
		Если ФорматСтроки = "uuid" И (НеконвертируемыеИдентификаторы = Неопределено
			Или НеконвертируемыеИдентификаторы.Найти(КлючИЗначение.Ключ) = Неопределено) Тогда
			ТипКолонки = Новый ОписаниеТипов("УникальныйИдентификатор");
		ИначеЕсли ФорматСтроки = "date-time" Тогда
			ТипКолонки = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
		ИначеЕсли ФорматСтроки = "date" Тогда
			ТипКолонки = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
		ИначеЕсли ФорматСтроки = "time" Тогда
			ТипКолонки = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Время));
		Иначе
			ТипКолонки = пбп_Переадресация.ОписаниеТипаСтрока(100);
		КонецЕсли;
	Иначе
		Если КлючИЗначение.Значение.Получить("maxLength") <> Неопределено Тогда
			ТипКолонки = пбп_Переадресация.ОписаниеТипаСтрока(КлючИЗначение.Значение.Получить("maxLength"));
		Иначе
			ТипКолонки = пбп_Переадресация.ОписаниеТипаСтрока(250);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции