#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Процедура очищает записи в справочнике старше чем установленное в предопределенном значении количество дней
Процедура ОчиститьИсториюИнтеграции() Экспорт
	
	// ++ Обход ошибки отстутствия модуля БСП, не переносить
	ЖурналРегистрации = Неопределено;
	// -- Обход ошибки отстутствия модуля БСП, не переносить
	
	КолДнейХраненияИсторииИнтеграции = __ОбщегоНазначенияСервер.ПолучитьПредопределенноеЗначение("КолДнейХраненияИсторииИнтеграции");
	
	Если НЕ ЗначениеЗаполнено(КолДнейХраненияИсторииИнтеграции) Тогда
		Возврат;
	КонецЕсли;
	
	//Длительность хранения ошибок интеграции на месяц дольше, чем успешных записей
	ДатаАктуальности = НачалоДня(ТекущаяДатаСеанса()) - 86400 * КолДнейХраненияИсторииИнтеграции;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	__ИсторияИнтеграции.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.__ИсторияИнтеграции КАК __ИсторияИнтеграции
		|ГДЕ
		|	(__ИсторияИнтеграции.Ошибка
		|				И __ИсторияИнтеграции.ДатаИнтеграции < &ДатаАктуальности
		|			ИЛИ НЕ __ИсторияИнтеграции.Ошибка
		|				И __ИсторияИнтеграции.ДатаИнтеграции < ДОБАВИТЬКДАТЕ(&ДатаАктуальности, МЕСЯЦ, -1))";
	
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Попытка
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЗаписьИсторииОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ЗаписьИсторииОбъект.Удалить();
			
		КонецЦикла;
		
	Исключение
		
		ИмяСобытия = НСтр("ru = 'Очистка истории интеграции'");
		ЗаголовокОшибки = СтрШаблон("Не удалось удалить запись истории интеграции %1", ВыборкаДетальныеЗаписи.Ссылка);
		
		ТекстОшибки = __ОбщегоНазначенияСервер.ПолучениеПолногоТекстаОшибкиПриИсключении(ЗаголовокОшибки, 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), ПолучитьСообщенияПользователю(Истина));
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, ВыборкаДетальныеЗаписи.Ссылка, ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли