#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ДобавитьТестовыйНабор("пбп_ОбщегоНазначенияВызовСервера")
		.ДобавитьТест("ВыполнитьСервернуюФункцию_БезПараметров_СовпадаетСПрямымВызовом")
		.ДобавитьТест("ВыполнитьСервернуюФункцию_ПараметрНеопределено_ВозвращаетДату")
		.ДобавитьТест("ВыполнитьСервернуюФункцию_НетМодуля_ВыбрасываетИсключение");
	
КонецПроцедуры

#КонецОбласти

#Область Тесты

Процедура ВыполнитьСервернуюФункцию_БезПараметров_СовпадаетСПрямымВызовом() Экспорт
	
	ИмяФункции = "пбп_ОбщегоНазначенияВызовСервера.СуществуетБиблиотекаСтандартныхПодсистем";
	
	Результат = пбп_ОбщегоНазначенияВызовСервера.ВыполнитьСервернуюФункцию(ИмяФункции);
	ОжидаемыйРезультат = пбп_ОбщегоНазначенияВызовСервера.СуществуетБиблиотекаСтандартныхПодсистем();
	
	ЮТест.ОжидаетЧто(Результат).Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура ВыполнитьСервернуюФункцию_ПараметрНеопределено_ВозвращаетДату() Экспорт
	
	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить(Неопределено);
	
	Результат = пбп_ОбщегоНазначенияВызовСервера.ВыполнитьСервернуюФункцию(
		"пбп_ОбщегоНазначенияВызовСервера.ТекущаяДатаПользователя",
		ПараметрыФункции);
	
	ЮТест.ОжидаетЧто(ТипЗнч(Результат)).Равно(Тип("Дата"));
	
КонецПроцедуры

Процедура ВыполнитьСервернуюФункцию_НетМодуля_ВыбрасываетИсключение() Экспорт
	
	ПараметрыВызова = Мокито.МассивПараметров("НетТакогоМодуля.Метод");
	
	ЮТест.ОжидаетЧто(пбп_ОбщегоНазначенияВызовСервера)
		.Метод("ВыполнитьСервернуюФункцию", ПараметрыВызова)
		.ВыбрасываетИсключение("НетТакогоМодуля");
	
КонецПроцедуры

#КонецОбласти
