
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокТипов = Справочники.пбп_ТипыИнтеграций.СформироватьСписокТипов();
	
	ПрочитатьТипыПараметров();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДополнительныеПараметрыНастроекИнтеграцийТипВФормеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗаголовокЭлемента = НСтр("ru = 'Выбрать тип'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ТипВФормеЗавершениеВыбора", ЭтотОбъект);
	СписокТипов.ПоказатьВыборЭлемента(ОписаниеОповещения, ЗаголовокЭлемента);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипВФормеЗавершениеВыбора(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		ТекущийПараметр = Элементы.ДополнительныеПараметрыНастроекИнтеграций.ТекущиеДанные;
		ТекущийТип = ВыбранныйЭлемент;
		
		ИнициализацияТипаИЗначенияПараметра(ТекущийПараметр, ТекущийТип);
		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализацияТипаИЗначенияПараметра(ТекущийПараметр, ТекущийТип)
	
	// Тип в табличной части.
	ТипСтрока = ТипСтрока(ТекущийТип.Значение);
	ТекущийПараметр.Тип = ТипСтрока;
	
	// Тип в форме.
	Массив = Новый Массив;
	Массив.Добавить(Тип(ТекущийПараметр.Тип));
	Описание = Новый ОписаниеТипов(Массив);
	
	ТекущийПараметр.ТипВФорме = ТекущийТип.Представление;
	
КонецПроцедуры

// Возвращает строковое представление типа.
// Например, для ссылки справочника возвращает "CatalogRef.ИмяСправочника".
//
&НаСервере
Функция ТипСтрока(Значение)
	
	СписокДобавленныхТипов = Новый СписокЗначений;
	Справочники.пбп_ТипыИнтеграций.СформироватьСписокТипов(СписокДобавленныхТипов);
	
	ТипСтрока = Строка(Тип(Значение));
	Если Значение = "СписокЗначений" Тогда
		Возврат "СписокЗначений";
	КонецЕсли;
		
	ТипНайден = Ложь;
	Для Каждого ЭлементСписка Из СписокДобавленныхТипов Цикл
		Если ЭлементСписка.Представление = ТипСтрока Тогда
			ТипНайден = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ТипНайден Тогда
		ТипСтрока	= XMLТип(Тип(Значение)).ИмяТипа;
	КонецЕсли;
	
	Возврат ТипСтрока;
	
КонецФункции

Функция ЗначениеВСтрокуСервер(Значение)
	
	Результат = ЗначениеВСтрокуВнутр(Значение);
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПрочитатьТипыПараметров()
	
	Для Каждого ТекПараметр Из Объект.ДополнительныеПараметрыНастроекИнтеграций Цикл
		ТекПараметр.ТипВФорме = Строка(Тип(ТекПараметр.Тип));
	КонецЦикла;
	
КонецПроцедуры
