// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область СлужебныйПрограммныйИнтерфейс

// См. пбп_ОбщегоНазначенияСервер.СуществуетБиблиотекаСтандартныхПодсистем.
Функция СуществуетБиблиотекаСтандартныхПодсистем() Экспорт
	
	Возврат пбп_ОбщегоНазначенияПовтИсп.СуществуетБиблиотекаСтандартныхПодсистем();
	
КонецФункции

// См. пбп_ОбщегоНазначенияСервер.ТекущаяДатаПользователя
Функция ТекущаяДатаПользователя(ИмяПользователя = Неопределено) Экспорт
	
	Возврат пбп_Переадресация.ТекущаяДатаПользователя(ИмяПользователя);
	
КонецФункции

// Вызывает экспортную функцию конфигурации на сервере.
// См. пбп_Переадресация.ВызватьФункциюКонфигурации.
//
// Параметры:
//  ТекстФункции - Строка - имя экспортной функции в формате
//      <имя объекта>.<имя функции>, где <имя объекта> - общий модуль или модуль менеджера.
//  МассивПараметров - Массив - параметры передаются в функцию в порядке расположения элементов массива.
//
// Возвращаемое значение:
//  Произвольный - результат вызванной функции.
//
Функция ВыполнитьСервернуюФункцию(ТекстФункции, МассивПараметров = Неопределено) Экспорт
	
	Возврат пбп_Переадресация.ВызватьФункциюКонфигурации(ТекстФункции, МассивПараметров);
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс