// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

///////////////////////////////////////////////////////////////////////////////
//

#Область ПрограммныйИнтерфейс

// Получить имя пространства
// 
// Возвращаемое значение:
//  Строка - имя пространства XDTO-пакета пбп_НастройкиФорм
//
Функция ПолучитьИмяПространства() Экспорт
	
	Возврат "http://www.pssl-packages.org/forms-settings";
	
КонецФункции

// Добавить сохранение загрузку настроек на форму
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения	 - форма на которую необходимо вывести кнопки
//
Процедура ДобавитьСохранениеЗагрузкуНастроекНаФорму(Форма) Экспорт
	
	ИмяКоманды = "ЗагрузитьНастройки";
	пбп_РаботаСФормами.СоздатьКоманду(Форма, ИмяКоманды, "Загрузить настройки", "Подключаемый_ЗагрузитьНастройки");
	
	НоваяКнопка = пбп_РаботаСФормами.СоздатьКнопка(Форма, "ФормаЗагрузитьНастройки", "ФормаКоманднаяПанель", , ИмяКоманды, 1);
	НоваяКнопка.Картинка	= БиблиотекаКартинок.ЗагрузитьНастройкиОтчета;
	НоваяКнопка.Отображение	= ОтображениеКнопки.КартинкаИТекст;
	
	ИмяКоманды = "СохранитьНастройки";
	пбп_РаботаСФормами.СоздатьКоманду(Форма, ИмяКоманды, "Сохранить настройки", "Подключаемый_СохранитьНастройки");
	
	НоваяКнопка = пбп_РаботаСФормами.СоздатьКнопка(Форма, "ФормаСохранитьНастройки", "ФормаКоманднаяПанель", , ИмяКоманды, 1);
	НоваяКнопка.Картинка	= БиблиотекаКартинок.СохранитьНастройкиОтчета;
	НоваяКнопка.Отображение	= ОтображениеКнопки.КартинкаИТекст;
	
	ИмяРеквизита = "АдресХранилищаСвойствФормы";
	пбп_РаботаСФормами.СоздатьРеквизит(Форма, ИмяРеквизита, пбп_Переадресация.ОписаниеТипаСтрока(200));
	
	СвойстваРеквизитов = пбп_РаботаСФормами.ПолучитьСвойстваРеквизитовФормыВСтруктуру(Форма);
	Форма[ИмяРеквизита] = ПоместитьВоВременноеХранилище(СвойстваРеквизитов, Новый УникальныйИдентификатор);
	
КонецПроцедуры

// Выполняет чтение XML-файла при загрузке настроек в структуру
//
// Параметры:
//  ИмяФормы					 - Строка	 - имя формы
//  АдресХранилищаСвойствФормы	 - Строка	 - адрес структуры свойств формы во временном хранилище
//  АдресФайлаВХранилище		 - Строка	 - адрес файла во временном хранилище, который выбрал пользователь
// 
// Возвращаемое значение:
//  Структура - Ключ - имя реквизита, Значение - значение реквизита
//
Функция ЗагрузитьНастройкиФормы(ИмяФормы, АдресХранилищаСвойствФормы, АдресФайлаВХранилище) Экспорт
	
	СоответствиеФормы = пбп_ПодключаемыеКомандыПереопределяемый.СоответствиеФормыТипаXDTO();
	ИмяТипаXDTO = СоответствиеФормы.Получить(ИмяФормы);
	Если ИмяТипаXDTO = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// BSLLS:MissingTemporaryFileDeletion-off
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	// BSLLS:MissingTemporaryFileDeletion-on
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВХранилище);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	НовоеЧтениеXML = Новый ЧтениеXML;
	// BSLLS:ExternalAppStarting-off
	НовоеЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
	// BSLLS:ExternalAppStarting-on
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип(ПолучитьИмяПространства(), ИмяТипаXDTO);
	СвойстваФормыXDTO = ФабрикаXDTO.ПрочитатьXML(НовоеЧтениеXML, ТипОбъектаXDTO);
	
	НовоеЧтениеXML.Закрыть();
	
	пбп_Переадресация.УдалитьВременныйФайл(ИмяВременногоФайла);
	
	ОбработчикиКонвертации = ПолучитьОбработчикиКонвертацииСвойствФормы(ИмяФормы, Истина);
	
	СтруктураРеквизитов = ПолучитьИзВременногоХранилища(АдресХранилищаСвойствФормы);
	Попытка
		ЗначенияРеквизитов = ПолучитьЗначенияРеквизитовФормыИзXDTO(
			СтруктураРеквизитов,
			ИмяФормы,
			СвойстваФормыXDTO,
			ОбработчикиКонвертации,
			СвойстваФормыXDTO);
	Исключение
		ТекстСообщения = СтрШаблон("ru = 'Произошла ошибка при чтении файла настроек. Подробно: %1'",
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение НСтр(ТекстСообщения);
	КонецПопытки;

	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Выполняет запись структуры значений реквизитов формы в XML-файл при сохранении настроек
//
// Параметры:
//  ИмяФормы			 - Строка	 - Имя Формы
//  ЗначенияРеквизитов	 - Структура - Ключ - имя реквизита, Значение - значение реквизита
// 
// Возвращаемое значение:
//  Строка - адрес файла во временном хранилище
//
Функция СохранитьНастройкиФормы(ИмяФормы, ЗначенияРеквизитов) Экспорт
	
	СоответствиеФормы = пбп_ПодключаемыеКомандыПереопределяемый.СоответствиеФормыТипаXDTO();
	ИмяТипаXDTO = СоответствиеФормы.Получить(ИмяФормы);
	Если ИмяТипаXDTO = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяПространства = ПолучитьИмяПространства();
	ТипОбъектаXDTO = ФабрикаXDTO.Тип(ИмяПространства, ИмяТипаXDTO);
	ОбъектXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO);
	ТипОбъектаAnyTypeXDTO = ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema", "anyType");
	
	ОбработчикиКонвертации = ПолучитьОбработчикиКонвертацииСвойствФормы(ИмяФормы, Ложь);
	
	Попытка
		ЗаполнитьДанныеXDTOИзЗначенийРеквизитовФормы(ИмяФормы, ИмяПространства,
			ЗначенияРеквизитов, ОбъектXDTO, ТипОбъектаXDTO, ТипОбъектаAnyTypeXDTO, ОбработчикиКонвертации);
	Исключение
		ТекстСообщения = СтрШаблон("ru = 'Произошла ошибка при записи файла настроек. Подробно: %1'",
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение НСтр(ТекстСообщения);
	КонецПопытки;
	
	// BSLLS:MissingTemporaryFileDeletion-off
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	// BSLLS:MissingTemporaryFileDeletion-on
	
	НоваяЗаписьXML = Новый ЗаписьXML;
	// BSLLS:ExternalAppStarting-off
	НоваяЗаписьXML.ОткрытьФайл(ИмяВременногоФайла);
	// BSLLS:ExternalAppStarting-on
	
	ФабрикаXDTO.ЗаписатьXML(НоваяЗаписьXML, ОбъектXDTO);
	
	НоваяЗаписьXML.Закрыть();
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	пбп_Переадресация.УдалитьВременныйФайл(ИмяВременногоФайла);
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область НастройкиФормы

// Получить обработчики конвертации свойств формы.
// См. пбп_ПодключаемыеКомандыПереопределяемый.ПередКонвертацией_пбп_УниверсальнаяЗагрузкаИзФайлаЧерезТабличныйДокументФорма
//
Функция ПолучитьОбработчикиКонвертацииСвойствФормы(ИмяФормы, ЭтоЗагрузка)
	
	ИмяФункции = СтрШаблон("%1.ПередКонвертацией_%2",
		ПолучитьИмяПереопределяемогоМодуля(),
		ПолучитьИмяПроцедурыФормы(ИмяФормы));
	
	ПараметрыМетода = Новый Массив;
	ПараметрыМетода.Добавить(ЭтоЗагрузка);
	
	Попытка
		ОбработчикиКонвертации = пбп_Переадресация.ВызватьФункциюКонфигурации(ИмяФункции, ПараметрыМетода);
	Исключение
		ОбработчикиКонвертации = Новый Массив;
	КонецПопытки;
	
	Возврат ОбработчикиКонвертации;
	
КонецФункции

// Возвращает структуру со значениями реквизитов формы из XML-файла
//
// Параметры:
//  СтруктураРеквизитов		 - Структура	 - описание формы или вложенной в форму "структуры" (объект,
// таблица формы, табличная часть объекта), см. пбп_РаботаСФормами.ПолучитьСвойстваРеквизитовФормыВСтруктуру
//  ИмяФормы				 - Строка		 - имя формы
//  СвойстваФормыXDTO		 - ОбъектXDTO	 - структура загружаемых данных
//  ОбработчикиКонвертации	 - Массив		 - см. ПолучитьОбработчикиКонвертацииСвойствФормы
//  ИсточникДанных			 - Структура	 - в отличие от СтруктураРеквизитов всегда структура всей формы,
// вместе с вложенными "структурами"
//  ИмяРодителя				 - Строка		 - имя владельца реквизита (объект, наименование ТЧ)
// 
// Возвращаемое значение:
//  Структура - Структура значений формы, включая массивы структур с таблицами
//
Функция ПолучитьЗначенияРеквизитовФормыИзXDTO(СтруктураРеквизитов,
	ИмяФормы, СвойстваФормыXDTO, ОбработчикиКонвертации, ИсточникДанных, ИмяРодителя = "")
	
	ЗначенияРеквизитов = пбп_ПодключаемыеКомандыСлужебныйКлиентСервер
		.СкопироватьСтруктуруЗначенийРеквизитовИзСвойствФормы(СтруктураРеквизитов);
	Для Каждого СвойстваРеквизита Из СтруктураРеквизитов Цикл
		ИмяРеквизита = СвойстваРеквизита.Ключ;
		Если СвойстваФормыXDTO.Свойства().Получить(ИмяРеквизита) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТипРеквизита = СвойстваРеквизита.Значение;
		Если ТипЗнч(ТипРеквизита) = Тип("Структура") Тогда
			СвойстваXDTOОбъект = СвойстваФормыXDTO[ИмяРеквизита];
			Если ИмяРеквизита = "Объект" Тогда
				ЗначенияРеквизитов[ИмяРеквизита] = ПолучитьЗначенияРеквизитовФормыИзXDTO(СвойстваРеквизита.Значение,
					ИмяФормы, СвойстваXDTOОбъект, ОбработчикиКонвертации, ИсточникДанных, ИмяРеквизита);
			Иначе // Массив строк
				Если СвойстваXDTOОбъект.Свойства().Получить("Строка") = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяРодителя = ИмяРодителя + ?(ПустаяСтрока(ИмяРодителя), "", ".") + ИмяРеквизита;
				Для Каждого СтрокаТаблицыXDTO Из СвойстваXDTOОбъект.Строка Цикл
					СтрокаИзXDTO = ПолучитьЗначенияРеквизитовФормыИзXDTO(СвойстваРеквизита.Значение,
						ИмяФормы, СтрокаТаблицыXDTO, ОбработчикиКонвертации, ИсточникДанных, ИмяРодителя);
					ЗначенияРеквизитов[ИмяРеквизита].Добавить(СтрокаИзXDTO);
				КонецЦикла;
			КонецЕсли;
		Иначе
			ЗаполнитьСтруктуруИлиОбъектXDTOЗначениями(ИмяФормы, ЗначенияРеквизитов, 
				СвойстваФормыXDTO, ИмяРеквизита, ТипРеквизита, ОбработчикиКонвертации, ИсточникДанных, ИмяРодителя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Заполнить данные XDTOИз значений реквизитов формы.
// Работает аналогично ПолучитьЗначенияРеквизитовФормыИзXDTO, но при выгрузке в файл
//
Процедура ЗаполнитьДанныеXDTOИзЗначенийРеквизитовФормы(ИмяФормы, ИмяПространства,
	ЗначенияРеквизитов, ОбъектXDTO, ТипОбъектаXDTO, ТипОбъектаAnyTypeXDTO, ОбработчикиКонвертации)
	
	Для Каждого СвойствоXDTO Из ТипОбъектаXDTO.Свойства Цикл
		ИмяРеквизита = СвойствоXDTO.Имя;
		Если Не ЗначенияРеквизитов.Свойство(ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяТипаОбъект = "Объект";
		ТипРеквизита = ТипЗнч(ЗначенияРеквизитов[ИмяРеквизита]);
		Если СвойствоXDTO.Тип = ТипОбъектаAnyTypeXDTO
			Или СвойствоXDTO.Тип.БазовыйТип = ТипОбъектаAnyTypeXDTO Тогда // Вложенная структура
			ТипСсылкиXDTO = ФабрикаXDTO.Тип(ИмяПространства, СвойствоXDTO.Тип.Имя);
			КоличествоСвойств = ТипСсылкиXDTO.Свойства.Количество();
			Если КоличествоСвойств = 1 И ИмяРеквизита <> ИмяТипаОбъект Тогда
				ЗаполнитьСтрокиТаблицыXDTO(ИмяПространства, ИмяФормы, ОбъектXDTO, ТипСсылкиXDTO, 
					ЗначенияРеквизитов[ИмяРеквизита], ИмяРеквизита, ОбработчикиКонвертации, ЗначенияРеквизитов);
			ИначеЕсли КоличествоСвойств > 1 И ИмяРеквизита = ИмяТипаОбъект Тогда
				ОбъектXDTO[ИмяРеквизита] = ФабрикаXDTO.Создать(ТипСсылкиXDTO);
				ЗаполнитьДанныеXDTOИзЗначенийРеквизитовФормы(ИмяФормы, 
					ИмяПространства, ЗначенияРеквизитов[ИмяРеквизита], ОбъектXDTO[ИмяРеквизита], 
					ТипСсылкиXDTO, ТипОбъектаAnyTypeXDTO, ОбработчикиКонвертации);
			Иначе
				Ошибка = "ru = 'Нарушена структура XDTO-пакета: свойство " + ИмяРеквизита + " не отвечает требованиям.
				|Вложенными структурами в корневую структуру могут быть добавлены только таблицы формы и объект.'";
				ВызватьИсключение НСтр(Ошибка);
			КонецЕсли;
		Иначе
			ЗаполнитьСтруктуруИлиОбъектXDTOЗначениями(ИмяФормы, ОбъектXDTO, 
				ЗначенияРеквизитов, ИмяРеквизита, ТипРеквизита, ОбработчикиКонвертации, ЗначенияРеквизитов);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет строки списка XDTO из массива структур (табличных частей формы)
//
Процедура ЗаполнитьСтрокиТаблицыXDTO(ИмяПространства, ИмяФормы, ОбъектXDTO,
	ТипТаблицыXDTO, ЗначенияТаблицыФормы, ИмяТаблицыФормы, ОбработчикиКонвертации, ИсточникДанных)
	
	СвойствоТаблицыXDTO = ТипТаблицыXDTO.Свойства[0];
	Если Не СвойствоТаблицыXDTO.Имя = "Строка" Тогда
		Ошибка = "ru = 'Нарушена структура XDTO-пакета: свойство " + СвойствоТаблицыXDTO.Имя + " не отвечает требованиям.
		|Внутри вложенной структуры таблицы должен быть массив структур с именем ""Строка"".";
		ВызватьИсключение НСтр(Ошибка);
	КонецЕсли;
	
	ТипТаблицыXDTO = ФабрикаXDTO.Тип(ИмяПространства, СвойствоТаблицыXDTO.ТипВладелец.Имя);
	ТаблицаXDTO = ФабрикаXDTO.Создать(ТипТаблицыXDTO);
	
	ТипСтрокиТаблицыXDTO = ФабрикаXDTO.Тип(ИмяПространства, СвойствоТаблицыXDTO.Тип.Имя);
	
	Для Каждого СтрокаТаблицы Из ЗначенияТаблицыФормы Цикл
		СтрокаТаблицыXDTO = ФабрикаXDTO.Создать(ТипСтрокиТаблицыXDTO);
		
		Для Каждого СвойствоXDTO Из ТипСтрокиТаблицыXDTO.Свойства Цикл
			ИмяРеквизита = СвойствоXDTO.Имя;
			Если Не СтрокаТаблицы.Свойство(ИмяРеквизита) Тогда
				Продолжить;
			КонецЕсли;
			ТипРеквизита = ТипЗнч(СтрокаТаблицы[ИмяРеквизита]);
			
			ЗаполнитьСтруктуруИлиОбъектXDTOЗначениями(ИмяФормы, СтрокаТаблицыXDTO,
				СтрокаТаблицы, ИмяРеквизита, ТипРеквизита, ОбработчикиКонвертации, ИсточникДанных, ИмяТаблицыФормы);
		КонецЦикла;
		
		ТаблицаXDTO.Строка.Добавить(СтрокаТаблицыXDTO);
	КонецЦикла;
	
	ОбъектXDTO[ИмяТаблицыФормы] = ТаблицаXDTO;
	
КонецПроцедуры

// Заполняет свойства приемника (либо структура значений реквизитов формы при загрузке, либо объект XDTO при выгрузке)
// из свойств источника, учитывая алгоритмы конвертации и преобразования ссылочных типов
//
// Параметры:
//  ИмяФормы				 - Строка					 - имя формы
//  ПриемникСвойства		 - Структура, ОбъектXDTO	 - либо значения реквизитов формы, либо объект XDTO
//  ИсточникСвойства		 - ОбъектXDTO, Структура	 - либо значения реквизитов формы, либо объект XDTO
//  ИмяРеквизита			 - Строка					 - имя реквизита на форме и схеме
//  ТипРеквизита			 - Тип						 - тип реквизита на форме
//  ОбработчикиКонвертации	 - Массив					 - массив имен полей формы, для которых требуется конвертация
//  ИсточникДанных			 - Структура, ОбъектXDTO	 - всегда весь элемент, без учета рекурсии заполнения
//  ИмяРодителя				 - Строка					 - имя владельца реквизита (объект, наименование ТЧ)
//
Процедура ЗаполнитьСтруктуруИлиОбъектXDTOЗначениями(ИмяФормы,
	ПриемникСвойства, ИсточникСвойства, ИмяРеквизита, ТипРеквизита,
	ОбработчикиКонвертации, ИсточникДанных = Неопределено, ИмяРодителя = "")
	
	ЭтоЗагрузка = ТипЗнч(ПриемникСвойства) = Тип("Структура");
	ПолноеИмяПоля = ?(ПустаяСтрока(ИмяРодителя), ИмяРеквизита, ИмяРодителя + "." + ИмяРеквизита);
	Если ОбработчикиКонвертации.Найти(ПолноеИмяПоля) <> Неопределено Тогда
		ВыполнитьАлгоритмКонвертации(ИмяФормы, ПриемникСвойства,
			ИсточникСвойства, ИмяРеквизита, ПолноеИмяПоля, ЭтоЗагрузка, ИсточникДанных);
	Иначе
		Если пбп_Переадресация.ЭтоСсылка(ТипРеквизита) Тогда
			Если ЭтоЗагрузка Тогда
				МетаданныеОбъект = Метаданные.НайтиПоТипу(ТипРеквизита);
				Если Метаданные.Перечисления.Найти(МетаданныеОбъект.Имя) <> Неопределено Тогда
					ПриемникСвойства[ИмяРеквизита] = Перечисления[МетаданныеОбъект.Имя][ИсточникСвойства[ИмяРеквизита]];
				Иначе
					УИДЗначения = Новый УникальныйИдентификатор(ИсточникСвойства[ИмяРеквизита]);
					Если Метаданные.Справочники.Найти(МетаданныеОбъект.Имя) <> Неопределено Тогда
						ПриемникСвойства[ИмяРеквизита] = Справочники[МетаданныеОбъект.Имя].ПолучитьСсылку(УИДЗначения);
					ИначеЕсли Метаданные.Документы.Найти(МетаданныеОбъект.Имя) <> Неопределено Тогда
						ПриемникСвойства[ИмяРеквизита] = Документы[МетаданныеОбъект.Имя].ПолучитьСсылку(УИДЗначения);
					ИначеЕсли Метаданные.ПланыВидовХарактеристик.Найти(МетаданныеОбъект.Имя) <> Неопределено Тогда
						ПриемникСвойства[ИмяРеквизита] = ПланыВидовХарактеристик[МетаданныеОбъект.Имя].ПолучитьСсылку(УИДЗначения);
					ИначеЕсли Метаданные.ПланыСчетов.Найти(МетаданныеОбъект.Имя) <> Неопределено Тогда
						ПриемникСвойства[ИмяРеквизита] = ПланыСчетов[МетаданныеОбъект.Имя].ПолучитьСсылку(УИДЗначения);
					КонецЕсли;
				КонецЕсли;
			Иначе
				ПриемникСвойства[ИмяРеквизита] = Строка(ИсточникСвойства[ИмяРеквизита].УникальныйИдентификатор());
			КонецЕсли;
		Иначе
			ПриемникСвойства[ИмяРеквизита] = ИсточникСвойства[ИмяРеквизита];
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Выполнить алгоритм конвертации
// См. пбп_ПодключаемыеКомандыПереопределяемый.ПриВыгрузке_пбп_УниверсальнаяЗагрузкаИзФайлаЧерезТабличныйДокументФорма_КодПостобработки
//
Процедура ВыполнитьАлгоритмКонвертации(ИмяФормы, ПриемникСвойства,
	ИсточникСвойства, ИмяРеквизита, ПолноеИмяПоля, ЭтоЗагрузка, ИсточникДанных)
	
	Если ЭтоЗагрузка Тогда
		Направление = "ПриЗагрузке";
	Иначе
		Направление = "ПриВыгрузке";
	КонецЕсли;
	
	ИмяПроцедуры = СтрШаблон("%1.%2_%3_%4",
		ПолучитьИмяПереопределяемогоМодуля(),
		Направление,
		ПолучитьИмяПроцедурыФормы(ИмяФормы),
		СтрЗаменить(ПолноеИмяПоля, ".", "_"));
	
	ПараметрыМетода = Новый Массив;
	
	Если ЭтоЗагрузка Тогда
		ПараметрыМетода.Добавить(ПриемникСвойства);
		ПараметрыМетода.Добавить(ИсточникСвойства);
	Иначе
		ПараметрыМетода.Добавить(ИсточникСвойства);
		ПараметрыМетода.Добавить(ПриемникСвойства);
	КонецЕсли;
	
	ПараметрыМетода.Добавить(ИмяРеквизита);
	ПараметрыМетода.Добавить(ИсточникДанных);
	
	Попытка
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяПроцедуры, ПараметрыМетода);
	Исключение
		ТекстСообщения = СтрШаблон("ru = 'Произошла ошибка при выполнении метода конвертации поля %1. Подробно: %2'",
			ИмяРеквизита, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение НСтр(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьИмяПроцедурыФормы(ИмяФормы)
	
	ЧастиИмениФормы = пбп_ПереадресацияКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяФормы, ".");
	
	КолЭлементов = ЧастиИмениФормы.Количество();
	Если КолЭлементов = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Удалим класс
	ЧастиИмениФормы.Удалить(0);
	Если КолЭлементов > 2 Тогда
		// Удалим слово "Форма"
		ЧастиИмениФормы.Удалить(1);
	КонецЕсли;
	
	ИмяПроцедуры = СтрСоединить(ЧастиИмениФормы, "");
	
	Возврат ИмяПроцедуры;
	
КонецФункции

Функция ПолучитьИмяПереопределяемогоМодуля()
	Возврат "пбп_ПодключаемыеКомандыПереопределяемый";
КонецФункции

#КонецОбласти // НастройкиФормы

#КонецОбласти // СлужебныеПроцедурыИФункции