// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавить запись.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров Для записи. Ключи:
//   * Период - СправочникСсылка.пбп_ИнтегрируемыеСистемы - интегрируемая система
//   * ИнтеграционныйПоток - СправочникСсылка.пбп_ИнтеграционныеПотоки - интеграционный поток
//   * ИмяФайла - Строка - имя файла
//   * Обработан - Булево - статус обработки файла
//
Процедура ДобавитьЗапись(ПараметрыЗаписи) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.ИнтеграционныйПоток) Тогда
		ВызватьИсключение НСтр("ru='Не указан интеграционный поток'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.ИмяФайла) Тогда
		ВызватьИсключение НСтр("ru='Не указано имя файла'");
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыЗаписи);
		
		МенеджерЗаписи.Записать();
	Исключение
		ТекстСообщения = НСтр("ru='Ошибка добавления записи истории загрузки файлов'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, 
			, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Изменить запись.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров Для записи. Ключи:
//   * ИнтеграционныйПоток - СправочникСсылка.пбп_ИнтеграционныеПотоки - интеграционный поток
//   * ИмяФайла - Строка - имя файла
Процедура ИзменитьЗапись(ПараметрыЗаписи) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	
	Если ЗначениеЗаполнено(ПараметрыЗаписи.ИнтеграционныйПоток) Тогда
		НаборЗаписей.Отбор.ИнтеграционныйПоток.Установить(ПараметрыЗаписи.ИнтеграционныйПоток);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ИмяФайла")
		И ЗначениеЗаполнено(ПараметрыЗаписи.ИмяФайла) Тогда
		НаборЗаписей.Отбор.ИмяФайла.Установить(ПараметрыЗаписи.ИмяФайла);
	КонецЕсли;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		Запись = НаборЗаписей[0];
		Для Каждого КлючИЗначение Из ПараметрыЗаписи Цикл
			Запись[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЦикла;
		
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Удалить запись.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров Для записи. Ключи:
//   * ИнтеграционныйПоток - СправочникСсылка.пбп_ИнтеграционныеПотоки - интеграционный поток
//   * ИмяФайла - Строка - имя файла
Процедура УдалитьЗаписи(ПараметрыЗаписи) Экспорт
	
	Если ТипЗнч(ПараметрыЗаписи) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru='Некорректный тип параметра'");
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		НаборЗаписей = СоздатьНаборЗаписей();
		Для Каждого КлючИЗначение Из ПараметрыЗаписи Цикл
			Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей.Отбор[КлючИЗначение.Ключ].Установить(КлючИЗначение.Значение);
		КонецЦикла;
		
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
		
		ТекстСообщения = НСтр("ru='Удаление записей истории загрузки файлов'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, 
			УровеньЖурналаРегистрации.Информация, , , 
			"Параметры: " + СтрСоединить(ПараметрыЗаписи));
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли