
#Область ПрограммныйИнтерфейс

// Процедура - При открытии
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - модифицируемая форма
//  Отказ	 - Булево - если Истина, то объект не будет создан
//
Процедура ПриОткрытии(Форма, Отказ) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "ТипМетаданных.ИмяОбработки.Форма.ИмяФормы" Тогда
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - После записи
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - модифицируемая форма
//  ПараметрыЗаписи	 - Структура - параметры записи
//
Процедура ПослеЗаписи(Форма, ПараметрыЗаписи) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "ТипМетаданных.ИмяОбработки.Форма.ИмяФормы" Тогда
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс