
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТипТочкиОбменаСтрокой(ТипТочкиОбмена) Экспорт
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.пбп_ТипыТочкиОбменаRabbitMQ.direct, "direct");
	Соответствие.Вставить(Перечисления.пбп_ТипыТочкиОбменаRabbitMQ.fanout, "fanout");
	Соответствие.Вставить(Перечисления.пбп_ТипыТочкиОбменаRabbitMQ.topic, "topic");
	
	ТипСтрокой = Соответствие[ТипТочкиОбмена];
	
	Если ТипСтрокой = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ТипСтрокой;
	
КонецФункции

#КонецОбласти