
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокЗначенийПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОткрытие(Элемент, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.Значение) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ВводСтрокиЗавершение", 
		ЭтотОбъект, Новый Структура("РеквизитШапки, Реквизит", Истина, "Значение")), 
		Объект.Значение, НСтр("ru='Значение'; en = 'Value'"),, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ВводСтрокиЗавершение",
		ЭтотОбъект, Новый Структура("РеквизитШапки, Реквизит", Истина, "Комментарий")), 
		Объект.Комментарий, НСтр("ru='Комментарий'; en = 'Comment'"),, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ЗначенияЭлементовЗначениеОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗначенияЭлементов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТипЗнч(ТекущиеДанные.Значение) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ВводСтрокиЗавершение", 
		ЭтотОбъект, Новый Структура("РеквизитШапки, Реквизит", Ложь, ТекущиеДанные)), 
		ТекущиеДанные.Значение, НСтр("ru='Значение'; en = 'Value'"),, Истина);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.Значение.Видимость = Не Объект.СписокЗначений;
	Элементы.ЗначенияЭлементов.Видимость = Объект.СписокЗначений;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводСтрокиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "РеквизитШапки", Ложь) Тогда
			Объект[ДополнительныеПараметры.Реквизит] = Результат;
		Иначе
			ДополнительныеПараметры.Реквизит.Значение = Результат;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры;

#КонецОбласти 