// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

#Область Справочники

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураПриУстановкеНовогоКода");
//
Функция СправочникиПриУстановкеНовогоКода() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураПриКопировании");
//
Функция СправочникиПриКопировании() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураОбработкаЗаполнения");
//
Функция СправочникиОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураПередЗаписью");
//
Функция СправочникиПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураПриЗаписи");
//
Функция СправочникиПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураПередУдалением");
//
Функция СправочникиПередУдалением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураОбработкаПроверкиЗаполнения");
//
Функция СправочникиОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураОбработкаФормированияПоВерсииИсторииДанных");
//
Функция СправочникиОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Справочники

#Область Документы

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетПриУстановкеНовогоНомера");
//
Функция ДокументыПриУстановкеНовогоНомера() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетПриКопировании");
//
Функция ДокументыПриКопировании() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетОбработкаЗаполнения");
//
Функция ДокументыОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетПередЗаписью");
//
Функция ДокументыПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	Соответствие.Вставить(Тип("ДокументОбъект.ДемоРаботаСФормами"), "ДемоРаботаСФормамиПередЗаписью");
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетПриЗаписи");
//
Функция ДокументыПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетПередУдалением");
//
Функция ДокументыПередУдалением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетОбработкаПроведения");
//
Функция ДокументыОбработкаПроведения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетОбработкаУдаленияПроведения");
//
Функция ДокументыОбработкаУдаленияПроведения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетОбработкаПроверкиЗаполнения");
//
Функция ДокументыОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетОбработкаФормированияПоВерсииИсторииДанных");
//
Функция ДокументыОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Документы

#Область ПланыВидовХарактеристик

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияПриУстановкеНовогоКода");
//
Функция ПланыВидовХарактеристикПриУстановкеНовогоКода() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияПриКопировании");
//
Функция ПланыВидовХарактеристикПриКопировании() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияОбработкаЗаполнения");
//
Функция ПланыВидовХарактеристикОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияПередЗаписью");
//
Функция ПланыВидовХарактеристикПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияПриЗаписи");
//
Функция ПланыВидовХарактеристикПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияПередУдалением");
//
Функция ПланыВидовХарактеристикПередУдалением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияОбработкаПроверкиЗаполнения");
//
Функция ПланыВидовХарактеристикОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияОбработкаФормированияПоВерсииИсторииДанных");
//
Функция ПланыВидовХарактеристикОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // ПланыВидовХарактеристик

#Область ПланыСчетов

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовОбъект.Хозрасчетный"), "ХозрасчетныйПриКопировании");
//
Функция ПланыСчетовПриКопировании() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовОбъект.Хозрасчетный"), "ХозрасчетныйОбработкаЗаполнения");
//
Функция ПланыСчетовОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовОбъект.Хозрасчетный"), "ХозрасчетныйПередЗаписью");
//
Функция ПланыСчетовПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовОбъект.Хозрасчетный"), "ХозрасчетныйПриЗаписи");
//
Функция ПланыСчетовПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовОбъект.Хозрасчетный"), "ХозрасчетныйПередУдалением");
//
Функция ПланыСчетовПередУдалением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовОбъект.Хозрасчетный"), "ХозрасчетныйОбработкаПроверкиЗаполнения");
//
Функция ПланыСчетовОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовОбъект.Хозрасчетный"), "ХозрасчетныйОбработкаФормированияПоВерсииИсторииДанных");
//
Функция ПланыСчетовОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // ПланыСчетов

#Область ПланыВидовРасчета

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаОбъект.Начисления"), "НачисленияПриКопировании");
//
Функция ПланыВидовРасчетаПриКопировании() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаОбъект.Начисления"), "НачисленияОбработкаЗаполнения");
//
Функция ПланыВидовРасчетаОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаОбъект.Начисления"), "НачисленияПередЗаписью");
//
Функция ПланыВидовРасчетаПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаОбъект.Начисления"), "НачисленияПриЗаписи");
//
Функция ПланыВидовРасчетаПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаОбъект.Начисления"), "НачисленияПередУдалением");
//
Функция ПланыВидовРасчетаПередУдалением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаОбъект.Начисления"), "НачисленияОбработкаПроверкиЗаполнения");
//
Функция ПланыВидовРасчетаОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаОбъект.Начисления"), "НачисленияОбработкаФормированияПоВерсииИсторииДанных");
//
Функция ПланыВидовРасчетаОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // ПланыВидовРасчета

#Область БизнесПроцессы

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеПриУстановкеНовогоНомера");
//
Функция БизнесПроцессыПриУстановкеНовогоНомера() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеПриКопировании");
//
Функция БизнесПроцессыПриКопировании() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеОбработкаЗаполнения");
//
Функция БизнесПроцессыОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеПередЗаписью");
//
Функция БизнесПроцессыПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеПриЗаписи");
//
Функция БизнесПроцессыПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеПередУдалением");
//
Функция БизнесПроцессыПередУдалением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеОбработкаИнтерактивнойАктивации");
//
Функция БизнесПроцессыОбработкаИнтерактивнойАктивации() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеОбработкаПроверкиЗаполнения");
//
Функция БизнесПроцессыОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеОбработкаФормированияПоВерсииИсторииДанных");
//
Функция БизнесПроцессыОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // БизнесПроцессы

#Область Задачи

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяПередЗаписью");
//
Функция ЗадачиПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяПриЗаписи");
//
Функция ЗадачиПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяПередУдалением");
//
Функция ЗадачиПередУдалением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяОбработкаИнтерактивнойАктивации");
//
Функция ЗадачиОбработкаИнтерактивнойАктивации() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяОбработкаПроверкиВыполнения");
//
Функция ЗадачиОбработкаПроверкиВыполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяПередВыполнением");
//
Функция ЗадачиПередВыполнением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяПередИнтерактивнымВыполнением");
//
Функция ЗадачиПередИнтерактивнымВыполнением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяПриВыполнении");
//
Функция ЗадачиПриВыполнении() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяОбработкаПроверкиЗаполнения");
//
Функция ЗадачиОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяОбработкаФормированияПоВерсииИсторииДанных");
//
Функция ЗадачиОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Задачи

#Область ПланыОбмена

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриУстановкеНовогоКода");
//
Функция ПланыОбменаПриУстановкеНовогоКода() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриКопировании");
//
Функция ПланыОбменаПриКопировании() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйОбработкаЗаполнения");
//
Функция ПланыОбменаОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПередЗаписью");
//
Функция ПланыОбменаПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриЗаписи");
//
Функция ПланыОбменаПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПередУдалением");
//
Функция ПланыОбменаПередУдалением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриОтправкеДанныхПодчиненному");
//
Функция ПланыОбменаПриОтправкеДанныхПодчиненному() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриОтправкеДанныхГлавному");
//
Функция ПланыОбменаПриОтправкеДанныхГлавному() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриПолученииДанныхОтПодчиненного");
//
Функция ПланыОбменаПриПолученииДанныхОтПодчиненного() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриПолученииДанныхОтГлавного");
//
Функция ПланыОбменаПриПолученииДанныхОтГлавного() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйОбработкаПроверкиЗаполнения");
//
Функция ПланыОбменаОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриОтправкеДанныхУзлаПодчиненному");
//
Функция ПланыОбменаПриОтправкеДанныхУзлаПодчиненному() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриПолученииДанныхУзлаОтГлавного");
//
Функция ПланыОбменаПриПолученииДанныхУзлаОтГлавного() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриАвтоматическомСозданииНовогоУзла");
//
Функция ПланыОбменаПриАвтоматическомСозданииНовогоУзла() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПередСозданиемНачальногоОбраза");
//
Функция ПланыОбменаПередСозданиемНачальногоОбраза() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПередНачаломОтправкиДанныхПодчиненному");
//
Функция ПланыОбменаПередНачаломОтправкиДанныхПодчиненному() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПередНачаломОтправкиДанныхГлавному");
//
Функция ПланыОбменаПередНачаломОтправкиДанныхГлавному() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйОбработкаФормированияПоВерсииИсторииДанных");
//
Функция ПланыОбменаОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // ПланыОбмена

#Область РегистрыСведений

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрСведенийНаборЗаписей.ШтрихкодыНоменклатуры"), "ШтрихкодыНоменклатурыПередЗаписью");
//
Функция РегистрыСведенийПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	Соответствие.Вставить(Тип("РегистрСведенийНаборЗаписей.пбп_ОжиданиеАсинхронныхВызовов"),
		"ОжиданиеАсинхронныхВызововПередЗаписью");
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыСведений(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // РегистрыСведений

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ОбщийМодульСправочникиОбработкаСобытий()
	Возврат "пбп_СправочникиОбработкаСобытий";
КонецФункции

Функция ОбщийМодульДокументыОбработкаСобытий()
	Возврат "пбп_ДокументыОбработкаСобытий";
КонецФункции

Функция ОбщийМодульПланыВидовХарактеристикОбработкаСобытий()
	Возврат "пбп_ПланыВидовХарактеристикОбработкаСобытий";
КонецФункции

Функция ОбщийМодульПланыВидовОбработкаСобытий()
	Возврат "пбп_ПланыВидовСчетовОбработкаСобытий";
КонецФункции

Функция ОбщийМодульПланыВидовРасчетаОбработкаСобытий()
	Возврат "пбп_ПланыВидовРасчетаОбработкаСобытий";
КонецФункции

Функция ОбщийМодульБизнесПроцессыОбработкаСобытий()
	Возврат "пбп_БизнесПроцессыОбработкаСобытий";
КонецФункции

Функция ОбщийМодульЗадачиОбработкаСобытий()
	Возврат "пбп_ЗадачиОбработкаСобытий";
КонецФункции

Функция ОбщийМодульПланыОбменаОбработкаСобытий()
	Возврат "пбп_ЗадачиОбработкаСобытий";
КонецФункции

Функция ОбщийМодульРегистрыСведенийОбработкаСобытий()
	Возврат "пбп_РегистрыСведенийОбработкаСобытий";
КонецФункции

Процедура ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие)
	Для Каждого Пара Из Соответствие Цикл
		Соответствие[Пара.Ключ] = ИмяМодуля + "." + Пара.Значение;
	КонецЦикла;
КонецПроцедуры

Функция ОбработатьСоответствиеСправочники(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульСправочникиОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецФункции

Функция ОбработатьСоответствиеДокументы(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульДокументыОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецФункции

Функция ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульПланыВидовХарактеристикОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецФункции

Функция ОбработатьСоответствиеПланыСчетов(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульПланыВидовОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецФункции

Функция ОбработатьСоответствиеПланыВидовРасчета(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульПланыВидовРасчетаОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецФункции

Функция ОбработатьСоответствиеБизнесПроцессы(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульБизнесПроцессыОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецФункции

Функция ОбработатьСоответствиеЗадачи(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульЗадачиОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецФункции

Функция ОбработатьСоответствиеПланыОбмена(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульПланыОбменаОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецФункции

Функция ОбработатьСоответствиеРегистрыСведений(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульРегистрыСведенийОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции