// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектИнтеграции"	, Запись.СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИнтегрируемаяСистема", Запись.ИнтегрируемаяСистема);
	Запрос.Текст = "ВЫБРАТЬ
	|	пбп_ИсторияИнтеграцииОбъектыИнтеграции.Ссылка.ДатаИнтеграции КАК ДатаИнтеграции,
	|	пбп_ИсторияИнтеграцииОбъектыИнтеграции.Ссылка.Ссылка КАК ИсторияИнтеграции,
	|	пбп_ИсторияИнтеграцииОбъектыИнтеграции.СозданОбновлен КАК СозданОбновлен
	|ИЗ
	|	Справочник.пбп_ИсторияИнтеграции.ОбъектыИнтеграции КАК пбп_ИсторияИнтеграцииОбъектыИнтеграции
	|ГДЕ
	|	пбп_ИсторияИнтеграцииОбъектыИнтеграции.ОбъектИнтеграции = &ОбъектИнтеграции
	|	И пбп_ИсторияИнтеграцииОбъектыИнтеграции.Ссылка.ИнтеграционныйПоток.НастройкаИнтеграции.ИнтегрируемаяСистема = &ИнтегрируемаяСистема
	|
	|СГРУППИРОВАТЬ ПО
	|	пбп_ИсторияИнтеграцииОбъектыИнтеграции.Ссылка.ДатаИнтеграции,
	|	пбп_ИсторияИнтеграцииОбъектыИнтеграции.Ссылка.Ссылка,
	|	пбп_ИсторияИнтеграцииОбъектыИнтеграции.СозданОбновлен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаИнтеграции";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыгрузкаРезультатаЗапроса = РезультатЗапроса.Выгрузить();
		Элементы.ПосмотретьИспользованияВИсторииИнтеграции.Заголовок = СтрШаблон(
			"Использований в истории интеграции: %1", ВыгрузкаРезультатаЗапроса.Количество());
		АдресДанныхСвязанныхИсторииИнтеграции = ПоместитьВоВременноеХранилище(
			ВыгрузкаРезультатаЗапроса, Новый УникальныйИдентификатор);
	Иначе
		Элементы.ПосмотретьИспользованияВИсторииИнтеграции.Заголовок = "Использований в истории интеграции не обнаружено";
		Элементы.ПосмотретьИспользованияВИсторииИнтеграции.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПосмотретьИспользованияВИсторииИнтеграции(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИнтегрируемаяСистема"	, Запись.ИнтегрируемаяСистема);
	ПараметрыОткрытия.Вставить("СсылкаНаОбъект"			, Запись.СсылкаНаОбъект);
	ПараметрыОткрытия.Вставить("АдресСвязанныхДанных"	, АдресДанныхСвязанныхИсторииИнтеграции);
	
	ОткрытьФорму("РегистрСведений.пбп_СоответствиеОбъектовИнтегрируемыхСистем.Форма.ФормаСвязанныхЗаписейИстории",
		ПараметрыОткрытия, Запись, Новый УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы