// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

// Возвращает соответствие типа с функцией для получения таблицы предопределенных элементов.
// 
// Возвращаемое значение:
//  Соответствие - Соответствие из КлючИЗначение:
//   * Ключ - ПланВидовХарактеристикМенеджер, СправочникМенеджер,
//   * Значение - Строка
//
Функция ФункцииСозданияТаблицПредопределенныхЭлементов() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	Соответствие.Вставить(Тип("ПланВидовХарактеристикМенеджер.пбп_ПредопределенныеЗначения"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.ПредопределенныеЗначения");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_ИнтегрируемыеСистемы"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.ПредопределенныеЗначенияИнтегрируемыеСистемы");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_ИнтеграционныеПотоки"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.ПредопределенныеЗначенияИнтеграционныеПотоки");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_НастройкиИнтеграции"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.ПредопределенныеЗначенияНастройкиИнтеграции");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_ТипСоответствияОбъектовИБ"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.ПредопределенныеЗначенияТипСоответствияОбъектовИБ");
	// КонецДобавления
	
	Возврат Соответствие;
	
КонецФункции

// Возвращает соответствие типа с функцией для получения колонок таблицы предопределенных элементов.
// 
// Возвращаемое значение:
//  Соответствие - Соответствие из КлючИЗначение:
//   * Ключ - ПланВидовХарактеристикМенеджер, СправочникМенеджер,
//   * Значение - Строка
//
Функция ФункцииПолученияКолонокПредопределенныхЭлементов() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	Соответствие.Вставить(Тип("ПланВидовХарактеристикМенеджер.пбп_ПредопределенныеЗначения"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.КолонкиПредопределенныеЗначения");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_ИнтегрируемыеСистемы"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.КолонкиИнтегрируемыеСистемы");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_ИнтеграционныеПотоки"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.КолонкиИнтеграционныеПотоки");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_НастройкиИнтеграции"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.КолонкиНастройкиИнтеграции");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_ТипСоответствияОбъектовИБ"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.КолонкиТипСоответствияОбъектовИБ");
	// КонецДобавления
	
	ОбработатьСоответствиеФункцийКолонок(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьСоответствиеФункцийКолонок(Соответствие)
	
	Для Каждого КлючЗначение Из Соответствие Цикл
		Соответствие[КлючЗначение.Ключ] = КлючЗначение.Значение + "()";
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти