// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает соответствие типа с функцией для получения таблицы предопределенных элементов.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - ПланВидовХарактеристикМенеджер, СправочникМенеджер
//   * Значение - Строка
//
Функция ФункцииСозданияТаблицПредопределенныхЭлементов() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	Соответствие.Вставить(Тип("ПланВидовХарактеристикМенеджер.пбп_ПредопределенныеЗначения"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.ПредопределенныеЗначения");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_ИнтегрируемыеСистемы"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.ПредопределенныеЗначенияИнтегрируемыеСистемы");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_ИнтеграционныеПотоки"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.ПредопределенныеЗначенияИнтеграционныеПотоки");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_НастройкиИнтеграции"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.ПредопределенныеЗначенияНастройкиИнтеграции");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_ТипСоответствияОбъектовИБ"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.ПредопределенныеЗначенияТипСоответствияОбъектовИБ");
	// КонецДобавления
	
	Возврат Соответствие;
	
КонецФункции

// Возвращает соответствие типа с функцией для получения колонок таблицы предопределенных элементов.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - ПланВидовХарактеристикМенеджер, СправочникМенеджер
//   * Значение - Строка
//
Функция ФункцииПолученияКолонокПредопределенныхЭлементов() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	Соответствие.Вставить(Тип("ПланВидовХарактеристикМенеджер.пбп_ПредопределенныеЗначения"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.КолонкиПредопределенныеЗначения");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_ИнтегрируемыеСистемы"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.КолонкиИнтегрируемыеСистемы");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_ИнтеграционныеПотоки"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.КолонкиИнтеграционныеПотоки");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_НастройкиИнтеграции"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.КолонкиНастройкиИнтеграции");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_ТипСоответствияОбъектовИБ"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.КолонкиТипСоответствияОбъектовИБ");
	// КонецДобавления
	
	ОбработатьСоответствиеФункций(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Возвращает соответствие типа с функцией для получения полей расчета хеша.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - ПланВидовХарактеристикМенеджер, СправочникМенеджер
//   * Значение - Строка
//
Функция ФункцииПолученияДобавляемыхПолейДляРасчетаХеша() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	Соответствие.Вставить(Тип("ПланВидовХарактеристикМенеджер.пбп_ПредопределенныеЗначения"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.ДобавляемыеПоляДляРасчетаХешаПредопределенныеЗначения");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_ИнтегрируемыеСистемы"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.ДобавляемыеПоляДляРасчетаХешаИнтегрируемыеСистемы");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_ИнтеграционныеПотоки"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.ДобавляемыеПоляДляРасчетаХешаИнтеграционныеПотоки");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_НастройкиИнтеграции"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.ДобавляемыеПоляДляРасчетаХешаНастройкиИнтеграции");
	Соответствие.Вставить(Тип("СправочникМенеджер.пбп_ТипСоответствияОбъектовИБ"),
		"пбп_ПредопределенныеЗначенияПереопределяемый.ДобавляемыеПоляДляРасчетаХешаТипСоответствияОбъектовИБ");
	// КонецДобавления
	
	ОбработатьСоответствиеФункций(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#Область ПолучениеПредопределенных

// Описание см. в пбп_ПредопределенныеЗначения.ПредопределенныйЭлемент.
//
Функция ПредопределенныйЭлемент(Знач ИмяОбъектаМетаданных, Знач Идентификатор, ВыбрасыватьИсключение = Ложь, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Возврат пбп_ПредопределенныеЗначения.ПолучитьПредопределенныеПоИдентификаторам(
		ИмяОбъектаМетаданных, Идентификатор, ЗначениеПоУмолчанию, , ВыбрасыватьИсключение);
	
КонецФункции

// Описание см. в пбп_ПредопределенныеЗначения.ЗначениеПредопределенногоЭлемента.
//
Функция ЗначениеПредопределенногоЭлемента(Знач ИмяОбъектаМетаданных, Ссылка, ВыбрасыватьИсключение = Ложь, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Менеджер = пбп_Переадресация.МенеджерОбъектаПоПолномуИмени(ИмяОбъектаМетаданных);
	
	Возврат Менеджер.ПолучитьЗначение(Ссылка, ВыбрасыватьИсключение, ЗначениеПоУмолчанию);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьСоответствиеФункций(Соответствие)
	
	Для Каждого КлючЗначение Из Соответствие Цикл
		Соответствие[КлючЗначение.Ключ] = КлючЗначение.Значение + "()";
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти