#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ДобавитьТестовыйНабор("пбп_ПредопределенныеЗначения")
		// ПредопределенныйЭлемент
		.ДобавитьТест("ПредопределенныйЭлемент_Кэш_ВозвращаетИзКэша")
		.ДобавитьТест("ПредопределенныйЭлемент_ПлохойИсточник_ВыбрасываетИсключение")
		// ПредопределенныеЭлементы
		.ДобавитьТест("ПредопределенныеЭлементы_ВРазрезеКлючей_БезКэша_ВозвращаетСоответствие")
		// ЗначениеПредопределенногоЭлемента
		.ДобавитьТест("ЗначениеПредопределенногоЭлемента_Кэш_ВозвращаетИзКэша")
		.ДобавитьТест("ЗначениеПредопределенногоЭлемента_БезКэша_ЧерезМенеджер")
		// ЗначенияПредопределенныхЭлементов
		.ДобавитьТест("ЗначенияПредопределенныхЭлементов_ВРазрезеКлючей_БезКэша")
		// ДополнитьЗначенияПредопределенных
		.ДобавитьТест("ДополнитьЗначенияПредопределенных_Множественный_Соответствие")
		.ДобавитьТест("ДополнитьЗначенияПредопределенных_Множественный_Массив")
		.ДобавитьТест("ДополнитьЗначенияПредопределенных_Единичный");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Тесты

Процедура ПредопределенныйЭлемент_Кэш_ВозвращаетИзКэша() Экспорт
	
	ИмяОбъекта = "Справочник.пбп_НастройкиИнтеграции";
	Идентификатор = "RabbitMq";
	ОжидаемаяСсылка = Справочники.пбп_НастройкиИнтеграции.НайтиПоРеквизиту("ИдентификаторНастройки", Идентификатор);
	
	Результат = пбп_ПредопределенныеЗначения.ПредопределенныйЭлемент(
		ИмяОбъекта,
		Идентификатор,
		Истина,
		Неопределено,
		Истина);
	
	ЮТест.ОжидаетЧто(Результат).Равно(ОжидаемаяСсылка);
	
КонецПроцедуры

Процедура ПредопределенныйЭлемент_ПлохойИсточник_ВыбрасываетИсключение() Экспорт
	
	мПараметры = Мокито.МассивПараметров("undefined", "Ид", Истина, Неопределено, Ложь);
	
	ЮТест.ОжидаетЧто(пбп_ПредопределенныеЗначения)
		.Метод("ПредопределенныйЭлемент", мПараметры)
		.ВыбрасываетИсключение("Объект метаданных не найден");
	
КонецПроцедуры

#Область ПредопределенныеЭлементы

Процедура ПредопределенныеЭлементы_ВРазрезеКлючей_БезКэша_ВозвращаетСоответствие() Экспорт
	
	SimpleKafka = Справочники.пбп_НастройкиИнтеграции.НайтиПоРеквизиту("ИдентификаторНастройки", "SimpleKafka");
	ИмяОбъекта = "Справочник.пбп_НастройкиИнтеграции";
	Идентификаторы = "RabbitMq, SimpleKafka";
	
	Результат = пбп_ПредопределенныеЗначения.ПредопределенныеЭлементы(ИмяОбъекта, Идентификаторы, Ложь, Истина);
	
	КоличествоЭлементов = 2;

	ЮТест.ОжидаетЧто(ТипЗнч(Результат)).Равно(Тип("Соответствие"));
	ЮТест.ОжидаетЧто(Результат.Количество()).Равно(КоличествоЭлементов);
	ЮТест.ОжидаетЧто(Результат.Получить("SimpleKafka")).Равно(SimpleKafka);
	
КонецПроцедуры

#КонецОбласти

#Область ЗначениеПредопределенногоЭлемента

Процедура ЗначениеПредопределенногоЭлемента_Кэш_ВозвращаетИзКэша() Экспорт
	
	ИмяОбъекта = "ПланВидовХарактеристик.пбп_ПредопределенныеЗначения";
	Ссылка = ПланыВидовХарактеристик.пбп_ПредопределенныеЗначения.НайтиПоРеквизиту(
		"ИдентификаторНастройки", "Тест_булево");
	Ожидаемое = Ложь;
	
	Результат = пбп_ПредопределенныеЗначения.ЗначениеПредопределенногоЭлемента(
		ИмяОбъекта, Ссылка, Истина, Неопределено, Истина);
	
	ЮТест.ОжидаетЧто(Результат).Равно(Ожидаемое);
	
КонецПроцедуры

Процедура ЗначениеПредопределенногоЭлемента_БезКэша_ЧерезМенеджер() Экспорт
	
	ИмяОбъекта = "ПланВидовХарактеристик.пбп_ПредопределенныеЗначения";
	Ссылка = ПланыВидовХарактеристик.пбп_ПредопределенныеЗначения.НайтиПоРеквизиту(
		"ИдентификаторНастройки", "Тест_булево");
	Ожидаемое = Ложь;
	
	Результат = пбп_ПредопределенныеЗначения.ЗначениеПредопределенногоЭлемента(
		ИмяОбъекта, Ссылка, Истина, Неопределено, Ложь);
	
	ЮТест.ОжидаетЧто(Результат).Равно(Ожидаемое);
	
КонецПроцедуры

#КонецОбласти

#Область ЗначенияПредопределенныхЭлементов

Процедура ЗначенияПредопределенныхЭлементов_ВРазрезеКлючей_БезКэша() Экспорт
	
	ИмяОбъекта = "ПланВидовХарактеристик.пбп_ПредопределенныеЗначения";
	Ссылки = Новый Массив;
	Ссылки.Добавить(
		ПланыВидовХарактеристик.пбп_ПредопределенныеЗначения.НайтиПоРеквизиту("ИдентификаторНастройки", "Тест_булево"));
	Ссылки.Добавить(
		ПланыВидовХарактеристик.пбп_ПредопределенныеЗначения.НайтиПоРеквизиту("ИдентификаторНастройки", "Тест_список"));
	
	Результат = пбп_ПредопределенныеЗначения.ЗначенияПредопределенныхЭлементов(ИмяОбъекта, Ссылки, Истина, Истина);
	
	ЮТест.ОжидаетЧто(ТипЗнч(Результат)).Равно(Тип("Соответствие"));
	ЮТест.ОжидаетЧто(ТипЗнч(Результат.Получить(Ссылки[1]))).Равно(Тип("Массив"));
	
КонецПроцедуры

#КонецОбласти

#Область ДополнитьЗначенияПредопределенных

Процедура ДополнитьЗначенияПредопределенных_Множественный_Соответствие() Экспорт
	
	Приемник = Новый Соответствие;
	Значение = "V";
	Ключ = "K";
	
	пбп_ПредопределенныеЗначения.ДополнитьЗначенияПредопределенных(Приемник, Значение, Ключ, Истина);
	
	ЮТест.ОжидаетЧто(Приемник.Получить(Ключ)).Равно(Значение);
	
КонецПроцедуры

Процедура ДополнитьЗначенияПредопределенных_Множественный_Массив() Экспорт
	
	Значение1 = 1;
	Значение2 = 2;
	КоличествоЭлементов = 2;

	Приемник = Новый Массив;
	Значение = Новый Массив;
	Значение.Добавить(Значение1);
	Значение.Добавить(Значение2);
	
	пбп_ПредопределенныеЗначения.ДополнитьЗначенияПредопределенных(Приемник, Значение, Неопределено, Истина);
	
	ЮТест.ОжидаетЧто(Приемник.Количество()).Равно(КоличествоЭлементов);
	ЮТест.ОжидаетЧто(Приемник[1]).Равно(Значение2);
	
КонецПроцедуры

Процедура ДополнитьЗначенияПредопределенных_Единичный() Экспорт
	
	Приемник = Неопределено;
	Значение = Новый УникальныйИдентификатор;
	
	пбп_ПредопределенныеЗначения.ДополнитьЗначенияПредопределенных(Приемник, Значение, Неопределено, Ложь);
	
	ЮТест.ОжидаетЧто(Приемник).Равно(Значение);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти