#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТестовыйНабор("Инициализация предопределенных элементов")
			.ДобавитьТест("Тест_ИнициализацияИзПодсистемыПредопределенных")
				.СПараметрами("ПланВидовХарактеристик.пбп_ПредопределенныеЗначения")
				.СПараметрами("Справочник.пбп_НастройкиИнтеграции")
			.ДобавитьТест("Тест_ИнициализацияНеИзПодсистемыПредопределенных") // не относится к подсистеме предопределенных
				.СПараметрами("Справочник.пбп_НастройкиОтбораОбъектов")
				.СПараметрами("РегистрСведений.пбп_СоответствияОбъектовИБ")
		.ДобавитьТестовыйНабор("Доп. параметры обработки предопределенных элементов")
			.ДобавитьТест("Тест_ДопПараметрыОбработкиКорректныеДанные")
			.ДобавитьТест("Тест_ДопПараметрыОбработкиПустаяТаблица")
			.ДобавитьТест("Тест_МенеджерНеИзПодсистемыПредопределенных") // не относится к подсистеме предопределенных
				.СПараметрами("Справочник.пбп_НастройкиОтбораОбъектов")
				.СПараметрами("РегистрСведений.пбп_СоответствияОбъектовИБ")
			.ДобавитьТест("Тест_МенеджерРавенНеопределено")
	;
	
КонецПроцедуры

Процедура Тест_ИнициализацияИзПодсистемыПредопределенных(ИмяОбъекта) Экспорт
	
	Менеджер = пбп_Переадресация.МенеджерОбъектаПоПолномуИмени(ИмяОбъекта);
	
	Результат = пбп_ПредопределенныеЗначения.ИнициализироватьПредопределенныеЗначения(Менеджер);
	
	ЮТест.ОжидаетЧто(ТипЗнч(Результат)).Равно(Тип("ТаблицаЗначений"));
	
КонецПроцедуры

Процедура Тест_ИнициализацияНеИзПодсистемыПредопределенных(ИмяОбъекта) Экспорт
	
	Менеджер = пбп_Переадресация.МенеджерОбъектаПоПолномуИмени(ИмяОбъекта);
	
	Результат = пбп_ПредопределенныеЗначения.ИнициализироватьПредопределенныеЗначения(Менеджер);
	
	ЮТест.ОжидаетЧто(ТипЗнч(Результат)).Равно(Тип("ТаблицаЗначений"));
	ЮТест.ОжидаетЧто(Результат.Количество()).Равно(0);
	
КонецПроцедуры

Процедура Тест_ДопПараметрыОбработкиКорректныеДанные() Экспорт
	
	МенеджерОбъекта = пбп_Переадресация.МенеджерОбъектаПоПолномуИмени("ПланВидовХарактеристик.пбп_ПредопределенныеЗначения");
	
	Таблица = пбп_ПредопределенныеЗначенияПереопределяемый.ТаблицаПредопределенныхЭлементов(МенеджерОбъекта);
	
	ПроверкаРезультатовОбработкиПредопределенных(МенеджерОбъекта, Таблица);
	
КонецПроцедуры

Процедура Тест_ДопПараметрыОбработкиПустаяТаблица() Экспорт
	
	МенеджерОбъекта = пбп_Переадресация.МенеджерОбъектаПоПолномуИмени("ПланВидовХарактеристик.пбп_ПредопределенныеЗначения");
	
	Таблица = Новый ТаблицаЗначений;
	
	ПроверкаРезультатовОбработкиПредопределенных(МенеджерОбъекта, Таблица);
	
КонецПроцедуры

Процедура Тест_МенеджерНеИзПодсистемыПредопределенных(ИмяОбъекта) Экспорт
	
	МенеджерОбъекта = пбп_Переадресация.МенеджерОбъектаПоПолномуИмени(ИмяОбъекта);
	
	Таблица = Новый ТаблицаЗначений;
	
	ПроверкаРезультатовОбработкиПредопределенных(МенеджерОбъекта, Таблица);
	
КонецПроцедуры

Процедура Тест_МенеджерРавенНеопределено() Экспорт
	
	МенеджерОбъекта = Неопределено;
	
	Таблица = Новый ТаблицаЗначений;
	
	ПроверкаРезультатовОбработкиПредопределенных(МенеджерОбъекта, Таблица);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаРезультатовОбработкиПредопределенных(МенеджерОбъекта, Таблица)
	
	Результат = пбп_ПредопределенныеЗначения.ДопПараметрыОбработкиПредопределенныхЭлементов(Таблица, МенеджерОбъекта);
	
	ЮТест.ОжидаетЧто(ТипЗнч(Результат)).Равно(Тип("Структура"));
	
	ЮТест.ОжидаетЧто(Результат)
		.ИмеетСвойство("Менеджер")
		.ИмеетСвойство("ПолноеИмя")
		.ИмеетСвойство("Иерархический")
		.ИмеетСвойство("КлючиХешаЭлемент")
		.ИмеетСвойство("КлючиХешаГруппа");
	
	ЮТест.ОжидаетЧто(ТипЗнч(Результат.ПолноеИмя)).Равно(Тип("Строка"));
	ЮТест.ОжидаетЧто(ТипЗнч(Результат.Иерархический)).Равно(Тип("Булево"));
	ЮТест.ОжидаетЧто(ТипЗнч(Результат.КлючиХешаЭлемент)).Равно(Тип("Структура"));
	ЮТест.ОжидаетЧто(ТипЗнч(Результат.КлючиХешаГруппа)).Равно(Тип("Структура"));
	
КонецПроцедуры

#КонецОбласти
