#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ДобавитьТестовыйНабор("пбп_ПредопределенныеЗначения")
		// ПредопределенныйЭлемент
		.ДобавитьТест("ПредопределенныйЭлемент_Кэш_ВозвращаетИзКэша").ВТранзакции()
		.ДобавитьТест("ПредопределенныйЭлемент_ПлохойИсточник_ВыбрасываетИсключение")
		// ПредопределенныеЭлементы
		.ДобавитьТест("ПредопределенныеЭлементы_ВРазрезеКлючей_БезКэша_ВозвращаетСоответствие").ВТранзакции()
		// ЗначениеПредопределенногоЭлемента
		.ДобавитьТест("ЗначениеПредопределенногоЭлемента_Кэш_ВозвращаетИзКэша").ВТранзакции()
		.ДобавитьТест("ЗначениеПредопределенногоЭлемента_БезКэша_ЧерезМенеджер").ВТранзакции()
		// ЗначенияПредопределенныхЭлементов
		.ДобавитьТест("ЗначенияПредопределенныхЭлементов_ВРазрезеКлючей_БезКэша").ВТранзакции()
		// ДополнитьЗначенияПредопределенных
		.ДобавитьТест("ДополнитьЗначенияПредопределенных_Множественный_Соответствие")
		.ДобавитьТест("ДополнитьЗначенияПредопределенных_Множественный_Массив")
		.ДобавитьТест("ДополнитьЗначенияПредопределенных_Единичный");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Тесты

Процедура ПредопределенныйЭлемент_Кэш_ВозвращаетИзКэша() Экспорт
	
	ИмяОбъекта = "Справочник.пбп_НастройкиИнтеграции";
	Идентификатор = "RabbitMq";
	
	ОжидаемаяСсылка = ЮТест.Данные().КонструкторОбъекта("Справочник.пбп_НастройкиИнтеграции")
		.Установить("ИдентификаторНастройки", Идентификатор)
		.Записать();
	
	Результат = пбп_ПредопределенныеЗначения.ПредопределенныйЭлемент(
		ИмяОбъекта,
		Идентификатор,
		Истина,
		Неопределено,
		Истина);
	
	ЮТест.ОжидаетЧто(Результат).Равно(ОжидаемаяСсылка);
	
КонецПроцедуры

Процедура ПредопределенныйЭлемент_ПлохойИсточник_ВыбрасываетИсключение() Экспорт
	
	мПараметры = Мокито.МассивПараметров("undefined", "Ид", Истина, Неопределено, Ложь);
	
	ЮТест.ОжидаетЧто(пбп_ПредопределенныеЗначения)
		.Метод("ПредопределенныйЭлемент", мПараметры)
		.ВыбрасываетИсключение("Объект метаданных не найден");
	
КонецПроцедуры

#Область ПредопределенныеЭлементы

Процедура ПредопределенныеЭлементы_ВРазрезеКлючей_БезКэша_ВозвращаетМассив() Экспорт
	
	SimpleKafkaИд = "SimpleKafka";
	SimpleKafka = ЮТест.Данные().КонструкторОбъекта("Справочник.пбп_НастройкиИнтеграции")
		.Установить("ИдентификаторНастройки", SimpleKafkaИд)
		.Записать();
	RabbitMqИд = "RabbitMq";
	RabbitMq = ЮТест.Данные().КонструкторОбъекта("Справочник.пбп_НастройкиИнтеграции")
		.Установить("ИдентификаторНастройки", RabbitMqИд)
		.Записать();
	
	ИмяОбъекта = "Справочник.пбп_НастройкиИнтеграции";
	Идентификаторы = SimpleKafkaИд + "," + RabbitMqИд;
	
	Результат = пбп_ПредопределенныеЗначения.ПредопределенныеЭлементы(ИмяОбъекта, Идентификаторы, Ложь, Ложь);
	
	КоличествоЭлементов = 2;

	ЮТест.ОжидаетЧто(ТипЗнч(Результат)).Равно(Тип("Массив"));
	ЮТест.ОжидаетЧто(Результат.Количество()).Равно(КоличествоЭлементов);
	ЮТест.ОжидаетЧто(Результат.Получить(0)).Равно(SimpleKafka);
	ЮТест.ОжидаетЧто(Результат.Получить(1)).Равно(RabbitMq);
	
КонецПроцедуры

#КонецОбласти

#Область ЗначениеПредопределенногоЭлемента

Процедура ЗначениеПредопределенногоЭлемента_Кэш_ВозвращаетИзКэша() Экспорт
	
	ИмяОбъекта = "ПланВидовХарактеристик.пбп_ПредопределенныеЗначения";
	
	ОжидаемоеЗначение = Ложь;
	
	Ссылка = ЮТест.Данные().КонструкторОбъекта(ИмяОбъекта)
		.Установить("ИдентификаторНастройки", "Тест_булево")
		.Установить("ТипЗначения", Новый ОписаниеТипов("Булево"))
		.Установить("Значение", ОжидаемоеЗначение)
		.Записать();
	
	РезультатДоКэширования = пбп_ПредопределенныеЗначения.ЗначениеПредопределенногоЭлемента(
		ИмяОбъекта, Ссылка, Истина, Неопределено, Истина);
	
	РезультатПослеКэширования = пбп_ПредопределенныеЗначения.ЗначениеПредопределенногоЭлемента(
		ИмяОбъекта, Ссылка, Истина, Неопределено, Истина);
	
	ЮТест.ОжидаетЧто(РезультатДоКэширования).Равно(ОжидаемоеЗначение);
	ЮТест.ОжидаетЧто(РезультатДоКэширования).Равно(ОжидаемоеЗначение);
	ЮТест.ОжидаетЧто(РезультатДоКэширования).Равно(РезультатПослеКэширования);
	
КонецПроцедуры

Процедура ЗначениеПредопределенногоЭлемента_БезКэша_ЧерезМенеджер() Экспорт
	
	Менеджер = ПланыВидовХарактеристик.пбп_ПредопределенныеЗначения;
	
	ОжидаемоеЗначение = Ложь;
	
	Ссылка = ЮТест.Данные().КонструкторОбъекта(Менеджер)
		.Установить("ИдентификаторНастройки", "Тест_булево")
		.Установить("ТипЗначения", Новый ОписаниеТипов("Булево"))
		.Установить("Значение", ОжидаемоеЗначение)
		.Записать();
	
	Результат = пбп_ПредопределенныеЗначения.ЗначениеПредопределенногоЭлемента(
		Менеджер, Ссылка, Истина, Неопределено, Ложь);
	
	ЮТест.ОжидаетЧто(Результат).Равно(ОжидаемоеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область ЗначенияПредопределенныхЭлементов

Процедура ЗначенияПредопределенныхЭлементов_ВРазрезеКлючей_БезКэша() Экспорт
	
	ИмяОбъекта = "ПланВидовХарактеристик.пбп_ПредопределенныеЗначения";
	ОжидаемоеЗначениеБулево = Ложь;
	ОжидаемоеЗначениеСтрока = "тест";
	
	Тест_булево = ЮТест.Данные().КонструкторОбъекта(ИмяОбъекта)
		.Установить("ИдентификаторНастройки", "Тест_булево")
		.Установить("ТипЗначения", Новый ОписаниеТипов("Булево"))
		.Установить("Значение", ОжидаемоеЗначениеБулево)
		.Записать();
	Тест_список = ЮТест.Данные().КонструкторОбъекта(ИмяОбъекта)
		.Установить("ИдентификаторНастройки", "Тест_список")
		.Установить("СписокЗначений", Истина)
		.Установить("ТипЗначения", Новый ОписаниеТипов("Строка"))
		.ТабличнаяЧасть("ЗначенияЭлементов")
			.ДобавитьСтроку()
				.Установить("Значение", ОжидаемоеЗначениеСтрока)
		.Записать();
	
	Ссылки = Новый Массив;
	Ссылки.Добавить(Тест_булево);
	Ссылки.Добавить(Тест_список);
	
	Результат = пбп_ПредопределенныеЗначения.ЗначенияПредопределенныхЭлементов(ИмяОбъекта, Ссылки, , Истина);
	
	ЮТест.ОжидаетЧто(ТипЗнч(Результат)).Равно(Тип("Соответствие"));
	ЮТест.ОжидаетЧто(Результат.Получить(Ссылки[0])).Равно(ОжидаемоеЗначениеБулево);
	ЮТест.ОжидаетЧто(ТипЗнч(Результат.Получить(Ссылки[1]))).Равно(Тип("Массив"));
	ЮТест.ОжидаетЧто(Результат.Получить(Ссылки[1])[0]).Равно(ОжидаемоеЗначениеСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ДополнитьЗначенияПредопределенных

Процедура ДополнитьЗначенияПредопределенных_Множественный_Соответствие() Экспорт
	
	Приемник = Новый Соответствие;
	Значение = "V";
	Ключ = "K";
	
	пбп_ПредопределенныеЗначения.ДополнитьЗначенияПредопределенных(Приемник, Значение, Ключ, Истина);
	
	ЮТест.ОжидаетЧто(Приемник.Получить(Ключ)).Равно(Значение);
	
КонецПроцедуры

Процедура ДополнитьЗначенияПредопределенных_Множественный_Массив() Экспорт
	
	Значение1 = 1;
	Значение2 = 2;
	КоличествоЭлементов = 2;

	Приемник = Новый Массив;
	Значение = Новый Массив;
	Значение.Добавить(Значение1);
	Значение.Добавить(Значение2);
	
	пбп_ПредопределенныеЗначения.ДополнитьЗначенияПредопределенных(Приемник, Значение, Неопределено, Истина);
	
	ЮТест.ОжидаетЧто(Приемник.Количество()).Равно(КоличествоЭлементов);
	ЮТест.ОжидаетЧто(Приемник[1]).Равно(Значение2);
	
КонецПроцедуры

Процедура ДополнитьЗначенияПредопределенных_Единичный() Экспорт
	
	Приемник = Неопределено;
	Значение = Новый УникальныйИдентификатор;
	
	пбп_ПредопределенныеЗначения.ДополнитьЗначенияПредопределенных(Приемник, Значение, Неопределено, Ложь);
	
	ЮТест.ОжидаетЧто(Приемник).Равно(Значение);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти