#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТестовыйНабор("Инициализировать предопределенные элементы")
			.ДобавитьТест("Тест_ИнициализироватьПредопределенныеЭлементы_ПустаяТаблица")
				.СПараметрами("Справочник.пбп_ИнтеграционныеПотоки")
				.СПараметрами("Справочник.пбп_НастройкиОтбораОбъектов")
				.СПараметрами("ПланВидовХарактеристик.пбп_ПредопределенныеЗначения")
			.ДобавитьТест("Тест_ИнициализироватьПредопределенныеЭлементы_ЕстьКонфликты")
				.СПараметрами("Справочник.пбп_ИнтеграционныеПотоки")
	;
	
КонецПроцедуры

Процедура Тест_ИнициализироватьПредопределенныеЭлементы_ПустаяТаблица(ИмяОбъекта) Экспорт
	
	ТаблицаКонфликтов = Новый ТаблицаЗначений;
	
	Мокито.Обучение(пбп_ПредопределенныеЗначения)
		.Когда("ИнициализироватьПредопределенныеЗначения")
		.Вернуть(ТаблицаКонфликтов)
		.Прогон()
	;
	
	ОжидаемаяСтруктура = Новый Структура;
	ОжидаемаяСтруктура.Вставить("АдресТаблицы", "");
	ОжидаемаяСтруктура.Вставить("ЕстьСтроки", Ложь);
	
	Ожидаемое = Новый ФиксированнаяСтруктура(ОжидаемаяСтруктура);
	
	Результат = пбп_ПредопределенныеЗначенияВызовСервера.ИнициализироватьПредопределенныеЗначения(ИмяОбъекта);
	
	ЮТест.ОжидаетЧто(ТипЗнч(Результат)).Равно(Тип("ФиксированнаяСтруктура"));
	
	ЮТест.ОжидаетЧто(Результат)
		.Свойство("АдресТаблицы").НеЗаполнено()
		.Свойство("ЕстьСтроки").ЭтоЛожь()
	;
	
КонецПроцедуры

Процедура Тест_ИнициализироватьПредопределенныеЭлементы_ЕстьКонфликты(ИмяОбъекта) Экспорт
	
	ТаблицаКонфликтов = Новый ТаблицаЗначений;
	ТаблицаКонфликтов.Добавить();
	
	Мокито.Обучение(пбп_ПредопределенныеЗначения)
		.Когда("ИнициализироватьПредопределенныеЗначения")
		.Вернуть(ТаблицаКонфликтов)
		.Прогон()
	;
	
	ОжидаемаяСтруктура = Новый Структура;
	ОжидаемаяСтруктура.Вставить("АдресТаблицы", "АдресВременногоХранилища");
	ОжидаемаяСтруктура.Вставить("ЕстьСтроки", Истина);
	
	Ожидаемое = Новый ФиксированнаяСтруктура(ОжидаемаяСтруктура);
	
	Результат = пбп_ПредопределенныеЗначенияВызовСервера.ИнициализироватьПредопределенныеЗначения(ИмяОбъекта);
	
	ЮТест.ОжидаетЧто(ТипЗнч(Результат)).Равно(Тип("ФиксированнаяСтруктура"));
	
	ЮТест.ОжидаетЧто(Результат)
		.Свойство("АдресТаблицы").Заполнено()
		.Свойство("ЕстьСтроки").ЭтоИстина()
	;
	
КонецПроцедуры

#КонецОбласти