// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//
// Для реализации логики заполнения обработчика конкретного типа метаданных необходимо
// указать в соответствии тип и имя метода в одноименной функции. Этот метод будет
// вызываться при срабатывании соответствующей подписки на событие.
//
// Для изменения имен модулей или добавлении новых необходимо в вызов процедуры
// "ОбработатьСоответствие<имя типа метаданных>" передавать вторым параметром имя необходимого
// модуля. Например, если стоит задача разбить события документов по разным модулям:
//
// ИмяМодуля = "пбп_ДокументыПередЗаписью";
// ОбработатьСоответствиеДокументы(Соответствие, ИмяМодуля);
//
// Если имя модуля не указано, то будет использоваться имя, указанное в соответствующей метаданным
// функции "ОбщийМодуль<имя типа метаданных>ОбработкаСобытий". То есть для документов будет вызван
// общий модуль "пбп_ДокументыОбработкаСобытий", указанный в функции "ОбщийМодульДокументыОбработкаСобытий".

#Область ПрограммныйИнтерфейс

#Область Справочники

#Область Объект

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураПриУстановкеНовогоКода");
//
Функция СправочникиПриУстановкеНовогоКода() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураПриКопировании");
//
Функция СправочникиПриКопировании() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураОбработкаЗаполнения");
//
Функция СправочникиОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураПередЗаписью");
//
Функция СправочникиПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураПриЗаписи");
//
Функция СправочникиПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураПередУдалением");
//
Функция СправочникиПередУдалением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураОбработкаПроверкиЗаполнения");
//
Функция СправочникиОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураОбработкаФормированияПоВерсииИсторииДанных");
//
Функция СправочникиОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Объект

#Область Менеджер

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникМенеджер.Номенеклатура"), "НоменеклатураОбработкаПолученияДанныхВыбора");
//
Функция СправочникиОбработкаПолученияДанныхВыбора() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникМенеджер.Номенеклатура"), "НоменеклатураОбработкаПолученияФормы");
//
Функция СправочникиОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникМенеджер.Номенеклатура"), "НоменеклатураОбработкаПолученияПолейПредставления");
//
Функция СправочникиОбработкаПолученияПолейПредставления() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникМенеджер.Номенеклатура"), "НоменеклатураОбработкаПолученияПредставления");
//
Функция СправочникиОбработкаПолученияПредставления() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникМенеджер.Номенеклатура"), "НоменеклатураОбработкаПослеЗаписиВерсийИсторииДанных");
//
Функция СправочникиОбработкаПослеЗаписиВерсийИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеСправочники(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Менеджер

#КонецОбласти // Справочники

#Область Документы

#Область Объект

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетПриУстановкеНовогоНомера");
//
Функция ДокументыПриУстановкеНовогоНомера() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетПриКопировании");
//
Функция ДокументыПриКопировании() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетОбработкаЗаполнения");
//
Функция ДокументыОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетПередЗаписью");
//
Функция ДокументыПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетПриЗаписи");
//
Функция ДокументыПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетПередУдалением");
//
Функция ДокументыПередУдалением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетОбработкаПроведения");
//
Функция ДокументыОбработкаПроведения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетОбработкаУдаленияПроведения");
//
Функция ДокументыОбработкаУдаленияПроведения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетОбработкаПроверкиЗаполнения");
//
Функция ДокументыОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетОбработкаФормированияПоВерсииИсторииДанных");
//
Функция ДокументыОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Объект

#Область Менеджер

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументМенеджер.АвансовыйОтчет"), "АвансовыйОтчетОбработкаПолученияДанныхВыбора");
//
Функция ДокументыОбработкаПолученияДанныхВыбора() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументМенеджер.АвансовыйОтчет"), "АвансовыйОтчетОбработкаПолучениФормы");
//
Функция ДокументыОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументМенеджер.АвансовыйОтчет"), "АвансовыйОтчетОбработкаПолученияПолейПредставления");
//
Функция ДокументыОбработкаПолученияПолейПредставления() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументМенеджер.АвансовыйОтчет"), "АвансовыйОтчетОбработкаПолученияПредставления");
//
Функция ДокументыОбработкаПолученияПредставления() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументМенеджер.АвансовыйОтчет"), "АвансовыйОтчетОбработкаПослеЗаписиВерсийИсторииДанных");
//
Функция ДокументыОбработкаПослеЗаписиВерсийИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеДокументы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Менеджер

#КонецОбласти // Документы

#Область ПланыВидовХарактеристик

#Область Объект

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияПриУстановкеНовогоКода");
//
Функция ПланыВидовХарактеристикПриУстановкеНовогоКода() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияПриКопировании");
//
Функция ПланыВидовХарактеристикПриКопировании() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияОбработкаЗаполнения");
//
Функция ПланыВидовХарактеристикОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияПередЗаписью");
//
Функция ПланыВидовХарактеристикПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияПриЗаписи");
//
Функция ПланыВидовХарактеристикПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияПередУдалением");
//
Функция ПланыВидовХарактеристикПередУдалением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияОбработкаПроверкиЗаполнения");
//
Функция ПланыВидовХарактеристикОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияОбработкаФормированияПоВерсииИсторииДанных");
//
Функция ПланыВидовХарактеристикОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Объект

#Область Менеджер

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикМенеджер.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияОбработкаПолученияДанныхВыбора");
//
Функция ПланыВидовХарактеристикОбработкаПолученияДанныхВыбора() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикМенеджер.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияОбработкаПолученияФормы");
//
Функция ПланыВидовХарактеристикОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикМенеджер.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияОбработкаПолученияПолейПредставления");
//
Функция ПланыВидовХарактеристикОбработкаПолученияПолейПредставления() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикМенеджер.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияОбработкаПолученияПредставления");
//
Функция ПланыВидовХарактеристикОбработкаПолученияПредставления() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовХарактеристикМенеджер.ДополнительныеРеквизитыИСведения"),
//		"ДополнительныеРеквизитыИСведенияОбработкаПослеЗаписиВерсийИсторииДанных");
//
Функция ПланыВидовХарактеристикОбработкаПослеЗаписиВерсийИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Менеджер

#КонецОбласти // ПланыВидовХарактеристик

#Область ПланыСчетов

#Область Объект

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовОбъект.Хозрасчетный"), "ХозрасчетныйПриКопировании");
//
Функция ПланыСчетовПриКопировании() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовОбъект.Хозрасчетный"), "ХозрасчетныйОбработкаЗаполнения");
//
Функция ПланыСчетовОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовОбъект.Хозрасчетный"), "ХозрасчетныйПередЗаписью");
//
Функция ПланыСчетовПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовОбъект.Хозрасчетный"), "ХозрасчетныйПриЗаписи");
//
Функция ПланыСчетовПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовОбъект.Хозрасчетный"), "ХозрасчетныйПередУдалением");
//
Функция ПланыСчетовПередУдалением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовОбъект.Хозрасчетный"), "ХозрасчетныйОбработкаПроверкиЗаполнения");
//
Функция ПланыСчетовОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовОбъект.Хозрасчетный"), "ХозрасчетныйОбработкаФормированияПоВерсииИсторииДанных");
//
Функция ПланыСчетовОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Объект

#Область Менеджер

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовМенеджер.Хозрасчетный"), "ХозрасчетныйОбработкаПолученияДанныхВыбора");
//
Функция ПланыСчетовОбработкаПолученияДанныхВыбора() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовМенеджер.Хозрасчетный"), "ХозрасчетныйОбработкаПолученияФормы");
//
Функция ПланыСчетовОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовМенеджер.Хозрасчетный"), "ХозрасчетныйОбработкаПолученияПолейПредставления");
//
Функция ПланыСчетовОбработкаПолученияПолейПредставления() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовМенеджер.Хозрасчетный"), "ХозрасчетныйОбработкаПолученияПредставления");
//
Функция ПланыСчетовОбработкаПолученияПредставления() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланСчетовМенеджер.Хозрасчетный"), "ХозрасчетныйОбработкаПослеЗаписиВерсийИсторииДанных");
//
Функция ПланыСчетовОбработкаПослеЗаписиВерсийИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыСчетов(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Менеджер

#КонецОбласти // ПланыСчетов

#Область ПланыВидовРасчета

#Область Объект

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаОбъект.Начисления"), "НачисленияПриКопировании");
//
Функция ПланыВидовРасчетаПриКопировании() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаОбъект.Начисления"), "НачисленияОбработкаЗаполнения");
//
Функция ПланыВидовРасчетаОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаОбъект.Начисления"), "НачисленияПередЗаписью");
//
Функция ПланыВидовРасчетаПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаОбъект.Начисления"), "НачисленияПриЗаписи");
//
Функция ПланыВидовРасчетаПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаОбъект.Начисления"), "НачисленияПередУдалением");
//
Функция ПланыВидовРасчетаПередУдалением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаОбъект.Начисления"), "НачисленияОбработкаПроверкиЗаполнения");
//
Функция ПланыВидовРасчетаОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаОбъект.Начисления"), "НачисленияОбработкаФормированияПоВерсииИсторииДанных");
//
Функция ПланыВидовРасчетаОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Объект

#Область Менеджер

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаМенеджер.Начисления"), "НачисленияОбработкаПолученияДанныхВыбора");
//
Функция ПланыВидовРасчетаОбработкаПолученияДанныхВыбора() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаМенеджер.Начисления"), "НачисленияОбработкаПолученияФормы");
//
Функция ПланыВидовРасчетаОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаМенеджер.Начисления"), "НачисленияОбработкаПолученияПолейПредставления");
//
Функция ПланыВидовРасчетаОбработкаПолученияПолейПредставления() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаМенеджер.Начисления"), "НачисленияОбработкаПолученияПредставления");
//
Функция ПланыВидовРасчетаОбработкаПолученияПредставления() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланВидовРасчетаМенеджер.Начисления"), "НачисленияОбработкаПослеЗаписиИсторииДанных");
//
Функция ПланыВидовРасчетаОбработкаПослеЗаписиВерсийИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыВидовРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Менеджер

#КонецОбласти // ПланыВидовРасчета

#Область БизнесПроцессы

#Область Объект

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеПриУстановкеНовогоНомера");
//
Функция БизнесПроцессыПриУстановкеНовогоНомера() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеПриКопировании");
//
Функция БизнесПроцессыПриКопировании() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеОбработкаЗаполнения");
//
Функция БизнесПроцессыОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеПередЗаписью");
//
Функция БизнесПроцессыПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеПриЗаписи");
//
Функция БизнесПроцессыПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеПередУдалением");
//
Функция БизнесПроцессыПередУдалением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеОбработкаИнтерактивнойАктивации");
//
Функция БизнесПроцессыОбработкаИнтерактивнойАктивации() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеОбработкаПроверкиЗаполнения");
//
Функция БизнесПроцессыОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессОбъект.Задание"), "ЗаданиеОбработкаФормированияПоВерсииИсторииДанных");
//
Функция БизнесПроцессыОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Объект

#Область Менеджер

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессМенеджер.Задание"), "ЗаданиеОбработкаПолученияДанныхВыбора");
//
Функция БизнесПроцессыРасчетаОбработкаПолученияДанныхВыбора() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессМенеджер.Задание"), "ЗаданиеОбработкаПолученияФормы");
//
Функция БизнесПроцессыОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессМенеджер.Задание"), "ЗаданиеОбработкаПолученияПолейПредставления");
//
Функция БизнесПроцессыОбработкаПолученияПолейПредставления() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессМенеджер.Задание"), "ЗаданиеОбработкаПолученияПредставления");
//
Функция БизнесПроцессыОбработкаПолученияПредставления() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("БизнесПроцессМенеджер.Задание"), "ЗаданиеОбработкаПослеЗаписиВерсийИсторииДанных");
//
Функция БизнесПроцессыОбработкаПослеЗаписиВерсийИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеБизнесПроцессы(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Менеджер

#КонецОбласти // БизнесПроцессы

#Область Задачи

#Область Объект

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяПередЗаписью");
//
Функция ЗадачиПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяПриЗаписи");
//
Функция ЗадачиПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяПередУдалением");
//
Функция ЗадачиПередУдалением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяОбработкаИнтерактивнойАктивации");
//
Функция ЗадачиОбработкаИнтерактивнойАктивации() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяОбработкаПроверкиВыполнения");
//
Функция ЗадачиОбработкаПроверкиВыполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяПередВыполнением");
//
Функция ЗадачиПередВыполнением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяПередИнтерактивнымВыполнением");
//
Функция ЗадачиПередИнтерактивнымВыполнением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяПриВыполнении");
//
Функция ЗадачиПриВыполнении() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяОбработкаПроверкиЗаполнения");
//
Функция ЗадачиОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаОбъект.ЗадачаИсполнителя"), "ЗадачаИсполнителяОбработкаФормированияПоВерсииИсторииДанных");
//
Функция ЗадачиОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Объект

#Область Менеджер

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаМенеджер.ЗадачаИсполнителя"), "ЗадачаИсполнителяОбработкаПолученияДанныхВыбора");
//
Функция ЗадачиОбработкаПолученияДанныхВыбора() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаМенеджер.ЗадачаИсполнителя"), "ЗадачаИсполнителяОбработкаПолученияФормы");
//
Функция ЗадачиОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаМенеджер.ЗадачаИсполнителя"), "ЗадачаИсполнителяОбработкаПолученияПолейПредставления");
//
Функция ЗадачиОбработкаПолученияПолейПредставления() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаМенеджер.ЗадачаИсполнителя"), "ЗадачаИсполнителяОбработкаПолученияПредставления");
//
Функция ЗадачиОбработкаПолученияПредставления() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЗадачаМенеджер.ЗадачаИсполнителя"), "ЗадачаИсполнителяОбработкаПослеЗаписиВерсийИсторииДанных");
//
Функция ЗадачиОбработкаПослеЗаписиВерсийИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Менеджер

#КонецОбласти // Задачи

#Область ПланыОбмена

#Область Объект

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриУстановкеНовогоКода");
//
Функция ПланыОбменаПриУстановкеНовогоКода() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриКопировании");
//
Функция ПланыОбменаПриКопировании() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйОбработкаЗаполнения");
//
Функция ПланыОбменаОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПередЗаписью");
//
Функция ПланыОбменаПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриЗаписи");
//
Функция ПланыОбменаПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПередУдалением");
//
Функция ПланыОбменаПередУдалением() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриОтправкеДанныхПодчиненному");
//
Функция ПланыОбменаПриОтправкеДанныхПодчиненному() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриОтправкеДанныхГлавному");
//
Функция ПланыОбменаПриОтправкеДанныхГлавному() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриПолученииДанныхОтПодчиненного");
//
Функция ПланыОбменаПриПолученииДанныхОтПодчиненного() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриПолученииДанныхОтГлавного");
//
Функция ПланыОбменаПриПолученииДанныхОтГлавного() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйОбработкаПроверкиЗаполнения");
//
Функция ПланыОбменаОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриОтправкеДанныхУзлаПодчиненному");
//
Функция ПланыОбменаПриОтправкеДанныхУзлаПодчиненному() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриПолученииДанныхУзлаОтГлавного");
//
Функция ПланыОбменаПриПолученииДанныхУзлаОтГлавного() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПриАвтоматическомСозданииНовогоУзла");
//
Функция ПланыОбменаПриАвтоматическомСозданииНовогоУзла() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПередСозданиемНачальногоОбраза");
//
Функция ПланыОбменаПередСозданиемНачальногоОбраза() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПередНачаломОтправкиДанныхПодчиненному");
//
Функция ПланыОбменаПередНачаломОтправкиДанныхПодчиненному() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйПередНачаломОтправкиДанныхГлавному");
//
Функция ПланыОбменаПередНачаломОтправкиДанныхГлавному() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаОбъект.Полный"), "ПолныйОбработкаФормированияПоВерсииИсторииДанных");
//
Функция ПланыОбменаОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Объект

#Область Менеджер

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаМенеджер.Полный"), "ПолныйОбработкаПолученияДанныхВыбора");
//
Функция ПланыОбменаОбработкаПолученияДанныхВыбора() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаМенеджер.Полный"), "ПолныйОбработкаПолученияФормы");
//
Функция ПланыОбменаОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаМенеджер.Полный"), "ПолныйОбработкаПолученияПолейПредставления");
//
Функция ПланыОбменаОбработкаПолученияПолейПредставления() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеЗадачи(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПланОбменаМенеджер.Полный"), "ПолныйОбработкаПолученияПредставления");
//
Функция ПланыОбменаОбработкаПолученияПредставления() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПланыОбмена(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Менеджер

#КонецОбласти // ПланыОбмена

#Область Константы

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("КонстантаМенеджерЗначения.ДополнительныйЯзык1"), "ДополнительныйЯзык1ПередЗаписью");
//
Функция КонстантыПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеКонстанты(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("КонстантаМенеджерЗначения.ДополнительныйЯзык1"), "ДополнительныйЯзык1ПриЗаписи");
//
Функция КонстантыПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеКонстанты(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("КонстантаМенеджерЗначения.ДополнительныйЯзык1"),
// 		"ДополнительныйЯзык1ОбработкаПроверкиЗаполнения");
//
Функция КонстантыОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеКонстанты(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("КонстантаМенеджерЗначения.ДополнительныйЯзык1"),
// 		"ДополнительныйЯзык1ОбработкаФормированияПоВерсииИсторииДанных");
//
Функция КонстантыОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеКонстанты(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Константы

#Область РегистрыСведений

#Область НаборЗаписей

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрСведенийНаборЗаписей.ШтрихкодыНоменклатуры"), "ШтрихкодыНоменклатурыПередЗаписью");
//
Функция РегистрыСведенийПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыСведений(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрСведенийНаборЗаписей.ШтрихкодыНоменклатуры"), "ШтрихкодыНоменклатурыПриЗаписи");
//
Функция РегистрыСведенийПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыСведений(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрСведенийНаборЗаписей.ШтрихкодыНоменклатуры"), "ШтрихкодыНоменклатурыОбработкаЗаполнения");
//
Функция РегистрыСведенийОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыСведений(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрСведенийНаборЗаписей.ШтрихкодыНоменклатуры"), "ШтрихкодыНоменклатурыОбработкаПроверкиЗаполнения");
//
Функция РегистрыСведенийОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыСведений(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрСведенийНаборЗаписей.ШтрихкодыНоменклатуры"), "ШтрихкодыНоменклатурыОбработкаФормированияПоВерсииИсторииДанных");
//
Функция РегистрыСведенийОбработкаФормированияПоВерсииИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыСведений(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // НаборЗаписей

#Область Менеджер

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрСведенийМенеджер.ШтрихкодыНоменклатуры"), "ШтрихкодыНоменклатурыОбработкаПолученияФормы");
//
Функция РегистрыСведенийОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыСведений(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрСведенийМенеджер.ШтрихкодыНоменклатуры"), "ШтрихкодыНоменклатурыОбработкаПослеЗаписиВерсийИсторииДанных");
//
Функция РегистрыСведенийОбработкаПослеЗаписиВерсийИсторииДанных() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыСведений(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Менеджер

#КонецОбласти // РегистрыСведений

#Область РегистрыНакопления

#Область НаборЗаписей

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрНакопленийНаборЗаписей.ТоварыОрганизаций"), "ТоварыОрганизацийПередЗаписью");
//
Функция РегистрыНакопленияПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыНакопления(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрНакопленийНаборЗаписей.ТоварыОрганизаций"), "ТоварыОрганизацийПриЗаписи");
//
Функция РегистрыНакопленияПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыНакопления(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрНакопленийНаборЗаписей.ТоварыОрганизаций"), "ТоварыОрганизацийОбработкаПроверкиЗаполнения");
//
Функция РегистрыНакопленияОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыНакопления(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // НаборЗаписей

#Область Менеджер

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрНакопленияМенеджер.ШтрихкодыНоменклатуры"), "ШтрихкодыНоменклатурыОбработкаПолученияФормы");
//
Функция РегистрыНакопленияОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыНакопления(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Менеджер

#КонецОбласти // РегистрыНакопления

#Область РегистрыБухгалтерии

#Область НаборЗаписей

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрБухгалтерииНаборЗаписей.Хозрасчетный"), "ХозрасчетныйПередЗаписью");
//
Функция РегистрыБухгалтерииПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыБухгалтерии(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрБухгалтерииНаборЗаписей.Хозрасчетный"), "ХозрасчетныйПриЗаписи");
//
Функция РегистрыБухгалтерииПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыБухгалтерии(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрБухгалтерииНаборЗаписей.Хозрасчетный"), "ХозрасчетныйОбработкаПроверкиЗаполнения");
//
Функция РегистрыБухгалтерииОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыБухгалтерии(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // НаборЗаписей

#Область Менеджер

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрБухгалтерииМенеджер.Хозрасчетный"), "ХозрасчетныйОбработкаПолученияФормы");
//
Функция РегистрыБухгалтерииОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыБухгалтерии(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Менеджер

#КонецОбласти // РегистрыБухгалтерии

#Область РегистрыРасчета

#Область НаборЗаписей

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрРасчетаНаборЗаписей.Начисления"), "НачисленияПередЗаписью");
//
Функция РегистрыРасчетаПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрРасчетаНаборЗаписей.Начисления"), "НачисленияПередЗаписью");
//
Функция РегистрыРасчетаПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрРасчетаНаборЗаписей.Начисления"), "НачисленияПередЗаписью");
//
Функция РегистрыРасчетаОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // НаборЗаписей

#Область Менеджер

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("РегистрРасчетаМенеджер.Начисления"), "НачисленияОбработкаПолученияФормы");
//
Функция РегистрыРасчетаОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеРегистрыРасчета(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Менеджер

#КонецОбласти // РегистрыБухгалтерии

#Область Последовательности

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПоследовательностиНаборЗаписей.ДвижениеТоваров"), "ДвижениеТоваровПередЗаписью");
//
Функция ПоследовательностиПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПоследовательности(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПоследовательностиНаборЗаписей.ДвижениеТоваров"), "ДвижениеТоваровПриЗаписи");
//
Функция ПоследовательностиПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПоследовательности(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПоследовательностиНаборЗаписей.ДвижениеТоваров"), "ДвижениеТоваровОбработкаПроверкиЗаполнения");
//
Функция ПоследовательностиОбработкаПроверкиЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПоследовательности(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // Последовательности

#Область ОстальныеМенеджеры

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПеречислениеМенеджер.ЮрФизЛицо"), "ЮрФизЛицоОбработкаПолученияДанныхВыбора");
//
Функция ПеречисленияОбработкаПолученияДанныхВыбора() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПрочиеМенеджеры(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ПеречислениеМенеджер.ЮрФизЛицо"), "ЮрФизЛицоОбработкаПолученияФормы");
//
Функция ПеречисленияОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПрочиеМенеджеры(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ОтчетМенеджер.АнализВерсийОбъектов"), "АнализВерсийОбъектовОбработкаПолученияФормы");
//
Функция ОтчетыОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПрочиеМенеджеры(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ОбработкаМенеджер.ЗагрузкаКурсовВалют"), "ЗагрузкаКурсовВалютОбработкаПолученияФормы");
//
Функция ОбработкиОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПрочиеМенеджеры(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ЖурналДокументовМенеджер.Взаимодействия"), "ВзаимодействияОбработкаПолученияФормы");
//
Функция ЖурналыДокументовОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПрочиеМенеджеры(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("КритерийОтбораМенеджер.СвязанныеДокументы"), "СвязанныеДокументыОбработкаПолученияФормы");
//
Функция КритерииОтбораОбработкаПолученияФормы() Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Добавление
	
	// КонецДобавления
	
	ОбработатьСоответствиеПрочиеМенеджеры(Соответствие);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // ОстальныеМенеджеры

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ОбщийМодульСправочникиОбработкаСобытий()
	Возврат "пбп_СправочникиОбработкаСобытий";
КонецФункции

Функция ОбщийМодульДокументыОбработкаСобытий()
	Возврат "пбп_ДокументыОбработкаСобытий";
КонецФункции

Функция ОбщийМодульПланыВидовХарактеристикОбработкаСобытий()
	Возврат "пбп_ПланыОбработкаСобытий";
КонецФункции

Функция ОбщийМодульПланыСчетовОбработкаСобытий()
	Возврат "пбп_ПланыОбработкаСобытий";
КонецФункции

Функция ОбщийМодульПланыВидовРасчетаОбработкаСобытий()
	Возврат "пбп_ПланыОбработкаСобытий";
КонецФункции

Функция ОбщийМодульБизнесПроцессыОбработкаСобытий()
	Возврат "пбп_БизнесПроцессыОбработкаСобытий";
КонецФункции

Функция ОбщийМодульЗадачиОбработкаСобытий()
	Возврат "пбп_ЗадачиОбработкаСобытий";
КонецФункции

Функция ОбщийМодульПланыОбменаОбработкаСобытий()
	Возврат "пбп_ПланыОбработкаСобытий";
КонецФункции

Функция ОбщийМодульКонстантыОбработкаСобытий()
	Возврат "пбп_КонстантыОбработкаСобытий";
КонецФункции

Функция ОбщийМодульРегистрыСведенийОбработкаСобытий()
	Возврат "пбп_РегистрыОбработкаСобытий";
КонецФункции

Функция ОбщийМодульРегистрыНакопленияОбработкаСобытий()
	Возврат "пбп_РегистрыОбработкаСобытий";
КонецФункции

Функция ОбщийМодульРегистрыБухгалтерииОбработкаСобытий()
	Возврат "пбп_РегистрыОбработкаСобытий";
КонецФункции

Функция ОбщийМодульРегистрыРасчетаОбработкаСобытий()
	Возврат "пбп_РегистрыОбработкаСобытий";
КонецФункции

Функция ОбщийМодульПоследовательностиОбработкаСобытий()
	Возврат "пбп_РегистрыОбработкаСобытий";
КонецФункции

Функция ОбщийМодульПрочиеМенеджерыОбработкаСобытий()
	Возврат "пбп_ПрочиеМенеджерыОбработкаСобытий";
КонецФункции

Процедура ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие)
	Для Каждого Пара Из Соответствие Цикл
		Соответствие[Пара.Ключ] = ИмяМодуля + "." + Пара.Значение;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьСоответствиеСправочники(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульСправочникиОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецПроцедуры

Процедура ОбработатьСоответствиеДокументы(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульДокументыОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецПроцедуры

Процедура ОбработатьСоответствиеПланыВидовХарактеристик(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульПланыВидовХарактеристикОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецПроцедуры

Процедура ОбработатьСоответствиеПланыСчетов(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульПланыСчетовОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецПроцедуры

Процедура ОбработатьСоответствиеПланыВидовРасчета(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульПланыВидовРасчетаОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецПроцедуры

Процедура ОбработатьСоответствиеБизнесПроцессы(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульБизнесПроцессыОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецПроцедуры

Процедура ОбработатьСоответствиеЗадачи(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульЗадачиОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецПроцедуры

Процедура ОбработатьСоответствиеПланыОбмена(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульПланыОбменаОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецПроцедуры

Процедура ОбработатьСоответствиеКонстанты(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульКонстантыОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецПроцедуры

Процедура ОбработатьСоответствиеРегистрыСведений(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульРегистрыСведенийОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецПроцедуры

Процедура ОбработатьСоответствиеРегистрыНакопления(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульРегистрыНакопленияОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецПроцедуры

Процедура ОбработатьСоответствиеРегистрыБухгалтерии(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульРегистрыБухгалтерииОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецПроцедуры

Процедура ОбработатьСоответствиеРегистрыРасчета(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульРегистрыРасчетаОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецПроцедуры

Процедура ОбработатьСоответствиеПоследовательности(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульПоследовательностиОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецПроцедуры

Процедура ОбработатьСоответствиеПрочиеМенеджеры(Соответствие, ИмяМодуля = "")
	
	Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		ИмяМодуля = ОбщийМодульПрочиеМенеджерыОбработкаСобытий();
	КонецЕсли;
	
	ЗаполнитьПолныеПутиВызоваМетодов(ИмяМодуля, Соответствие);
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции