// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

#Область ОбщегоНазначения

// Функция форматирует XML запрос в строковом виде для удобного чтения
//
// Параметры:
//	XMLТекст - Строка - XML запрос в строковом виде
//	ИспользоватьОтступы - Булево - по-умолчанию Ложь
// Возвращаемое значение:
//	Строка
Функция ОтформатироватьXMLЧерезDOM(XMLТекст, ИспользоватьОтступы = Ложь) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(XMLТекст);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку(Новый ПараметрыЗаписиXML(,, ИспользоватьОтступы, ИспользоватьОтступы));
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

// Функция возвращает строку, закодированную в base64.
// 
// Параметры:
//  ПодготовленнаяСтрока - Строка - Исходная строка, которую необходимо конвертировать в Base64
//  КодировкаТекста - Строка - Кодировка текста
// 
// Возвращаемое значение:
//  Строка - Зашифрованная строка в Base64
//
Функция ЗашифроватьBase64Сервер(ПодготовленнаяСтрока, КодировкаТекста = "UTF-8") Экспорт
	
	ДвоичныеДанныеСтроки = ПолучитьДвоичныеДанныеИзСтроки(ПодготовленнаяСтрока, КодировкаТекста);
	Base64Hash = ПолучитьBase64СтрокуИзДвоичныхДанных(ДвоичныеДанныеСтроки);
	
	Возврат Base64Hash;

КонецФункции

// Получает дату из UnixTime
//
// Параметры:
//  Секунд - Число - значение секунд в UnixTime
// 
// Возвращаемое значение:
//  Строка - строковое представление даты, полученное из UnixTime
//
Функция ДатаИзUnixTime(Знач Секунд) Экспорт
	
	Если Не ЗначениеЗаполнено(Секунд) Тогда
		Возврат '0001.01.01';
	ИначеЕсли ТипЗнч(Секунд) = Тип("Строка") Тогда
		Секунд = Число(Секунд);
	КонецЕсли;
	
	Дата = '1970.01.01' + Секунд;
	
	Возврат Дата;
	
КонецФункции

// Получить подробное представление ошибки исключения
//
// Параметры:
//  ЗаголовокОшибки		 - Строка - заголовок ошибки
//  ИнформацияОбОшибке	 - ИнформацияОбОшибке - информация об ошибке, полученная в исключении
// 
// Возвращаемое значение:
//  Строка - полное описание ошибки
//
Функция ПолучитьПодробноеПредставлениеОшибкиИсключения(ЗаголовокОшибки, ИнформацияОбОшибке) Экспорт
	
	ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	ПодробноеПредставление = СтрЗаменить(ПодробноеПредставление, "'", "");
	
	ПолноеОписаниеОшибки = СтрШаблон("ru = '%1. Подробно: %2';", ЗаголовокОшибки, ПодробноеПредставление);
	
	Возврат НСтр(ПолноеОписаниеОшибки);
	
КонецФункции

#КонецОбласти // ОбщегоНазначения

#Область МетодыИнтеграцийПоТипам

#Область ПрямоеПодключениеКБД

// Установить соединение с внешнем источником данных по настройке интеграции
//
// Параметры:
//  НастройкаИнтеграции - СправочникСсылка.пбп_НастройкиИнтеграции - настройки подключения к базе данных
//
Процедура УстановитьСоединениеСВнешнимИсточникомДанныхПоНастройкеИнтеграции(НастройкаИнтеграции) Экспорт
	
	СтруктураНастроек = пбп_ИнтеграцииСлужебный.ПолучитьСтруктуруНастроекИнтеграции(НастройкаИнтеграции);
	ИмяВнешнегоИсточникаДанных = СтруктураНастроек.ИмяОбъекта;
	
	ПараметрыСоединения = ВнешниеИсточникиДанных[ИмяВнешнегоИсточникаДанных].ПолучитьОбщиеПараметрыСоединения();
	ПараметрыСоединения.АутентификацияОС = Ложь;
	ПараметрыСоединения.АутентификацияСтандартная = Истина;
	ПараметрыСоединения.СтрокаСоединения = СтруктураНастроек.СтрокаПодключения;
	ПараметрыСоединения.СУБД = ПолучитьИмяСУБДВнешнегоИсточникаДанныхПоСтрокеСоединения(
		СтруктураНастроек.СтрокаПодключения);
	
	Если СтруктураНастроек.Свойство("Логин") Тогда
		ПараметрыСоединения.ИмяПользователя = СтруктураНастроек.Логин.Значение;
	Иначе
		ПараметрыСоединения.ИмяПользователя = "";
	КонецЕсли;
	
	Если СтруктураНастроек.Свойство("Пароль") Тогда
		ПараметрыСоединения.Пароль = СтруктураНастроек.Пароль.Значение;
	Иначе
		ПараметрыСоединения.Пароль = "";
	КонецЕсли;
	
	ВнешниеИсточникиДанных[ИмяВнешнегоИсточникаДанных].УстановитьОбщиеПараметрыСоединения(ПараметрыСоединения);
	
	ПользовательСсылка = пбп_Переадресация.ТекущийПользователь();
	ТекущийПользователь = пбп_Переадресация.НайтиПоСсылке(ПользовательСсылка);
	ВнешниеИсточникиДанных[ИмяВнешнегоИсточникаДанных].УстановитьПараметрыСоединенияПользователя(
		ТекущийПользователь.Имя, ПараметрыСоединения);
	ВнешниеИсточникиДанных[ИмяВнешнегоИсточникаДанных].УстановитьПараметрыСоединенияСеанса(ПараметрыСоединения);
	
	ВнешниеИсточникиДанных[ИмяВнешнегоИсточникаДанных].УстановитьСоединение();
	
КонецПроцедуры

// Возвращает пустую таблицу параметров запроса внешнего источника
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с инициализированными колонками, подготовленная под заполнение параметров запроса
//
Функция ИнициализироватьТаблицуПараметровЗапросаВнешнегоИсточника() Экспорт
	
	ТаблицаПараметров = Новый ТаблицаЗначений;
	ТаблицаПараметров.Колонки.Добавить("НаименованиеПоля");
	ТаблицаПараметров.Колонки.Добавить("Оператор");
	ТаблицаПараметров.Колонки.Добавить("Значение");
	
	Возврат ТаблицаПараметров;
	
КонецФункции

// Получает таблицу данных из внешнего источника посредством выполнения запроса по условиям
//
// Параметры:
//  ИнтеграционныйПоток	 - СправочникСсылка.пбп_ИнтеграционныеПотоки - ссылка на интеграционный поток
//  ПоляЗапроса			 - Строка - название полей таблицы, перечисленных через запятую
//  ПараметрыЗапроса	 - ТаблицаЗначения - колонками являются наименование поля запроса, по которому необходимо
//  установить условие, значение параметра запроса и оператор сравнения
//  КоличествоПервых	 - Число - количество первых строк выборки. Если не заполнено, то условия по ПЕРВЫЕ нет
//  СтруктураИстории	 - Структура - см. ПолучитьСтруктуруЗаписиИстории
// 
// Возвращаемое значение:
//  Строка, ТаблицаЗначений - таблица значений с данными, полученными из внешнего источника,
//  с типизированными колонками или строка с ошибкой
//
Функция ПолучитьТаблицуДанныхИзВнешнегоИсточникаПоУсловиям(ИнтеграционныйПоток,
	ПоляЗапроса = "", ПараметрыЗапроса = Неопределено, КоличествоПервых = 0, СтруктураИстории = Неопределено) Экспорт
	
	ЗаголовокОшибки = "Данные не были получены из внешнего источника данных";
	СообщениеОбОшибке = "";
	
	РеквизитыОбъекта = пбп_Переадресация.ЗначенияРеквизитовОбъекта(
		ИнтеграционныйПоток, "НастройкаИнтеграции.ИмяОбъекта, ТочкаВхода");
		
	Если Не ЗначениеЗаполнено(РеквизитыОбъекта.НастройкаИнтеграцииИмяОбъекта) Тогда
		ПолноеОписаниеОшибки = СтрШаблон("ru = '%1. Подробно: %2';", ЗаголовокОшибки,
			"в настройках интеграции не заполнено наименование внешнего источника данных");
		СообщениеОбОшибке = НСтр(ПолноеОписаниеОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитыОбъекта.ТочкаВхода) Тогда
		ПолноеОписаниеОшибки = СтрШаблон("ru = '%1. Подробно: %2';", ЗаголовокОшибки,
			"в интеграционном потоке не заполнено имя таблицы внешнего источника данных");
		СообщениеОбОшибке = НСтр(ПолноеОписаниеОшибки);
	КонецЕсли;
	
	Если Не ПустаяСтрока(СообщениеОбОшибке) Тогда
		Возврат СообщениеОбОшибке;
	КонецЕсли;
	
	Попытка
		ТаблицаВыборки = ИнициализироватьТаблицуЗначенийИзТаблицыВнешнегоИсточника(
			РеквизитыОбъекта.НастройкаИнтеграцииИмяОбъекта, РеквизитыОбъекта.ТочкаВхода, ПоляЗапроса);

		Запрос = Новый Запрос;

		ТекстЗапроса = "ВЫБРАТЬ
		|	&ПоляЗапроса
		|ИЗ
		|	ВнешнийИсточникДанных." + РеквизитыОбъекта.НастройкаИнтеграцииИмяОбъекта
			+ ".Таблица." + РеквизитыОбъекта.ТочкаВхода + " КАК Таблица";

		Если КоличествоПервых <> 0 Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ " + КоличествоПервых);
		КонецЕсли;

		Если Не ПустаяСтрока(ПоляЗапроса) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляЗапроса", ПоляЗапроса);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляЗапроса", "Таблица.*");
		КонецЕсли;

		УсловияЗапроса = "";
		
		// Установка предопределенных параметров запроса из интеграционного потока
		Для Каждого СтрокаПредопределенногоПараметра Из ИнтеграционныйПоток.ПараметрыВхода Цикл
			НуженПеренос = ?(ПустаяСтрока(УсловияЗапроса), "", "
			|	И ");
			УсловияЗапроса = УсловияЗапроса + СтрШаблон("%1Таблица.%2 = &%2",
				НуженПеренос, СтрокаПредопределенногоПараметра.Имя);
			
			Запрос.УстановитьПараметр(
				СтрокаПредопределенногоПараметра.Имя,
				СтрокаПредопределенногоПараметра.ЗначениеПоУмолчанию);
		КонецЦикла;
		
		// Установка опциональных параметров запроса
		Для Каждого КлючЗначениеОператор Из ПараметрыЗапроса Цикл
			НуженПеренос = ?(ПустаяСтрока(УсловияЗапроса), "", "
			|	И ");
			УсловияЗапроса = УсловияЗапроса + СтрШаблон("%1Таблица.%2 %3 &%2",
				НуженПеренос, КлючЗначениеОператор.НаименованиеПоля, КлючЗначениеОператор.Оператор);
			
			Запрос.УстановитьПараметр(КлючЗначениеОператор.НаименованиеПоля, КлючЗначениеОператор.Значение);
		КонецЦикла;

		Если Не ПустаяСтрока(УсловияЗапроса) Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|ГДЕ
			|	" + УсловияЗапроса;
		КонецЕсли;

		Запрос.Текст = ТекстЗапроса;
		
		Если СтруктураИстории <> Неопределено Тогда
			СтруктураИстории.ИсходящееСообщение = пбп_ИнтеграцииСлужебный
				.ПолучитьПредставлениеТекстЗапросаВнешнегоИсточникаДанных(Запрос);
			НачалоВызова = ТекущаяДатаСеанса();
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если СтруктураИстории <> Неопределено Тогда
			СтруктураИстории.ДлительностьВызова = ТекущаяДатаСеанса() - НачалоВызова;
		КонецЕсли;
		
		ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаВыборки.Добавить(), ВыборкаРезультатаЗапроса);
		КонецЦикла;
		
		Возврат ТаблицаВыборки;
	Исключение
		СообщениеОбОшибке = ПолучитьПодробноеПредставлениеОшибкиИсключения(ЗаголовокОшибки, ИнформацияОбОшибке());
	КонецПопытки;

	Возврат СообщениеОбОшибке;
	
КонецФункции

// Возвращает инициализированную таблицу значений из таблицы внешнего
// источника по метаданным с типизированными колонками
//
// Параметры:
//  ИмяВнешнегоИсточника - Строка - имя внешнего источника данных
//  ИмяТаблицы			 - Строка - имя таблицы внешнего источника данных
//  НеобходимыеПоля		 - Строка - название полей таблицы, перечисленных через запятую
// 
// Возвращаемое значение:
//  ТаблицаЗначений - пустая таблица значений с типизированными колонками
//
Функция ИнициализироватьТаблицуЗначенийИзТаблицыВнешнегоИсточника(
	ИмяВнешнегоИсточника, ИмяТаблицы, НеобходимыеПоля = "") Экспорт
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	МетаданныеИсточника = Метаданные.ВнешниеИсточникиДанных[ИмяВнешнегоИсточника];
	МетаданныеТаблицы = МетаданныеИсточника.Таблицы[ИмяТаблицы];
	
	МассивНужныхПолей = Новый Массив;
	Если Не ПустаяСтрока(НеобходимыеПоля) Тогда
		МассивНужныхПолей = пбп_ПереадресацияКлиентСервер.РазложитьСтрокуВМассивПодстрок(
			НеобходимыеПоля, ",", Истина, Истина);
	КонецЕсли;
	
	КоличествоНужныхПолей = МассивНужныхПолей.Количество();
	Для Каждого ПолеТаблицы Из МетаданныеТаблицы.Поля Цикл
		Если КоличествоНужныхПолей <> 0 И МассивНужныхПолей.Найти(ПолеТаблицы.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДанных.Колонки.Добавить(ПолеТаблицы.Имя, ПолеТаблицы.Тип);
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции

#КонецОбласти // ПрямоеПодключениеКБД

#Область REST

// Конвертирует тело HTTP-запроса из соответствия в строку
//
// Параметры:
//  ТелоЗапросаJSON - Структура, Соответствие - данные тела запроса
// 
// Возвращаемое значение:
//  Строка - тело HTTP-запроса
//
Функция ПолучитьЗапросТекстомИзСоответствияJSON(ТелоЗапросаJSON) Экспорт
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ТелоЗапросаJSON, НастройкиСериализации);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции

// Возвращает таблицу кодов ответа HTTP
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с данными соответствия кода значений HTTP и его описанием
//
Функция ПодготовитьТаблицуКодовОтветаHTTP() Экспорт
	
	РазрядностьКодОтвета = 3;
	ДлинаСтрокиОписания = 150;
	
	ТаблицаКодовОтвета = Новый ТаблицаЗначений;
	ТаблицаКодовОтвета.Колонки.Добавить("КодОтвета"			, пбп_Переадресация.ОписаниеТипаЧисло(РазрядностьКодОтвета));
	ТаблицаКодовОтвета.Колонки.Добавить("КраткоеОписание"	, пбп_Переадресация.ОписаниеТипаСтрока(ДлинаСтрокиОписания));
	
	// Успешные
	НоваяСтрока = ТаблицаКодовОтвета.Добавить();
	НоваяСтрока.КодОтвета		= 100;
	НоваяСтрока.КраткоеОписание	= РасшифровкаКодаСостоянияHTTP(НоваяСтрока.КодОтвета);
	
	НоваяСтрока = ТаблицаКодовОтвета.Добавить();
	НоваяСтрока.КодОтвета		= 200;
	НоваяСтрока.КраткоеОписание	= РасшифровкаКодаСостоянияHTTP(НоваяСтрока.КодОтвета);
	
	// Сообщения о перенаправлениях
	Для Инкремент = 0 По 8 Цикл
		НоваяСтрока = ТаблицаКодовОтвета.Добавить();
		
		НоваяСтрока.КодОтвета = Число("30" + Инкремент);
		НоваяСтрока.КраткоеОписание	= РасшифровкаКодаСостоянияHTTP(НоваяСтрока.КодОтвета);
	КонецЦикла;
	
	// Клиентские
	Для Инкремент = 0 По 17 Цикл
		НоваяСтрока = ТаблицаКодовОтвета.Добавить();
		
		Если Инкремент < 10 Тогда
			НоваяСтрока.КодОтвета = Число("40" + Инкремент);
		Иначе
			НоваяСтрока.КодОтвета = Число("4" + Инкремент);
		КонецЕсли;
		
		НоваяСтрока.КраткоеОписание	= РасшифровкаКодаСостоянияHTTP(НоваяСтрока.КодОтвета);
	КонецЦикла;
	
	НоваяСтрока = ТаблицаКодовОтвета.Добавить();
	НоваяСтрока.КодОтвета		= 429;
	НоваяСтрока.КраткоеОписание	= РасшифровкаКодаСостоянияHTTP(НоваяСтрока.КодОтвета);
	
	// Серверные
	Для Инкремент = 0 По 11 Цикл
		НоваяСтрока = ТаблицаКодовОтвета.Добавить();
		
		Если Инкремент < 10 Тогда
			НоваяСтрока.КодОтвета = Число("50" + Инкремент);
		Иначе
			НоваяСтрока.КодОтвета = Число("5" + Инкремент);
		КонецЕсли;
		
		НоваяСтрока.КраткоеОписание	= РасшифровкаКодаСостоянияHTTP(НоваяСтрока.КодОтвета);
	КонецЦикла;
	
	Возврат ТаблицаКодовОтвета;
	
КонецФункции

// Функция возвратает расшифровку под коду состояния HTTP-ответа
//
// Параметры:
//  КодСостояния - Число - код состояния HTTP-ответа
// 
// Возвращаемое значение:
//   - Строка - Расшифровка кода
//
Функция РасшифровкаКодаСостоянияHTTP(КодСостояния) Экспорт
	
	Если 100 <= КодСостояния И КодСостояния <= 299 Тогда
		Расшифровка = НСтр("ru = 'Успешно.'");
	ИначеЕсли КодСостояния = 300 Тогда // Multiple Choice
		Расшифровка = НСтр("ru = 'Запрос имеет более чем один из возможных ответов.'");
	ИначеЕсли КодСостояния = 301 Тогда // Moved Permanently
		Расшифровка = НСтр("ru = 'URI запрашиваемого ресурса был изменён.'");
	ИначеЕсли КодСостояния = 302 Тогда // Found
		Расшифровка = НСтр("ru = 'Запрошенный ресурс временно изменён.'");
	ИначеЕсли КодСостояния = 303 Тогда // See Other
		Расшифровка = НСтр("ru = 'Попробуйте получить запрашиваемый ресурс в другой URI с запросом GET.'");
	ИначеЕсли КодСостояния = 304 Тогда // Not Modified
		Расшифровка = НСтр("ru = 'Нет необходимости повторно передавать запрошенные ресурсы.'");
	ИначеЕсли КодСостояния = 305 Тогда // Use Proxy
		Расшифровка = НСтр("ru = 'Запрошенный ресурс должен быть доступен через прокси.'");
	ИначеЕсли КодСостояния = 306 Тогда // Switch Proxy
		Расшифровка = НСтр("ru = 'Последующие запросы должны использовать указанный прокси.'");
	ИначеЕсли КодСостояния = 307 Тогда // Temporary Redirect
		Расшифровка = НСтр("ru = 'Запрошенный ресурс временно перенаправлен на другой URL-адрес с тем же методом, который использовал предыдущий запрос.'");
	ИначеЕсли КодСостояния = 308 Тогда // Permanent Redirect
		Расшифровка = НСтр("ru = 'Запрошенный ресурс теперь постоянно находится в другом URI.'");
	ИначеЕсли КодСостояния = 400 Тогда // Bad Request
		Расшифровка = НСтр("ru = 'Запрос не может быть исполнен.'");
	ИначеЕсли КодСостояния = 401 Тогда // Unauthorized
		Расшифровка = НСтр("ru = 'Попытка авторизации на сервере была отклонена.'");
	ИначеЕсли КодСостояния = 402 Тогда // Payment Required
		Расшифровка = НСтр("ru = 'Требуется оплата.'");
	ИначеЕсли КодСостояния = 403 Тогда // Forbidden
		Расшифровка = НСтр("ru = 'К запрашиваемому ресурсу нет доступа.'");
	ИначеЕсли КодСостояния = 404 Тогда // Not Found
		Расшифровка = НСтр("ru = 'Запрашиваемый ресурс не существует на сервере.'");
	ИначеЕсли КодСостояния = 405 Тогда // Method Not Allowed
		Расшифровка = НСтр("ru = 'Метод запроса не поддерживается сервером.'");
	ИначеЕсли КодСостояния = 406 Тогда // Not Acceptable
		Расшифровка = НСтр("ru = 'Запрошенный формат данных не поддерживается сервером.'");
	ИначеЕсли КодСостояния = 407 Тогда // Proxy Authentication Required
		Расшифровка = НСтр("ru = 'Ошибка аутентификации на прокси-сервере'");
	ИначеЕсли КодСостояния = 408 Тогда // Request Timeout
		Расшифровка = НСтр("ru = 'Время ожидания сервером передачи от клиента истекло.'");
	ИначеЕсли КодСостояния = 409 Тогда // Conflict
		Расшифровка = НСтр("ru = 'Запрос не может быть выполнен из-за конфликтного обращения к ресурсу.'");
	ИначеЕсли КодСостояния = 410 Тогда // Gone
		Расшифровка = НСтр("ru = 'Ресурс на сервере был перемещен.'");
	ИначеЕсли КодСостояния = 411 Тогда // Length Required
		Расшифровка = НСтр("ru = 'Сервер требует указание ""Content-length."" в заголовке запроса.'");
	ИначеЕсли КодСостояния = 412 Тогда // Precondition Failed
		Расшифровка = НСтр("ru = 'Запрос не применим к ресурсу'");
	ИначеЕсли КодСостояния = 413 Тогда // Request Entity Too Large
		Расшифровка = НСтр("ru = 'Сервер отказывается обработать, слишком большой объем передаваемых данных.'");
	ИначеЕсли КодСостояния = 414 Тогда // Request-URL Too Long
		Расшифровка = НСтр("ru = 'Сервер отказывается обработать, слишком длинный URL.'");
	ИначеЕсли КодСостояния = 415 Тогда // Unsupported Media-Type
		Расшифровка = НСтр("ru = 'Сервер заметил, что часть запроса была сделана в неподдерживаемом формат'");
	ИначеЕсли КодСостояния = 416 Тогда // Requested Range Not Satisfiable
		Расшифровка = НСтр("ru = 'Часть запрашиваемого ресурса не может быть предоставлена'");
	ИначеЕсли КодСостояния = 417 Тогда // Expectation Failed
		Расшифровка = НСтр("ru = 'Сервер не может предоставить ответ на указанный запрос.'");
	ИначеЕсли КодСостояния = 429 Тогда // Too Many Requests
		Расшифровка = НСтр("ru = 'Слишком много запросов за короткое время.'");
	ИначеЕсли КодСостояния = 500 Тогда // Internal Server Error
		Расшифровка = НСтр("ru = 'Внутренняя ошибка сервера.'");
	ИначеЕсли КодСостояния = 501 Тогда // Not Implemented
		Расшифровка = НСтр("ru = 'Сервер не поддерживает метод запроса.'");
	ИначеЕсли КодСостояния = 502 Тогда // Bad Gateway
		Расшифровка = НСтр("ru = 'Сервер, выступая в роли шлюза или прокси-сервера, 
		                         |получил недействительное ответное сообщение от вышестоящего сервера.'");
	ИначеЕсли КодСостояния = 503 Тогда // Server Unavailable
		Расшифровка = НСтр("ru = 'Сервер временно не доступен.'");
	ИначеЕсли КодСостояния = 504 Тогда // Gateway Timeout
		Расшифровка = НСтр("ru = 'Сервер в роли шлюза или прокси-сервера 
		                         |не дождался ответа от вышестоящего сервера для завершения текущего запроса.'");
	ИначеЕсли КодСостояния = 505 Тогда // HTTP Version Not Supported
		Расшифровка = НСтр("ru = 'Сервер не поддерживает указанную в запросе версию протокола HTTP'");
	ИначеЕсли КодСостояния = 506 Тогда // Variant Also Negotiates
		Расшифровка = НСтр("ru = 'Сервер настроен некорректно, и не способен обработать запрос.'");
	ИначеЕсли КодСостояния = 507 Тогда // Insufficient Storage
		Расшифровка = НСтр("ru = 'На сервере недостаточно места для выполнения запроса.'");
	ИначеЕсли КодСостояния = 509 Тогда // Bandwidth Limit Exceeded
		Расшифровка = НСтр("ru = 'Сервер превысил отведенное ограничение на потребление трафика.'");
	ИначеЕсли КодСостояния = 510 Тогда // Not Extended
		Расшифровка = НСтр("ru = 'Сервер требует больше информации о совершаемом запросе.'");
	ИначеЕсли КодСостояния = 511 Тогда // Network Authentication Required
		Расшифровка = НСтр("ru = 'Требуется авторизация на сервере.'");
	Иначе 
		Расшифровка = НСтр("ru = '<Неизвестный код состояния>.'");
	КонецЕсли;
	
	Возврат пбп_ПереадресацияКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '[%1] %2'"), 
		КодСостояния, 
		Расшифровка);
	
КонецФункции

#КонецОбласти // REST

#Область FTP

// Выполнить подключение к FTP-серверу по настройке интеграции
// См. пбп_ИнтеграцииFTPSFTP.ВыполнитьПодключениеКFTPСерверуДляИнтеграционногоПотока.
//
Функция ВыполнитьПодключениеКFTPСерверуДляИнтеграционногоПотока(ИнтеграционныйПоток) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.ВыполнитьПодключениеКFTPСерверуДляИнтеграционногоПотока(ИнтеграционныйПоток);
	
КонецФункции

// Отправить сообщение FTP
// См. пбп_ИнтеграцииFTPSFTP.ОтправитьСообщениеFTP.
//
Функция ОтправитьСообщениеFTP(ПодключениеКFTP, ПараметрыСообщения) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.ОтправитьСообщениеFTP(ПодключениеКFTP, ПараметрыСообщения);
	
КонецФункции

// Прочитать сообщение FTP
// См. пбп_ИнтеграцииFTPSFTP.ПрочитатьСообщениеFTP.
//
Функция ПрочитатьСообщениеFTP(ПодключениеКFTP, ПараметрыСообщения) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.ПрочитатьСообщениеFTP(ПодключениеКFTP, ПараметрыСообщения);
	
КонецФункции

// Проверяет наличие файла на FTP
// См. пбп_ИнтеграцииFTPSFTP.ПроверитьФайлЕстьНаFTP.
//
Функция ПроверитьФайлЕстьНаFTP(FTPСоединение, ИмяФайла, КаталогПоиска = "/", ПоТочномуСовпадению = Истина) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.ПроверитьФайлЕстьНаFTP(FTPСоединение, ИмяФайла, КаталогПоиска, ПоТочномуСовпадению);
	
КонецФункции

#КонецОбласти // FTP

#Область SFTP

// Отправляет сообщение на SFTP-сервер.
// См. пбп_ИнтеграцииFTPSFTP.ОтправитьСообщениеSFTP.
//
Функция ОтправитьСообщениеSFTP(ИнтеграционныйПоток, ПараметрыСообщения, СтруктураИстории = Неопределено) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.ОтправитьСообщениеSFTP(ИнтеграционныйПоток, ПараметрыСообщения, СтруктураИстории);
	
КонецФункции

// Получает список файлов с каталога SFTP-сервера.
// См. пбп_ИнтеграцииFTPSFTP.ПолучитьСодержимоеКаталогаSFTP.
//
Функция ПолучитьСодержимоеКаталогаSFTP(ИнтеграционныйПоток, КаталогПоиска, СтруктураИстории = Неопределено) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.ПолучитьСодержимоеКаталогаSFTP(ИнтеграционныйПоток, КаталогПоиска, СтруктураИстории);
	
КонецФункции

// Проверяет наличие файла на SFTP
// См. пбп_ИнтеграцииFTPSFTP.ПроверитьФайлЕстьНаSFTP.
//
Функция ПроверитьФайлЕстьНаSFTP(ИнтеграционныйПоток,
	ИмяФайла, КаталогПоиска = "/", ПоТочномуСовпадению = Истина, СтруктураИстории = Неопределено) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.ПроверитьФайлЕстьНаSFTP(ИмяФайла,
		КаталогПоиска, ПоТочномуСовпадению, СтруктураИстории);
	
КонецФункции

// Получает сообщение с SFTP-сервера.
// См. пбп_ИнтеграцииFTPSFTP.ПрочитатьСообщениеSFTP.
//
Функция ПрочитатьСообщениеSFTP(ИнтеграционныйПоток, ПараметрыСообщения, СтруктураИстории = Неопределено) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.ПрочитатьСообщениеSFTP(ИнтеграционныйПоток, ПараметрыСообщения, СтруктураИстории);
	
КонецФункции

// Удаляет файл с SFTP-сервера.
// См. пбп_ИнтеграцииFTPSFTP.УдалитьФайлSFTP.
//
Функция УдалитьФайлSFTP(ИнтеграционныйПоток, ИмяФайла,
	КаталогФайла = "/", ПроверитьНаличиеПередУдалением = Истина, СтруктураИстории = Неопределено) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.УдалитьФайлSFTP(ИнтеграционныйПоток,
		ИмяФайла, КаталогФайла, ПроверитьНаличиеПередУдалением, СтруктураИстории);
	
КонецФункции

#КонецОбласти // SFTP

#Область КоманднаяСтрока

// Выполняет указанную команду системы интеграционного потока
//
// Параметры:
//  ИнтеграционныйПоток			 - СправочникСсылка.пбп_ИнтеграционныеПотоки - интеграционный поток, хранящий данные команды
//  СтруктураАтрибутов			 - Структура - ключ - наименование атрибута, значение - значение атрибута
//  СимволПараметра				 - Строка - символ инициализации параметра команды (по-умолчанию "/")
//  РазделительПараметраЗначения - Строка - символ разделителя между именем и значением параметра (по-умолчанию " ")
//  ПараметрыЗапускаКоманды		 - Структура - см. пбп_ФайловаяСистема.ПараметрыЗапускаПрограммы
//  СтруктураИстории			 - Структура - см. пбп_ИнтеграцииСлужебный.ПолучитьСтруктуруЗаписиИстории
// 
// Возвращаемое значение:
//  Число, Строка - см. пбп_ФайловаяСистема.ЗапуститьПрограмму
//
Функция ВыполнитьКомандуСистемы(ИнтеграционныйПоток, СтруктураАтрибутов,
	СимволПараметра = "/", РазделительПараметраЗначения = " ",
	ПараметрыЗапускаКоманды = Неопределено, СтруктураИстории = Неопределено) Экспорт
	
	РеквизитыПотока = пбп_Переадресация.ЗначенияРеквизитовОбъекта(
		ИнтеграционныйПоток, "НастройкаИнтеграции.ИнтегрируемаяСистема, НастройкаИнтеграции.СтрокаПодключения, ТочкаВхода");
	
	СтрокаАтрибутов = "";
	
	Для Каждого КлючИЗначение Из СтруктураАтрибутов Цикл
		Разделитель = ?(ПустаяСтрока(СтрокаАтрибутов), СимволПараметра, " " + СимволПараметра);
		СтрокаАтрибутов = СтрокаАтрибутов + Разделитель + КлючИЗначение.Ключ
			+ РазделительПараметраЗначения + """" + КлючИЗначение.Значение + """";
	КонецЦикла;
	
	ИтоговаяКоманда = СтрШаблон("%1 %2 %3", РеквизитыПотока.НастройкаИнтеграцииСтрокаПодключения,
		РеквизитыПотока.ТочкаВхода, СтрокаАтрибутов);
	
	Если ПараметрыЗапускаКоманды = Неопределено Тогда
		ПараметрыЗапускаКоманды = пбп_Переадресация.ПараметрыЗапускаПрограммы();
		ПараметрыЗапускаКоманды.ДождатьсяЗавершения = Истина;
	КонецЕсли;
	
	Если СтруктураИстории <> Неопределено Тогда
		НачалоВызова = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// BSLLS:ExternalAppStarting-off
	Результат = пбп_Переадресация.ЗапуститьПрограмму(ИтоговаяКоманда, ПараметрыЗапускаКоманды);
	// BSLLS:ExternalAppStarting-on
	
	Если СтруктураИстории <> Неопределено Тогда
		СтруктураИстории.ДлительностьВызова = ТекущаяДатаСеанса() - НачалоВызова;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти // КоманднаяСтрока

#КонецОбласти

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Получить имя СУБД внешнего источника данных по строке соединения
//
// Параметры:
//  СтрокаСоединения - Строка - строка соединения с базой данных
// 
// Возвращаемое значение:
//  Строка - тип СУБД (см. ПараметрыСоединенияВнешнегоИсточникаДанных)
//
Функция ПолучитьИмяСУБДВнешнегоИсточникаДанныхПоСтрокеСоединения(СтрокаСоединения)
	
	Если СтрНайти(СтрокаСоединения, "SQL Server") > 0 Тогда
		ИмяСУБД = "MSSQLServer";
	ИначеЕсли СтрНайти(СтрокаСоединения, "PostgreSQL") > 0 Тогда
		ИмяСУБД = "PostgreSQL";
	ИначеЕсли СтрНайти(СтрокаСоединения, "IBM DB2") > 0 Тогда
		ИмяСУБД = "IBMDB2";
	ИначеЕсли СтрНайти(СтрокаСоединения, "Oracle") > 0 Тогда
		ИмяСУБД = "OracleDatabase";
	ИначеЕсли СтрНайти(СтрокаСоединения, "MySQL") > 0 Тогда
		ИмяСУБД = "MySQL";
	Иначе
		ИмяСУБД = Неопределено;
	КонецЕсли;
	
	Возврат ИмяСУБД;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции