// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьСвойстваЭлементовФормы();
	
	КодПостобработки = 
	"// В переменной ""ТаблицаДанных"" находится таблица значений, с колонками и типами, перечисленными на закладке настройка колонок.
	|// Имена колонок таблицы соответствуют значениям из колонки ""Имя колонки (после преобразования)"".
	|// Типы колонок соответствуют значениям из колонки ""Тип значения"".
	|//
	|Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
	|
	|	// Напишите обработку строк таблицы данных
	|
	|КонецЦикла;";
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКакПриИзменении(Элемент)
	УстановитьСвойстваЭлементовФормы();
	
	ВыдаватьОшибкуПриОтсутствииЛиста = Истина;
	КонвертироватьДаты = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонВВидеПриИзменении(Элемент)
	УстановитьСвойстваЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПостобработкаПриИзменении(Элемент)
	УстановитьСвойстваЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок			= НСтр("ru = 'Выберите файл для загрузки'");
	Диалог.МножественныйВыбор	= Ложь;
	Диалог.Фильтр				= "Текстовый файл с разделителями (*.csv)|*.csv|Табличный документ Excel (*.xlsx)|*.xlsx";		Результат = Ждать Диалог.ВыбратьАсинх();		Если ЗначениеЗаполнено(Результат) Тогда		ПутьКФайлу = Результат[0];	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗагрузитьНастройки(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок			= НСтр("ru = 'Выберите файл для загрузки настроек'");
	Диалог.МножественныйВыбор	= Ложь;
	Диалог.Фильтр				= "Расширяемый язык разметки (*.xml)|*.xml";
	
	Результат = Ждать Диалог.ВыбратьАсинх();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(Результат[0]);
		АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, Новый УникальныйИдентификатор);
		ЗагрузитьНастройкиНаСервере(АдресФайлаВХранилище);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СохранитьНастройки(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок			= НСтр("ru = 'Выберите файл для сохранения настроек'");
	Диалог.МножественныйВыбор	= Ложь;
	Диалог.Фильтр				= "Расширяемый язык разметки (*.xml)|*.xml";
	
	Результат = Ждать Диалог.ВыбратьАсинх();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		АдресФайлаВХранилище = СохранитьНастройкиНаСервере();
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаВХранилище);
		ДвоичныеДанныеФайла.Записать(Результат[0]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьШаблон(Команда)
	Если ШаблонВМакет = 0 Тогда
		РезультатКод = ПолучитьШаблонКод();
	ИначеЕсли ШаблонВМакет = 1 Тогда
		СформироватьШаблонМакет();
	Иначе
		СформироватьШаблонОбработки();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьФункцию(Команда)
	
	ВыполнитьКодИлиФункцию(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКод(Команда)
	
	ВыполнитьКодИлиФункцию(Истина);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()
	
	Элементы.Постобработка.ТолькоПросмотр = Не пбп_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеКонстанты(
		"пбп_ИспользоватьПользовательскиеФункции");
	
	Элементы.ФункцияПостобработкиДанных.Видимость = ЭтоЗагрузка И ПостобработкаПользовательскойФункцией;
	Элементы.ГруппаКодПостобработки.Видимость = ЭтоЗагрузка И Не ПостобработкаПользовательскойФункцией;
	Элементы.ШаблонВМакет.Видимость = Не ЭтоЗагрузка;
	Элементы.ПутьКФайлу.Видимость = ЭтоЗагрузка;
	Элементы.НастройкаСтруктурыКолонокФайлаВыполнитьФункцию.Видимость = ЭтоЗагрузка;
	Элементы.НастройкаСтруктурыКолонокФайлаСформироватьШаблон.Видимость = Не ЭтоЗагрузка;
	Элементы.ГруппаПараметрыЧтенияФайла.Видимость = ЭтоЗагрузка;
	Элементы.Постобработка.Видимость = ЭтоЗагрузка;
	Элементы.ГруппаРезультатМодуль.Видимость = Не ЭтоЗагрузка И ШаблонВМакет = 0;
	Элементы.ГруппаРезультатМакет.Видимость = Не ЭтоЗагрузка И ШаблонВМакет = 1;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиНаСервере(АдресФайлаВХранилище)
	
	// BSLLS:MissingTemporaryFileDeletion-off
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	// BSLLS:MissingTemporaryFileDeletion-on
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВХранилище);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	НовоеЧтениеXML = Новый ЧтениеXML;
	// BSLLS:ExternalAppStarting-off
	НовоеЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
	// BSLLS:ExternalAppStarting-on
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип(ПолучитьИмяПространства(),
		ПолучитьСтруктуруТиповОбъектовXDTO()["Форма"]);
	СвойстваФормыXDTO = ФабрикаXDTO.ПрочитатьXML(НовоеЧтениеXML, ТипОбъектаXDTO);
	
	НовоеЧтениеXML.Закрыть();
	
	пбп_Переадресация.УдалитьВременныйФайл(ИмяВременногоФайла);
	
	Для Каждого РеквизитФормы Из ЭтотОбъект.ПолучитьРеквизиты() Цикл
		ИмяРеквизита = РеквизитФормы.Имя;
		Если СвойстваФормыXDTO.Свойства().Получить(ИмяРеквизита) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИмяРеквизита = "ФункцияПостобработкиДанных" Тогда
			ЭтотОбъект[ИмяРеквизита] = Справочники.пбп_ПользовательскиеФункции.ПолучитьСсылку(
				Новый УникальныйИдентификатор(СвойстваФормыXDTO[ИмяРеквизита]));
		ИначеЕсли РеквизитФормы.ТипЗначения = Новый ОписаниеТипов("ТаблицаЗначений") Тогда
			ЭтотОбъект[ИмяРеквизита].Очистить();
			ТаблицаЗначений = ЭтотОбъект[ИмяРеквизита].Выгрузить();
			КолонкиТаблицы = ТаблицаЗначений.Колонки;
			Если СвойстваФормыXDTO[ИмяРеквизита].Свойства().Получить("Строка") <> Неопределено Тогда
				Для Каждого СтрокаТаблицыXDTO Из СвойстваФормыXDTO[ИмяРеквизита].Строка Цикл
					СтрокаТаблицы = ЭтотОбъект[ИмяРеквизита].Добавить();
					
					Для Каждого КолонкаТаблицы Из КолонкиТаблицы Цикл
						ИмяКолонки = КолонкаТаблицы.Имя;
						Если СтрокаТаблицыXDTO.Свойства().Получить(ИмяКолонки) = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						
						Если ИмяКолонки = "ТипЗначения" Тогда
							СтрокаТаблицы[ИмяКолонки] = Новый ОписаниеТипов(СтрокаТаблицыXDTO[ИмяКолонки]);
						ИначеЕсли ИмяКолонки = "ФорматДаты" Тогда
							Если ЗначениеЗаполнено(СтрокаТаблицыXDTO[ИмяКолонки]) Тогда
								МассивФормата = пбп_ПереадресацияКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаТаблицыXDTO[ИмяКолонки], "_");
								Если МассивФормата.Количество() = 3 Тогда
									СтрокаТаблицы.ФорматДаты	= СтрШаблон("%1_%2", МассивФормата[0], МассивФормата[1]);
									СтрокаТаблицы.ЕстьВремя		= Число(МассивФормата[2]);
								КонецЕсли;
							КонецЕсли;
						Иначе
							СтрокаТаблицы[ИмяКолонки] = СтрокаТаблицыXDTO[ИмяКолонки];
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		Иначе
			ЭтотОбъект[ИмяРеквизита] = СвойстваФормыXDTO[ИмяРеквизита];
		КонецЕсли;
	КонецЦикла;
	
	УстановитьСвойстваЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Функция СохранитьНастройкиНаСервере()
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип(ПолучитьИмяПространства(),
		ПолучитьСтруктуруТиповОбъектовXDTO()["Форма"]);
	СвойстваФормыXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO);
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип(ПолучитьИмяПространства(),
		ПолучитьСтруктуруТиповОбъектовXDTO()["Таблица"]);
	ТаблицаXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO);
	ТипОбъектаXDTO = ФабрикаXDTO.Тип(ПолучитьИмяПространства(),
		ПолучитьСтруктуруТиповОбъектовXDTO()["СтрокаТаблицы"]);
	
	Для Каждого РеквизитФормы Из ЭтотОбъект.ПолучитьРеквизиты() Цикл
		ИмяРеквизита = РеквизитФормы.Имя;
		Если СвойстваФормыXDTO.Свойства().Получить(ИмяРеквизита) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИмяРеквизита = "ФункцияПостобработкиДанных" Тогда
			СвойстваФормыXDTO[ИмяРеквизита] = Строка(ЭтотОбъект[ИмяРеквизита].УникальныйИдентификатор());
		ИначеЕсли ИмяРеквизита = "КодПостобработки" Тогда
			СвойстваФормыXDTO[ИмяРеквизита] = ?(ЭтоЗагрузка
				И Не ПостобработкаПользовательскойФункцией,
				СвойстваФормыXDTO[ИмяРеквизита], "");
		ИначеЕсли РеквизитФормы.ТипЗначения = Новый ОписаниеТипов("ТаблицаЗначений") Тогда
			ТаблицаЗначений = ЭтотОбъект[ИмяРеквизита].Выгрузить();
			КолонкиТаблицы = ТаблицаЗначений.Колонки;
			
			Инкремент = 1;
			Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
				СтрокаТаблицыXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO);
				СтрокаТаблицыXDTO.НомерСтроки = Инкремент;
				
				Для Каждого КолонкаТаблицы Из КолонкиТаблицы Цикл
					ИмяКолонки = КолонкаТаблицы.Имя;
					Если СтрокаТаблицыXDTO.Свойства().Получить(ИмяКолонки) = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					Если ИмяКолонки = "ТипЗначения" Тогда
						СтрокаТаблицыXDTO[ИмяКолонки] = ПолучитьСтроковоеЗначениеТипа(СтрокаТаблицы[ИмяКолонки]);
					ИначеЕсли ИмяКолонки = "ФорматДаты" Тогда
						СтрокаТаблицыXDTO[ИмяКолонки] = ПолучитьФорматДаты(СтрокаТаблицы[ИмяКолонки], СтрокаТаблицы.ЕстьВремя);
					Иначе
						СтрокаТаблицыXDTO[ИмяКолонки] = СтрокаТаблицы[ИмяКолонки];
					КонецЕсли;
				КонецЦикла;
				
				Инкремент = Инкремент + 1;
				
				ТаблицаXDTO.Строка.Добавить(СтрокаТаблицыXDTO);
			КонецЦикла;
			
			СвойстваФормыXDTO[ИмяРеквизита] = ТаблицаXDTO;
		Иначе
			СвойстваФормыXDTO[ИмяРеквизита] = ЭтотОбъект[ИмяРеквизита];
		КонецЕсли;
	КонецЦикла;
	
	// BSLLS:MissingTemporaryFileDeletion-off
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	// BSLLS:MissingTemporaryFileDeletion-on
	
	НоваяЗаписьXML = Новый ЗаписьXML;
	// BSLLS:ExternalAppStarting-off
	НоваяЗаписьXML.ОткрытьФайл(ИмяВременногоФайла);
	// BSLLS:ExternalAppStarting-on
	
	ФабрикаXDTO.ЗаписатьXML(НоваяЗаписьXML, СвойстваФормыXDTO);
	
	НоваяЗаписьXML.Закрыть();
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	пбп_Переадресация.УдалитьВременныйФайл(ИмяВременногоФайла);
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции

&НаСервере
Процедура СформироватьШаблонМакет()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Макет = РеквизитОбъект.ПолучитьМакетСтруктурыКолонок();
	
	РезультатМакет.Очистить();
	
	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
	РезультатМакет.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
	Инкремент = 1;
	Для Каждого СтрокаТаблицы Из НастройкаСтруктурыКолонокФайла Цикл
		ОбластьСтрока.Параметры.Заполнить(СтрокаТаблицы);
		
		ОбластьСтрока.Параметры.ТипЗначения	= ПолучитьСтроковоеЗначениеТипа(СтрокаТаблицы.ТипЗначения);
		ОбластьСтрока.Параметры.ФорматДаты	= ПолучитьФорматДаты(СтрокаТаблицы.ФорматДаты, СтрокаТаблицы.ЕстьВремя);
		ОбластьСтрока.Параметры.Номер		= Инкремент;
		
		РезультатМакет.Вывести(ОбластьСтрока);
		
		Инкремент = Инкремент + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьШаблонКод()
	
	КодСтрока = "ТаблицаСвойств = пбп_ЗагрузкаФайлаЧерезТабличныйДокументСервер.ИнициализироватьТаблицуСоСвойствамиКолонок();";
	
	МассивНужныхКолонок = Новый Массив;
	ИменаНенужных = Новый Массив;
	ИменаНенужных.Добавить("ЕстьВремя");
	Для Каждого Колонка Из НастройкаСтруктурыКолонокФайла.Выгрузить().Колонки Цикл
		Если ИменаНенужных.Найти(Колонка.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивНужныхКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из НастройкаСтруктурыКолонокФайла Цикл
		КодСтрока = КодСтрока + Символы.ПС + Символы.ПС
			+ "НоваяСтрока = ТаблицаСвойств.Добавить();";
		
		Для Каждого ИмяКолонки Из МассивНужныхКолонок Цикл
			Если Не ЗначениеЗаполнено(СтрокаТаблицы[ИмяКолонки]) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ИмяКолонки = "ФорматДаты" Тогда
				ЗначениеКолонки = ПолучитьФорматДаты(СтрокаТаблицы[ИмяКолонки], СтрокаТаблицы.ЕстьВремя);
			ИначеЕсли ИмяКолонки = "ТипЗначения" Тогда
				ЗначениеКолонки = ПолучитьСтроковоеЗначениеТипа(СтрокаТаблицы[ИмяКолонки]);
			Иначе
				ЗначениеКолонки = СтрокаТаблицы[ИмяКолонки];
			КонецЕсли;
			
			КодСтрока = КодСтрока + Символы.ПС
				+ СтрШаблон("НоваяСтрока.%1 = ""%2"";", ИмяКолонки, ЗначениеКолонки);
		КонецЦикла;
	КонецЦикла;
	
	Возврат КодСтрока;
	
КонецФункции

&НаКлиенте
Процедура СформироватьШаблонОбработки()
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Действие", "ОбработкаЗагрузкиИзФайла");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СформироватьШаблонОбработкиПослеЗаполненияПараметров", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.пбп_ФормаПодключенияКБазе1С",
		ПараметрыОткрытия, ЭтотОбъект, Новый УникальныйИдентификатор, 
		, , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяПространства()
	
	Возврат "http://www.pssl-packages.org/forms-settings";
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруТиповОбъектовXDTO()
	
	СтруктураТипов = Новый Структура;
	СтруктураТипов.Вставить("Форма"			, "Exchange.UniversalFileDownloadFromTableFile");
	СтруктураТипов.Вставить("Таблица"		, "Exchange.UniversalFileDownloadFromTableFile.ColumnsSettings");
	СтруктураТипов.Вставить("СтрокаТаблицы"	, "Exchange.UniversalFileDownloadFromTableFile.ColumnsSettings.Row");
	
	Возврат СтруктураТипов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтроковоеЗначениеТипа(ОписаниеТипаЗначения)
	
	ТипыЗначения = ОписаниеТипаЗначения.Типы();
	Если Не ЗначениеЗаполнено(ТипыЗначения) Тогда
		Возврат "";
	КонецЕсли;
	
	ЗначениеТипа = ТипыЗначения[0];
	ЗначениеТипаСтрока = Строка(ЗначениеТипа);
	ЭтоСсылочныйТип = пбп_Переадресация.ЭтоСсылка(ЗначениеТипа);
	Если Не ЭтоСсылочныйТип Тогда
		Если ЗначениеТипаСтрока = "Число"
			Или ЗначениеТипаСтрока = "Строка"
			Или ЗначениеТипаСтрока = "Булево"
			Или ЗначениеТипаСтрока = "Дата" Тогда
			ТипСтрокой = ЗначениеТипаСтрока;
		Иначе
			ТипСтрокой = "";
		КонецЕсли;
	Иначе
		Префикс = "";
		МетаданныеОбъект = Метаданные.НайтиПоТипу(ЗначениеТипа);
		Если Метаданные.Справочники.Содержит(МетаданныеОбъект) Тогда
			Префикс = "СправочникСсылка";
		ИначеЕсли Метаданные.Документы.Содержит(МетаданныеОбъект) Тогда
			Префикс = "ДокументСсылка";
		ИначеЕсли Метаданные.Перечисления.Содержит(МетаданныеОбъект) Тогда
			Префикс = "ПеречислениеСсылка";
		ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеОбъект) Тогда
			Префикс = "ПланВидовХарактеристикСсылка";
		ИначеЕсли Метаданные.ПланыСчетов.Содержит(МетаданныеОбъект) Тогда
			Префикс = "ПланСчетовСсылка";
		Иначе
			Возврат "";
		КонецЕсли;
		
		ТипСтрокой = Префикс + "." + МетаданныеОбъект.Имя;
	КонецЕсли;
	
	Возврат ТипСтрокой;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьФорматДаты(ФорматДатыБезВремени, ФорматВремени)
	
	Если Не ЗначениеЗаполнено(ФорматДатыБезВремени) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ФорматДатыБезВремени = "0_0" Тогда
		ФорматДаты = "0_0_0";
	Иначе
		ФорматДаты = СтрШаблон("%1_%2", ФорматДатыБезВремени, ФорматВремени);
	КонецЕсли;
	
	Возврат ФорматДаты;
	
КонецФункции

&НаКлиенте
Асинх Процедура ВыполнитьКодИлиФункцию(ПроизвольныйКод)
	
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		СообщениеПользователю = НСтр("ru = 'Файл для загрузки не выбран';");
		пбп_ПереадресацияКлиент.СообщитьПользователю(СообщениеПользователю, , "ПутьКФайлу");
		Возврат;
	КонецЕсли;
	
	Если ПостобработкаПользовательскойФункцией И Не ЗначениеЗаполнено(ФункцияПостобработкиДанных) Тогда
		СообщениеПользователю = НСтр("ru = 'Функция постобработки данных не выбрана';");
		пбп_ПереадресацияКлиент.СообщитьПользователю(СообщениеПользователю, , "ФункцияПостобработкиДанных");
		Возврат;
	КонецЕсли;
	
	Если Не ПостобработкаПользовательскойФункцией И Не ЗначениеЗаполнено(КодПостобработки) Тогда
		СообщениеПользователю = НСтр("ru = 'Код постобработки не написан';");
		пбп_ПереадресацияКлиент.СообщитьПользователю(СообщениеПользователю, , "КодПостобработки");
		Возврат;
	КонецЕсли;
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх( , , , ПутьКФайлу, УникальныйИдентификатор);
	
	Если ТипЗнч(ОписаниеФайла) = Тип("ОписаниеПомещенногоФайла") И Не ОписаниеФайла.ПомещениеФайлаОтменено Тогда
		ВыполнитьКодИлиФункциюНаСервере(ОписаниеФайла.Адрес, ОписаниеФайла.СсылкаНаФайл.Расширение, ПроизвольныйКод);
	Иначе
		пбп_ПереадресацияКлиент.СообщитьПользователю(НСтр("ru = 'Помещение файла отменено'"));
		АдресПомещения = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКодИлиФункциюНаСервере(АдресВХранилище, Расширение, ПроизвольныйКод)
	
	Попытка
		ПараметрыЧтения = ПолучитьПараметрыЧтенияФайла();
		ТаблицаСвойств = КонвертироватьТаблицуСвойствКолонок();
		
		ТаблицаДанных = пбп_ЗагрузкаФайлаЧерезТабличныйДокументСервер
			.КонвертироватьДанныеТабличногоДокументаВТаблицуЗначений(
			АдресВХранилище, Расширение, ТаблицаСвойств, ПараметрыЧтения);
		
		пбп_ЗагрузкаФайлаЧерезТабличныйДокументСервер.ТаблицаЗначенийБезNull(ТаблицаДанных);
		
		Если ПроизвольныйКод Тогда
			УстановитьБезопасныйРежим(Истина);
			
			Попытка
				Выполнить(КодПостобработки);
			Исключение
				ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
		Иначе
			ПараметрыФункции = Новый Структура;
			ПараметрыФункции.Вставить("ТаблицаДанных", ТаблицаДанных);
			
			пбп_ОбщегоНазначенияСервер.ВыполнитьПользовательскуюФункциюСПараметрами(
				ФункцияПостобработкиДанных, ПараметрыФункции);
		КонецЕсли;
	Исключение
		ТекстОповещения = СтрШаблон("ru = 'Загрузка прервана по причине: %1'",
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		пбп_Переадресация.СообщитьПользователю(НСтр(ТекстОповещения));
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыЧтенияФайла()
	
	ПараметрыЧтения = пбп_ЗагрузкаФайлаЧерезТабличныйДокументСервер.ПолучитьПараметрыЧтенияФайла();
	ПараметрыЧтения.НазваниеЛиста						= НазваниеЛиста;
	ПараметрыЧтения.НомерСтроки							= НачальныйНомерСтроки;
	ПараметрыЧтения.СопоставлениеПоНаименованию			= СопоставлениеПоНаименованию;
	ПараметрыЧтения.КонвертироватьДаты					= КонвертироватьДаты;
	ПараметрыЧтения.ВыдаватьОшибкуПриОтсутствииЛиста	= ВыдаватьОшибкуПриОтсутствииЛиста;
	ПараметрыЧтения.ЗначениеИстина						= ЗначениеИстина;
	ПараметрыЧтения.ОставитьСтроковыеЗначения			= Ложь;
	ПараметрыЧтения.ИскатьПомеченныеНаУдаление			= ИскатьПомеченныеНаУдаление;
	
	Возврат ПараметрыЧтения;
	
КонецФункции

&НаСервере
Функция КонвертироватьТаблицуСвойствКолонок()
	
	ТаблицаСвойств = пбп_ЗагрузкаФайлаЧерезТабличныйДокументСервер.ИнициализироватьТаблицуСоСвойствамиКолонок();
	Для Каждого СтрокаТаблицы Из НастройкаСтруктурыКолонокФайла Цикл
		НоваяСтрока = ТаблицаСвойств.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, , "ТипЗначения, ФорматДаты");
		
		НоваяСтрока.ТипЗначения = ПолучитьСтроковоеЗначениеТипа(СтрокаТаблицы.ТипЗначения);
		НоваяСтрока.ФорматДаты = ПолучитьФорматДаты(СтрокаТаблицы.ФорматДаты, СтрокаТаблицы.ЕстьВремя);
	КонецЦикла;
	
	Возврат ТаблицаСвойств;
	
КонецФункции

&НаКлиенте
Асинх Процедура СформироватьШаблонОбработкиПослеЗаполненияПараметров(
	Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КаталогВременныхФайлов = Ждать КаталогВременныхФайловАсинх();
	
	Если ЗначениеЗаполнено(КаталогВременныхФайлов) Тогда
		АдресХранилища = СформироватьШаблонОбработкиПослеЗаполненияПараметровНаСервере(
			Результат, КаталогВременныхФайлов);
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
		ДвоичныеДанные.Записать(Результат.ПутьКФайлу);
		
		пбп_ПереадресацияКлиент.СообщитьПользователю(НСтр("ru = 'Файл обработки успешно создан по указанному пути'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьШаблонОбработкиПослеЗаполненияПараметровНаСервере(
	ПараметрыСохранения, КаталогВременныхФайлов)
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	АрхивШаблонаМакет = РеквизитОбъект.ПолучитьМакетШаблонаВнешнейОбработки();
	
	// BSLLS:MissingTemporaryFileDeletion-off
	ИмяФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
	// BSLLS:MissingTemporaryFileDeletion-on
	АрхивШаблонаМакет.Записать(ИмяФайлаАрхива);
	
	КаталогДляАрхива = КаталогВременныхФайлов
		+ "КаталогСохраненияОбработкиЗагрузки" + ПолучитьРазделительПути();
	
	ЧтениеZip = Новый ЧтениеZipФайла(ИмяФайлаАрхива);
	ЧтениеZip.ИзвлечьВсе(КаталогДляАрхива);
	ЧтениеZip.Закрыть();
	
	пбп_Переадресация.УдалитьВременныйФайл(ИмяФайлаАрхива);
	
	ИмяОбработки = "пбп_ЗагрузкаИзФайлаЧерезТабличныйДокумент";
	ОтносительныйПутьКМодулюФормы = ИмяОбработки + "\Forms\Форма\Ext\Form\Module.bsl";
	СтрокаЗамены = "// Описание структуры колонок";
	ПутьКФайлуМодуля = КаталогДляАрхива + ОтносительныйПутьКМодулюФормы;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ПутьКФайлуМодуля);
	КоличествоСтрок = ТекстовыйДокумент.КоличествоСтрок();
	НомерНужнойСтроки = 0;
	Для Инкремент = 1 По КоличествоСтрок Цикл
		Строка = ТекстовыйДокумент.ПолучитьСтроку(Инкремент);
		Если СтрНайти(Строка, СтрокаЗамены) <> 0 Тогда
			НомерНужнойСтроки = Инкремент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	КодБезТабуляции = ПолучитьШаблонКод();
	КодБезТабуляции = СтрЗаменить(КодБезТабуляции, Символы.ПС, Символы.ПС + Символы.Таб);
	ТекстовыйДокумент.ЗаменитьСтроку(НомерНужнойСтроки, Символы.Таб + КодБезТабуляции);
	
	ТекстовыйДокумент.Записать(ПутьКФайлуМодуля);
	
	// BSLLS:MissingTemporaryFileDeletion-off
	ИмяВременногоФайлаНовый = ПолучитьИмяВременногоФайла("epf");
	// BSLLS:MissingTemporaryFileDeletion-on
	
	Если ПараметрыСохранения.ФайловаяБаза Тогда
		АргументыПодключения = СтрШаблон("/F ""%1""", ПараметрыСохранения.КаталогИнформационнойБазы);
	Иначе
		АргументыПодключения = СтрШаблон("/S %1\%2",
			ПараметрыСохранения.КластерСерверов, ПараметрыСохранения.ИмяИнформационнойБазы);
	КонецЕсли;
	
	Если ПараметрыСохранения.Пароль = "" Тогда
		АргументыАутентификации = СтрШаблон("/N %1", ПараметрыСохранения.ИмяПользователя);
	Иначе
		АргументыАутентификации = СтрШаблон("/N %1 /P %2", ПараметрыСохранения.ИмяПользователя, ПараметрыСохранения.Пароль);
	КонецЕсли;
	
	КомандаЗагрузкиОбработки = СтрШаблон("1cv8.exe DESIGNER %1 %2 /DisableStartupMessages /DisableStartupDialogs /LoadExternalDataProcessorOrReportFromFiles ""%3"" ""%4""",
		АргументыПодключения, АргументыАутентификации, КаталогДляАрхива + ИмяОбработки + ".xml", ИмяВременногоФайлаНовый);
	
	ПараметрыЗапуска = пбп_Переадресация.ПараметрыЗапускаПрограммы();
	ПараметрыЗапуска.ТекущийКаталог = КаталогПрограммы();
	ПараметрыЗапуска.ДождатьсяЗавершения = Истина;
	
	// BSLLS:ExternalAppStarting-off
	пбп_Переадресация.ЗапуститьПрограмму(КомандаЗагрузкиОбработки, ПараметрыЗапуска);
	// BSLLS:ExternalAppStarting-on
	
	ДвоичныеДанныеОбработки = Новый ДвоичныеДанные(ИмяВременногоФайлаНовый);
	
	ПапкаСФайлами = Новый Файл(КаталогДляАрхива);
	Если ПапкаСФайлами.Существует() И ПапкаСФайлами.ЭтоКаталог() Тогда
		УдалитьФайлы(КаталогДляАрхива);
	КонецЕсли;
	
	пбп_Переадресация.УдалитьВременныйФайл(ИмяВременногоФайлаНовый);
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанныеОбработки);
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции