// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	пбп_ПодключаемыеКоманды.ДобавитьСохранениеЗагрузкуНастроекНаФорму(ЭтотОбъект);
	
	УстановитьСвойстваЭлементовФормы();
	
	КодПостобработки = 
	"// В переменной ""ТаблицаДанных"" находится таблица значений, с колонками и типами, перечисленными на закладке настройка колонок.
	|// Имена колонок таблицы соответствуют значениям из колонки ""Имя колонки (после преобразования)"".
	|// Типы колонок соответствуют значениям из колонки ""Тип значения"".
	|//
	|Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
	|
	|	// Напишите обработку строк таблицы данных
	|
	|КонецЦикла;";
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКакПриИзменении(Элемент)
	УстановитьСвойстваЭлементовФормы();
	
	ВыдаватьОшибкуПриОтсутствииЛиста = Истина;
	КонвертироватьДаты = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонВВидеПриИзменении(Элемент)
	УстановитьСвойстваЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПостобработкаПриИзменении(Элемент)
	УстановитьСвойстваЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок			= НСтр("ru = 'Выберите файл для загрузки'");
	Диалог.МножественныйВыбор	= Ложь;
	Диалог.Фильтр				= "Текстовый файл с разделителями (*.csv)|*.csv|Табличный документ Excel (*.xlsx)|*.xlsx";
	
	Результат = Ждать Диалог.ВыбратьАсинх();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ПутьКФайлу = Результат[0];
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ЗагрузитьНастройки(Команда)
	
	пбп_ПодключаемыеКомандыКлиент.ЗагрузитьНастройкиФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПослеЗагрузкиНастроек(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	УстановитьСвойстваЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СохранитьНастройки(Команда)
	
	пбп_ПодключаемыеКомандыКлиент.СохранитьНастройкиФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти // ПодключаемыеКоманды

&НаКлиенте
Процедура СформироватьШаблон(Команда)
	Если ШаблонВМакет = 0 Тогда
		РезультатКод = ПолучитьШаблонКод();
	ИначеЕсли ШаблонВМакет = 1 Тогда
		СформироватьШаблонМакет();
	Иначе
		#Если ВебКлиент Тогда
		ВызватьИсключение НСтр("ru = 'Создание внешней обработки не предназначено для веб-клиента'");
		#КонецЕсли
		
		СформироватьШаблонОбработки();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьФункцию(Команда)
	
	ВыполнитьКодИлиФункцию(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКод(Команда)
	
	ВыполнитьКодИлиФункцию(Истина);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()
	
	Элементы.Постобработка.ТолькоПросмотр = Не пбп_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеКонстанты(
		"пбп_ИспользоватьПользовательскиеФункции");
	
	Элементы.ФункцияПостобработкиДанных.Видимость = ЭтоЗагрузка И ПостобработкаПользовательскойФункцией;
	Элементы.ГруппаКодПостобработки.Видимость = ЭтоЗагрузка И Не ПостобработкаПользовательскойФункцией;
	Элементы.ШаблонВМакет.Видимость = Не ЭтоЗагрузка;
	Элементы.ПутьКФайлу.Видимость = ЭтоЗагрузка;
	Элементы.НастройкаСтруктурыКолонокФайлаВыполнитьФункцию.Видимость = ЭтоЗагрузка;
	Элементы.НастройкаСтруктурыКолонокФайлаСформироватьШаблон.Видимость = Не ЭтоЗагрузка;
	Элементы.ГруппаПараметрыЧтенияФайла.Видимость = ЭтоЗагрузка;
	Элементы.Постобработка.Видимость = ЭтоЗагрузка;
	Элементы.ГруппаРезультатМодуль.Видимость = Не ЭтоЗагрузка И ШаблонВМакет = 0;
	Элементы.ГруппаРезультатМакет.Видимость = Не ЭтоЗагрузка И ШаблонВМакет = 1;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьШаблонМакет()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Макет = РеквизитОбъект.ПолучитьМакетСтруктурыКолонок();
	
	РезультатМакет.Очистить();
	
	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
	РезультатМакет.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
	Инкремент = 1;
	Для Каждого СтрокаТаблицы Из НастройкаСтруктурыКолонокФайла Цикл
		ОбластьСтрока.Параметры.Заполнить(СтрокаТаблицы);
		
		ОбластьСтрока.Параметры.ТипЗначения	= пбп_Переадресация.СтроковоеПредставлениеТипа(
			СтрокаТаблицы.ТипЗначения.Типы()[0]);
		ОбластьСтрока.Параметры.ФорматДаты	=  пбп_ПодключаемыеКомандыСлужебныйКлиентСервер
			.ПолучитьФорматДаты(СтрокаТаблицы.ФорматДаты, СтрокаТаблицы.ЕстьВремя);
		ОбластьСтрока.Параметры.Номер		= Инкремент;
		
		РезультатМакет.Вывести(ОбластьСтрока);
		
		Инкремент = Инкремент + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьШаблонКод()
	
	КодСтрока = "ТаблицаСвойств = пбп_ЗагрузкаФайлаЧерезТабличныйДокументСервер.ИнициализироватьТаблицуСоСвойствамиКолонок();";
	
	МассивНужныхКолонок = Новый Массив;
	ИменаНенужных = Новый Массив;
	ИменаНенужных.Добавить("ЕстьВремя");
	Для Каждого Колонка Из НастройкаСтруктурыКолонокФайла.Выгрузить().Колонки Цикл
		Если ИменаНенужных.Найти(Колонка.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивНужныхКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из НастройкаСтруктурыКолонокФайла Цикл
		КодСтрока = КодСтрока + Символы.ПС + Символы.ПС
			+ "НоваяСтрока = ТаблицаСвойств.Добавить();";
		
		Для Каждого ИмяКолонки Из МассивНужныхКолонок Цикл
			Если Не ЗначениеЗаполнено(СтрокаТаблицы[ИмяКолонки]) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ИмяКолонки = "ФорматДаты" Тогда
				ЗначениеКолонки = пбп_ПодключаемыеКомандыСлужебныйКлиентСервер
					.ПолучитьФорматДаты(СтрокаТаблицы[ИмяКолонки], СтрокаТаблицы.ЕстьВремя);
			ИначеЕсли ИмяКолонки = "ТипЗначения" Тогда
				ЗначениеКолонки = пбп_Переадресация.СтроковоеПредставлениеТипа(
					СтрокаТаблицы[ИмяКолонки].Типы()[0]);
			Иначе
				ЗначениеКолонки = СтрокаТаблицы[ИмяКолонки];
			КонецЕсли;
			
			КодСтрока = КодСтрока + Символы.ПС
				+ СтрШаблон("НоваяСтрока.%1 = ""%2"";", ИмяКолонки, ЗначениеКолонки);
		КонецЦикла;
	КонецЦикла;
	
	Возврат КодСтрока;
	
КонецФункции

&НаКлиенте
Процедура СформироватьШаблонОбработки()
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Действие", "ОбработкаЗагрузкиИзФайла");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СформироватьШаблонОбработкиПослеЗаполненияПараметров", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.пбп_ФормаПодключенияКБазе1С",
		ПараметрыОткрытия, ЭтотОбъект, Новый УникальныйИдентификатор, 
		, , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыполнитьКодИлиФункцию(ПроизвольныйКод)
	
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		СообщениеПользователю = НСтр("ru = 'Файл для загрузки не выбран';");
		пбп_ПереадресацияКлиент.СообщитьПользователю(СообщениеПользователю, , "ПутьКФайлу");
		Возврат;
	КонецЕсли;
	
	Если ПостобработкаПользовательскойФункцией И Не ЗначениеЗаполнено(ФункцияПостобработкиДанных) Тогда
		СообщениеПользователю = НСтр("ru = 'Функция постобработки данных не выбрана';");
		пбп_ПереадресацияКлиент.СообщитьПользователю(СообщениеПользователю, , "ФункцияПостобработкиДанных");
		Возврат;
	КонецЕсли;
	
	Если Не ПостобработкаПользовательскойФункцией И Не ЗначениеЗаполнено(КодПостобработки) Тогда
		СообщениеПользователю = НСтр("ru = 'Код постобработки не написан';");
		пбп_ПереадресацияКлиент.СообщитьПользователю(СообщениеПользователю, , "КодПостобработки");
		Возврат;
	КонецЕсли;
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх( , , , ПутьКФайлу, УникальныйИдентификатор);
	
	Если ТипЗнч(ОписаниеФайла) = Тип("ОписаниеПомещенногоФайла") И Не ОписаниеФайла.ПомещениеФайлаОтменено Тогда
		ВыполнитьКодИлиФункциюНаСервере(ОписаниеФайла.Адрес, ОписаниеФайла.СсылкаНаФайл.Расширение, ПроизвольныйКод);
	Иначе
		пбп_ПереадресацияКлиент.СообщитьПользователю(НСтр("ru = 'Помещение файла отменено'"));
		АдресПомещения = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКодИлиФункциюНаСервере(АдресВХранилище, Расширение, ПроизвольныйКод)
	
	Попытка
		ПараметрыЧтения = ПолучитьПараметрыЧтенияФайла();
		ТаблицаСвойств = КонвертироватьТаблицуСвойствКолонок();
		
		ТаблицаДанных = пбп_ЗагрузкаФайлаЧерезТабличныйДокументСервер
			.КонвертироватьДанныеТабличногоДокументаВТаблицуЗначений(
			АдресВХранилище, Расширение, ТаблицаСвойств, ПараметрыЧтения);
		
		пбп_ЗагрузкаФайлаЧерезТабличныйДокументСервер.ТаблицаЗначенийБезNull(ТаблицаДанных);
		
		Если ПроизвольныйКод Тогда
			УстановитьБезопасныйРежим(Истина);
			
			Попытка
				// BSLLS:ExecuteExternalCode-off
				Выполнить КодПостобработки;
				// BSLLS:ExecuteExternalCode-on
			Исключение
				ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
		Иначе
			ПараметрыФункции = Новый Структура;
			ПараметрыФункции.Вставить("ТаблицаДанных", ТаблицаДанных);
			
			пбп_ОбщегоНазначенияСервер.ВыполнитьПользовательскуюФункциюСПараметрами(
				ФункцияПостобработкиДанных, ПараметрыФункции);
		КонецЕсли;
	Исключение
		ТекстОповещения = СтрШаблон("ru = 'Загрузка прервана по причине: %1'",
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		пбп_Переадресация.СообщитьПользователю(НСтр(ТекстОповещения));
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыЧтенияФайла()
	
	ПараметрыЧтения = пбп_ЗагрузкаФайлаЧерезТабличныйДокументСервер.ПолучитьПараметрыЧтенияФайла();
	ПараметрыЧтения.НазваниеЛиста						= НазваниеЛиста;
	ПараметрыЧтения.НомерСтроки							= НачальныйНомерСтроки;
	ПараметрыЧтения.СопоставлениеПоНаименованию			= СопоставлениеПоНаименованию;
	ПараметрыЧтения.КонвертироватьДаты					= КонвертироватьДаты;
	ПараметрыЧтения.ВыдаватьОшибкуПриОтсутствииЛиста	= ВыдаватьОшибкуПриОтсутствииЛиста;
	ПараметрыЧтения.ЗначениеИстина						= ЗначениеИстина;
	ПараметрыЧтения.ОставитьСтроковыеЗначения			= Ложь;
	ПараметрыЧтения.ИскатьПомеченныеНаУдаление			= ИскатьПомеченныеНаУдаление;
	
	Возврат ПараметрыЧтения;
	
КонецФункции

&НаСервере
Функция КонвертироватьТаблицуСвойствКолонок()
	
	ТаблицаСвойств = пбп_ЗагрузкаФайлаЧерезТабличныйДокументСервер.ИнициализироватьТаблицуСоСвойствамиКолонок();
	Для Каждого СтрокаТаблицы Из НастройкаСтруктурыКолонокФайла Цикл
		НоваяСтрока = ТаблицаСвойств.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, , "ТипЗначения, ФорматДаты");
		
		НоваяСтрока.ТипЗначения = пбп_Переадресация
			.СтроковоеПредставлениеТипа(СтрокаТаблицы.ТипЗначения.Типы()[0]);
		НоваяСтрока.ФорматДаты = пбп_ПодключаемыеКомандыСлужебныйКлиентСервер
			.ПолучитьФорматДаты(СтрокаТаблицы.ФорматДаты, СтрокаТаблицы.ЕстьВремя);
	КонецЦикла;
	
	Возврат ТаблицаСвойств;
	
КонецФункции

&НаКлиенте
Асинх Процедура СформироватьШаблонОбработкиПослеЗаполненияПараметров(
	ПараметрыСохранения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ПараметрыСохранения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КаталогВременныхФайлов = Ждать КаталогВременныхФайловАсинх();
	
	Если ЗначениеЗаполнено(КаталогВременныхФайлов) Тогда
		КаталогДляАрхива = ПолучитьИмяФайлаРаспакованногоАрхиваОбработки(КаталогВременныхФайлов);
		
		ИмяОбработки = "пбп_ЗагрузкаИзФайлаЧерезТабличныйДокумент";
		ОтносительныйПутьКМодулюФормы = ИмяОбработки + "\Forms\Форма\Ext\Form\Module.bsl";
		
		ПутьКФайлуМодуля = КаталогДляАрхива + ОтносительныйПутьКМодулюФормы;
		Результат = Ждать ПодменитьТекстВФайлеШаблона(ПутьКФайлуМодуля);
		Если Результат = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		АдресОбработкиВХранилище = Ждать ПолучитьКодКНовойОбработкеЗагрузки(ПараметрыСохранения,
			КаталогВременныхФайлов, КаталогДляАрхива, ИмяОбработки);
		
		Если АдресОбработкиВХранилище = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ДвоичныеДанныеОбработки = ПолучитьИзВременногоХранилища(АдресОбработкиВХранилище);
		ДвоичныеДанныеОбработки.Записать(ПараметрыСохранения.ПутьКФайлу);
		
		пбп_ПереадресацияКлиент.СообщитьПользователю(НСтр("ru = 'Файл обработки успешно создан по указанному пути'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяФайлаРаспакованногоАрхиваОбработки(КаталогВременныхФайлов)
	
	АрхивШаблонаМакет = ПолучитьМакетШаблонаОбработки();
	
	// BSLLS:MissingTemporaryFileDeletion-off
	#Если ВебКлиент Тогда
		ИмяФайлаАрхива = КаталогВременныхФайлов + Строка(Новый УникальныйИдентификатор);
	#Иначе
		ИмяФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
	#КонецЕсли
	// BSLLS:MissingTemporaryFileDeletion-on
	
	АрхивШаблонаМакет.Записать(ИмяФайлаАрхива);
	
	КаталогДляАрхива = КаталогВременныхФайлов
		+ "КаталогСохраненияОбработкиЗагрузки" + ПолучитьРазделительПути();
	
	ЧтениеZip = Новый ЧтениеZipФайла(ИмяФайлаАрхива);
	ЧтениеZip.ИзвлечьВсе(КаталогДляАрхива);
	ЧтениеZip.Закрыть();
	
	УдалитьФайлыНаКлиенте(ИмяФайлаАрхива);
	
	Возврат КаталогДляАрхива;
	
КонецФункции

&НаСервере
Функция ПолучитьМакетШаблонаОбработки()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	АрхивШаблонаМакет = РеквизитОбъект.ПолучитьМакетШаблонаВнешнейОбработки();
	
	Возврат АрхивШаблонаМакет;
	
КонецФункции

&НаКлиенте
Асинх Функция ПодменитьТекстВФайлеШаблона(ПутьКФайлуМодуля)
	
	СтрокаЗамены = "// Описание структуры колонок";
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	Попытка
		Результат = Ждать ТекстовыйДокумент.ПрочитатьАсинх(ПутьКФайлуМодуля);
		КоличествоСтрок = ТекстовыйДокумент.КоличествоСтрок();
		НомерНужнойСтроки = 0;
		Для Инкремент = 1 По КоличествоСтрок Цикл
			Строка = ТекстовыйДокумент.ПолучитьСтроку(Инкремент);
			Если СтрНайти(Строка, СтрокаЗамены) <> 0 Тогда
				НомерНужнойСтроки = Инкремент;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		КодБезТабуляции = ПолучитьШаблонКод();
		КодБезТабуляции = СтрЗаменить(КодБезТабуляции, Символы.ПС, Символы.ПС + Символы.Таб);
		ТекстовыйДокумент.ЗаменитьСтроку(НомерНужнойСтроки, Символы.Таб + КодБезТабуляции);
		
		Возврат Ждать ТекстовыйДокумент.ЗаписатьАсинх(ПутьКФайлуМодуля);
	Исключение
		пбп_ПереадресацияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось прочитать файл временной обработки'"));
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Асинх Функция ПолучитьКодКНовойОбработкеЗагрузки(ПараметрыСохранения,
	КаталогВременныхФайлов, КаталогДляАрхива, ИмяОбработки)
	
	// BSLLS:MissingTemporaryFileDeletion-off
	#Если ВебКлиент Тогда
		ИмяВременногоФайлаНовый = КаталогВременныхФайлов + Строка(Новый УникальныйИдентификатор);
	#Иначе
		ИмяВременногоФайлаНовый = ПолучитьИмяВременногоФайла("epf");
	#КонецЕсли
	// BSLLS:MissingTemporaryFileDeletion-on
	
	Если ПараметрыСохранения.ФайловаяБаза Тогда
		АргументыПодключения = СтрШаблон("/F ""%1""", ПараметрыСохранения.КаталогИнформационнойБазы);
	Иначе
		АргументыПодключения = СтрШаблон("/S %1\%2",
			ПараметрыСохранения.КластерСерверов, ПараметрыСохранения.ИмяИнформационнойБазы);
	КонецЕсли;
	
	Если ПараметрыСохранения.ИмяПользователя = "" И ПараметрыСохранения.Пароль = "" Тогда
		АргументыАутентификации = "";
	ИначеЕсли ПараметрыСохранения.Пароль = "" Тогда
		АргументыАутентификации = СтрШаблон("/N %1", ПараметрыСохранения.ИмяПользователя);
	Иначе
		АргументыАутентификации = СтрШаблон("/N %1 /P %2", ПараметрыСохранения.ИмяПользователя, ПараметрыСохранения.Пароль);
	КонецЕсли;
	
	КомандаЗагрузкиОбработки = СтрШаблон("1cv8.exe DESIGNER %1 %2 /DisableStartupMessages /DisableStartupDialogs /LoadExternalDataProcessorOrReportFromFiles ""%3"" ""%4""",
		АргументыПодключения, АргументыАутентификации, КаталогДляАрхива + ИмяОбработки + ".xml", ИмяВременногоФайлаНовый);
	
	#Если Не ВебКлиент И Не МобильныйКлиент Тогда
		КаталогПрограммы = КаталогПрограммы();
	#Иначе
		КаталогПрограммы = "";
	#КонецЕсли
	
	// BSLLS:ExternalAppStarting-off
	Результат = Ждать ЗапуститьПриложениеАсинх(КомандаЗагрузкиОбработки, КаталогПрограммы, Истина);
	// BSLLS:ExternalAppStarting-on
	
	Если Результат <> 0 Тогда
		пбп_ПереадресацияКлиент.СообщитьПользователю(НСтр("ru = 'Конфигуратор указанной базы не доступен'"));
		Возврат Неопределено;
	КонецЕсли;
	
	ДвоичныеДанныеОбработки = Новый ДвоичныеДанные(ИмяВременногоФайлаНовый);
	
	УдалитьФайлыНаКлиенте(КаталогДляАрхива);
	УдалитьФайлыНаКлиенте(ИмяВременногоФайлаНовый);
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанныеОбработки, Новый УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Асинх Процедура УдалитьФайлыНаКлиенте(ИмяФайла)
	
	Попытка
		Ждать УдалитьФайлыАсинх(ИмяФайла);
	Исключение
		ТекстСообщения = СтрШаблон("ru = 'Не удалось удалить файл %1. Подробно: %2'",
			ИмяФайла, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		пбп_ПереадресацияКлиент.СообщитьПользователю(НСтр(ТекстСообщения));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции