
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ИспользоватьКак.ТолькоПросмотр = Не пбп_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеКонстанты(
		"пбп_ИспользоватьПользовательскиеФункции");
	
	УстановитьВидимостьПользовательскихФункций();
	УстановитьВидимостьСтраницРезультата();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКакПриИзменении(Элемент)
	УстановитьВидимостьПользовательскихФункций();
	УстановитьВидимостьСтраницРезультата();
	
	ВыдаватьОшибкуПриОтсутствииЛиста = Истина;
	КонвертироватьДаты = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонВВидеПриИзменении(Элемент)
	УстановитьВидимостьСтраницРезультата();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок			= НСтр("ru = 'Выберите файл для загрузки'");
	Диалог.МножественныйВыбор	= Ложь;
	Диалог.Фильтр				= "Текстовый файл с разделителями (*.csv)|*.csv|Табличный документ Excel (*.xlsx)|*.xlsx";		Результат = Ждать Диалог.ВыбратьАсинх();		Если ЗначениеЗаполнено(Результат) Тогда		ПутьКФайлу = Результат[0];	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗагрузитьНастройки(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок			= НСтр("ru = 'Выберите файл для загрузки настроек'");
	Диалог.МножественныйВыбор	= Ложь;
	Диалог.Фильтр				= "Расширяемый язык разметки (*.xml)|*.xml";
	
	Результат = Ждать Диалог.ВыбратьАсинх();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(Результат[0]);
		АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, Новый УникальныйИдентификатор);
		ЗагрузитьНастройкиНаСервере(АдресФайлаВХранилище);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СохранитьНастройки(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок			= НСтр("ru = 'Выберите файл для сохранения настроек'");
	Диалог.МножественныйВыбор	= Ложь;
	Диалог.Фильтр				= "Расширяемый язык разметки (*.xml)|*.xml";
	
	Результат = Ждать Диалог.ВыбратьАсинх();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		АдресФайлаВХранилище = СохранитьНастройкиНаСервере();
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаВХранилище);
		ДвоичныеДанныеФайла.Записать(Результат[0]);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьШаблонНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СформироватьШаблон(Команда)
	СформироватьШаблонНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьФункциюНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьФункцию(Команда)
	ВыполнитьФункциюНаСервере();
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьПользовательскихФункций()
	
	Элементы.ФункцияПостобработкиДанных.Видимость = ИспользоватьКак;
	Элементы.ШаблонВВиде.Видимость = Не ИспользоватьКак;
	Элементы.ПутьКФайлу.Видимость = ИспользоватьКак;
	Элементы.НастройкаСтруктурыКолонокФайлаФункцияПреобразованияСсылка.Видимость = ИспользоватьКак;
	Элементы.НастройкаСтруктурыКолонокФайлаФункцияПреобразования.Видимость = Не ИспользоватьКак;
	Элементы.НастройкаСтруктурыКолонокФайлаВыполнитьФункцию.Видимость = ИспользоватьКак;
	Элементы.НастройкаСтруктурыКолонокФайлаСформироватьШаблон.Видимость = Не ИспользоватьКак;
	Элементы.ГруппаПараметрыЧтенияФайла.Видимость = ИспользоватьКак;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницРезультата()
	
	Элементы.ГруппаРезультатМодуль.Видимость = Не ИспользоватьКак И Не ШаблонВВиде;
	Элементы.ГруппаРезультатМакет.Видимость = Не ИспользоватьКак И ШаблонВВиде;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиНаСервере(АдресФайлаВХранилище)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВХранилище);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	НовоеЧтениеXML = Новый ЧтениеXML;
	НовоеЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип(ПолучитьИмяПространства(),
		ПолучитьСтруктуруТиповОбъектовXDTO()["Форма"]);
	СвойстваФормыXDTO = ФабрикаXDTO.ПрочитатьXML(НовоеЧтениеXML, ТипОбъектаXDTO);
	
	НовоеЧтениеXML.Закрыть();
	
	пбп_Переадресация.УдалитьВременныйФайл(ИмяВременногоФайла);
	
	ИспользоватьКак						= СвойстваФормыXDTO.DownloadWithUserFunctions;
	ШаблонВВиде							= СвойстваФормыXDTO.TemplateIsLayout;
	ПутьКФайлу							= СвойстваФормыXDTO.FilePath;
	ФункцияПостобработкиДанных			= Справочники.пбп_ПользовательскиеФункции.ПолучитьСсылку(
		Новый УникальныйИдентификатор(СвойстваФормыXDTO.UserFunction));
	НазваниеЛиста						= СвойстваФормыXDTO.SheetName;
	НачальныйНомерСтроки				= СвойстваФормыXDTO.BeginningNumber;
	ЗначениеИстина						= СвойстваФормыXDTO.BooleanValueTrue;
	СопоставлениеПоНаименованию			= СвойстваФормыXDTO.MatchByName;
	ВыдаватьОшибкуПриОтсутствииЛиста	= СвойстваФормыXDTO.ShowErrorIfSheetAbsent;
	КонвертироватьДаты					= СвойстваФормыXDTO.ConvertDates;
	
	УстановитьВидимостьПользовательскихФункций();
	УстановитьВидимостьСтраницРезультата();
	
КонецПроцедуры

&НаСервере
Функция СохранитьНастройкиНаСервере()
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип(ПолучитьИмяПространства(),
		ПолучитьСтруктуруТиповОбъектовXDTO()["Форма"]);
	СвойстваФормыXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO);
	
	СвойстваФормыXDTO.DownloadWithUserFunctions = ИспользоватьКак;
	СвойстваФормыXDTO.TemplateIsLayout			= ШаблонВВиде;
	СвойстваФормыXDTO.FilePath					= ПутьКФайлу;
	СвойстваФормыXDTO.UserFunction				= Строка(ФункцияПостобработкиДанных.УникальныйИдентификатор());
	СвойстваФормыXDTO.SheetName					= НазваниеЛиста;
	СвойстваФормыXDTO.BeginningNumber			= НачальныйНомерСтроки;
	СвойстваФормыXDTO.BooleanValueTrue			= ЗначениеИстина;
	СвойстваФормыXDTO.MatchByName				= СопоставлениеПоНаименованию;
	СвойстваФормыXDTO.ShowErrorIfSheetAbsent	= ВыдаватьОшибкуПриОтсутствииЛиста;
	СвойстваФормыXDTO.ConvertDates				= КонвертироватьДаты;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	
	НоваяЗаписьXML = Новый ЗаписьXML;	НоваяЗаписьXML.ОткрытьФайл(ИмяВременногоФайла);		ФабрикаXDTO.ЗаписатьXML(НоваяЗаписьXML, СвойстваФормыXDTO);
	
	НоваяЗаписьXML.Закрыть();
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	пбп_Переадресация.УдалитьВременныйФайл(ИмяВременногоФайла);
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИмяПространства()
	
	Возврат "http://www.pssl-packages.org/forms-settings";
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруТиповОбъектовXDTO()
	
	СтруктураТипов = Новый Структура;
	СтруктураТипов.Вставить("Форма"			, "Exchange.UniversalFileDownloadFromTableFile");
	СтруктураТипов.Вставить("Таблица"		, "Exchange.UniversalFileDownloadFromTableFile.ColumnsSettings");
	СтруктураТипов.Вставить("СтрокаТаблицы"	, "Exchange.UniversalFileDownloadFromTableFile.ColumnsSettings.Row");
	
	Возврат СтруктураТипов;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции