// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область СлужебныйПрограммныйИнтерфейс

// См. СтандартныеПодсистемыКлиент.ПриПолученииСерверногоОповещения.
Процедура ПриПолученииСерверногоОповещения(ИмяОповещения, Результат) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Текст = пбп_ПереадресацияКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Существуют конфликты предопределенных элементов ''%1'''"),
			Результат.ПредставлениеОбъекта);
		Пояснение = пбп_ПереадресацияКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Разрешить конфликты предопределенных элементов ''%1'''"),
			Результат.ПредставлениеОбъекта);
		
		ПоказатьОповещениеПользователя(
			Текст,
			НавигационнаяСсылкаОбъекта(Результат.ИмяОбъектаМетаданных),
			Пояснение,
			БиблиотекаКартинок.ДиалогВосклицание,
			СтатусОповещенияПользователя.Важное,
			"КонфликтыПредопределенныхЭлементов_" + Результат.ИмяОбъектаМетаданных);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает навигационную ссылку для оповещений.
//
// Параметры:
//  ИмяОбъекта	 - Строка - Полное имя объекта метаданных
// 
// Возвращаемое значение:
//  Строка - навигационная ссылка
//
Функция НавигационнаяСсылкаОбъекта(ИмяОбъекта)
	Возврат "e1cib/list/" + ИмяОбъекта;
КонецФункции

#КонецОбласти