
&Вместо("ИсключаемыеПоляДляРасчетаХешаЭлемент")
Функция Мок_ИсключаемыеПоляДляРасчетаХешаЭлемент()
	
	ПараметрыМетода = Новый Массив;
	
	Возврат ВыполнитьПерехватМетода("ИсключаемыеПоляДляРасчетаХешаЭлемент", ПараметрыМетода);
	
КонецФункции

&Вместо("ИсключаемыеПоляДляРасчетаХешаГруппа")
Функция Мок_ИсключаемыеПоляДляРасчетаХешаГруппа()
	
	ПараметрыМетода = Новый Массив;
	
	Возврат ВыполнитьПерехватМетода("ИсключаемыеПоляДляРасчетаХешаГруппа", ПараметрыМетода);
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

// Выполняет перехват вызова метода
//
// Параметры:
//  ИмяМетода	 - Строка - Имя перехватываемого метода
//  Параметры	 - Массив - Параметры метода
// 
// Возвращаемое значение:
//  Произвольный - Результат вызова
//
Функция ВыполнитьПерехватМетода(ИмяМетода, ПараметрыМетода)
	
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(пбп_ПредопределенныеЗначенияПереопределяемый,
		ИмяМетода,
		ПараметрыМетода,
		ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов();
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
