
&Вместо("ИсключаемыеПоляДляРасчетаХешаЭлемент")
Функция Мок_ИсключаемыеПоляДляРасчетаХешаЭлемент()
	
	ПараметрыМетода = Мокито.МассивПараметров();
	
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(пбп_ПредопределенныеЗначенияПереопределяемый,
		"ИсключаемыеПоляДляРасчетаХешаЭлемент",
		ПараметрыМетода,
		ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов();
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

&Вместо("ИсключаемыеПоляДляРасчетаХешаГруппа")
Функция Мок_ИсключаемыеПоляДляРасчетаХешаГруппа()
	
	ПараметрыМетода = Мокито.МассивПараметров();
	
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(пбп_ПредопределенныеЗначенияПереопределяемый,
		"ИсключаемыеПоляДляРасчетаХешаГруппа",
		ПараметрыМетода,
		ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов();
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции
