// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

// Обработчик команды формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой выполняется команда.
//   Команда - КомандаФормы - выполняемая команда.
//   Источник - ТаблицаФормы
//            - ДанныеФормыСтруктура - объект или список формы с полем "Ссылка".
//
Процедура НачатьВыполнениеКоманды(Форма, Команда, Источник) Экспорт
	
	ИмяКоманды = Команда.Имя;
	
	Имя = ЧистоеИмяКоманды(ИмяКоманды);
	Если Имя = пбп_ПредопределенныеЗначенияКлиентСервер.ИмяКомандыЗаполненияПредопределенных() Тогда
		СоздатьОбновитьПредопределенныеЗначения(Форма);
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ТаблицаФормы") Тогда
		Источник.Обновить();
	КонецЕсли;
	
КонецПроцедуры

// Создание предопределенных значений на основании заполненной таблицы
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма из которой запущена обработка обновление предопределенных элементов
//
Процедура СоздатьОбновитьПредопределенныеЗначения(Форма) Экспорт
	
	// Возвращаем адрес временного хранилища на таблицу и есть ли конфликты
	РезультатОбработки =
		пбп_ПредопределенныеЗначенияВызовСервера.ИнициализироватьПредопределенныеЗначения(Форма.ИмяФормы);
	
	Если РезультатОбработки.ЕстьСтроки = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("АдресТаблицы", РезультатОбработки.АдресТаблицы);
	Параметры.Вставить("ИмяФормыВладельца", Форма.ИмяФормы);
	
	ОткрытьФорму("ОбщаяФорма.пбп_ФормаРазрешенияКонфликтовПредопределенныхЭлементов", Параметры, Форма);
	
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Элемент) Экспорт
	
	Если ИмяСобытия = ИмяСобытияОповещенияОбновления() Тогда
		Если ТипЗнч(Элемент) = Тип("ТаблицаФормы") Тогда
			Элемент.Обновить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ИмяСобытияОповещенияОбновления() Экспорт
	Возврат "ОбновитьСписокПредопределенных";
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЧистоеИмяКоманды(ИмяКоманды)
	
	Если Не ЗначениеЗаполнено(ИмяКоманды) Тогда
		Возврат "";
	КонецЕсли;
	
	ЧастиСтроки = СтрРазделить(ИмяКоманды, "_", Истина);
	Если ЗначениеЗаполнено(ЧастиСтроки) Тогда
		Возврат ЧастиСтроки[0];
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#КонецОбласти
