///////////////////////////////////////////////////////////////////////////////////////////////////////
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL: https://github.com/firstBitSportivnaya/PSSL/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция предназначена для обработки входящих запросов формирования спецификации.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос - Запрос формирования спецификации.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с ошибкой или данными спецификации.
//
Функция ОбработатьЗапросСпецификации(Запрос) Экспорт
	
	Перем РезультатОбработчика;
	
	КодыСостояния = пбп_КоннекторHTTP.КодыСостоянияHTTP();
	
	Параметры = ПараметрыОбработчика(Запрос, КодыСостояния);
	
	ОписаниеОшибки = "";
	Попытка
		РезультатПеренаправления = ПеренаправлениеНаОбработчик(Запрос.ОтносительныйURL, Параметры);
		Если РезультатПеренаправления.КодСостояния <> Неопределено Тогда
			Возврат СформироватьОтветОшибки(ОписаниеОшибки, РезультатПеренаправления.КодСостояния, КодыСостояния);
		КонецЕсли;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки(); // только для логирования
		КодСостояния = КодыСостояния.ВнутренняяОшибкаСервера_500;
		
		Возврат СформироватьОтветОшибки(ОписаниеОшибки, КодСостояния, КодыСостояния);
	КонецПопытки;
	
	Попытка
		РезультатОбработчика = пбп_Переадресация.ВычислитьВБезопасномРежиме(РезультатПеренаправления.Данные, Параметры);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки(); // только для логирования
		КодСостояния = КодыСостояния.ВнутренняяОшибкаСервера_500;
		
		Возврат СформироватьОтветОшибки(ОписаниеОшибки, КодСостояния, КодыСостояния);
	КонецПопытки;
	
	КонтекстОтвета = СформироватьДанныеКонтекстаОтвета(РезультатОбработчика, КодыСостояния);
	
	Возврат СформироватьОтвет(КонтекстОтвета);
	
КонецФункции

// Возвращает обработчик для передаваемого ресурса.
//
// Параметры:
//  Ресурс			 - Строка	 - Ресурс сервиса.
//  КодыСостояния	 - Структура - см. пбп_КоннекторHTTP.КодыСостоянияHTTP
// 
// Возвращаемое значение:
//  Структура - см. пбп_ПостроительСпецификацииOpenAPI.РезультатВыполнения
//
Функция ПолучитьОбработчикРесурса(Ресурс, КодыСостояния) Экспорт
	
	Результат = РезультатВыполнения();
	
	Обработчик = пбп_ПостроительСпецификацииOpenAPIПовтИсп.ОбработчикиРесурсов()[Ресурс];
	
	Если Обработчик = Неопределено Тогда
		Результат.КодСостояния = КодыСостояния.НеРеализовано_501;
		Возврат Результат;
	КонецЕсли;
	
	Результат.Данные = Обработчик;
	
	Возврат Результат;
	
КонецФункции

// Возвращает спецификация по имени сервиса.
//
// Параметры:
//  ИмяСервиса	 - Строка - Имя сервиса, по которому запрошена спецификация.
// 
// Возвращаемое значение:
//  Строка - Содержит текст спецификации.
//
Функция ПолучитьСпецификациюСервиса(ИмяСервиса) Экспорт
	
	ИмяСпецификации = пбп_ПостроительСпецификацииOpenAPIПереопределяемый.ИменаМакетовСервисов()[ИмяСервиса];
	
	Если ЗначениеЗаполнено(ИмяСпецификации) Тогда
		Возврат пбп_ПостроительСпецификацииOpenAPIПовтИсп.ПолучитьМакетСпецификации(ИмяСпецификации);
	КонецЕсли;
	
	Спецификация = пбп_ПостроительСпецификацииOpenAPIПереопределяемый.СпецификацииСервисовСтрокой()[ИмяСервиса];
	Если ЗначениеЗаполнено(Спецификация) Тогда
		Возврат Спецификация;
	КонецЕсли;
	
	ВызватьИсключение пбп_ПереадресацияКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Не найдена спецификация сервиса %1'"),
		ИмяСервиса);
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

Функция РезультатВыполнения() Экспорт
	Возврат Новый Структура("Данные, КодСостояния");
КонецФункции

#Область РесурсыИОбработчики

Функция ПолучитьОбработчикиИРесурсыСпецификации() Экспорт
	Ключи = "Ресурс,Обработчик";
	
	Ресурсы = Новый Массив(6);
	
	Ресурсы[0] = Новый Структура(Ключи,
		"/docs/openapi",
		"пбп_ПостроительСпецификацииOpenAPI.ОбработчикМетодаДокументацииСервиса");
	Ресурсы[1] = Новый Структура(Ключи,
		"/favicon-16x16.png",
		"пбп_ПостроительСпецификацииOpenAPI.ОбработчикМетодаИконка16ДокументацииСервиса");
	Ресурсы[2] = Новый Структура(Ключи,
		"/favicon-32x32.png",
		"пбп_ПостроительСпецификацииOpenAPI.ОбработчикМетодаИконка16ДокументацииСервиса");
	Ресурсы[3] = Новый Структура(Ключи,
		"/swagger-ui.css",
		"пбп_ПостроительСпецификацииOpenAPI.ОбработчикМетодаСтилейДокументацииСервиса");
	Ресурсы[4] = Новый Структура(Ключи,
		"/swagger-ui-bundle.js",
		"пбп_ПостроительСпецификацииOpenAPI.ОбработчикМетодаСкриптовДокументацииСервиса");
	Ресурсы[5] = Новый Структура(Ключи,
		"/spec/openapi.json",
		"пбп_ПостроительСпецификацииOpenAPI.ОбработчикМетодаСпецификацииСервиса");
	
	Возврат Ресурсы;
	
КонецФункции

#КонецОбласти

Функция ПеренаправлениеНаОбработчик(Ресурс, Параметры) Экспорт
	
	КодыСостояния = Параметры.КодыСостояния;
	
	Результат = РезультатВыполнения();
	
	ДопустимыеРесурсы = пбп_ПостроительСпецификацииOpenAPIПовтИсп.ДопустимыеРесурсыСпецификации();
	Если ДопустимыеРесурсы[Ресурс] = Неопределено Тогда
		Результат.КодСостояния = КодыСостояния.НеНайдено_404;
		Возврат Результат;
	КонецЕсли;
	
	ДанныеОбработчика = ПолучитьОбработчикРесурса(Ресурс, КодыСостояния);
	
	Если ДанныеОбработчика.КодСостояния <> Неопределено Тогда
		Результат.КодСостояния = КодыСостояния.НеНайдено_404;
		Возврат Результат;
	КонецЕсли;
	
	ПередаваемыеПараметры = ?(ЗначениеЗаполнено(Параметры), "Параметры", "");
	
	Выражение = ДанныеОбработчика.Данные + "(" + ПередаваемыеПараметры + ")";
	
	Результат.Данные = Выражение;
	
	Возврат Результат;
	
КонецФункции

Функция ОбработчикМетодаДокументацииСервиса(Параметры) Экспорт
	
	КорневойURL = Параметры.КорневойURL;
	КодыСостояния = Параметры.КодыСостояния;
	
	КодСостояния = КодыСостояния.ОК_200;
	
	Иконка16Ссылка = КорневойURL + "/favicon-16x16.png";
	Иконка32Ссылка = КорневойURL + "/favicon-32x32.png";
	СтилиСсылка = КорневойURL + "/swagger-ui.css";
	СкриптыСсылка = КорневойURL + "/swagger-ui-bundle.js";
	СпецификацияСсылка = КорневойURL + "/spec/openapi.json";
	
	Макет = ПолучитьОбщийМакет("пбп_СпецификацияСтраницаREST");
	Макет.ВставитьСтроку(15, "supportedSubmitMethods: [], // Отключает кнопку ""Try it out""");
	
	СодержаниеОтвета = Макет.ПолучитьТекст();
	СодержаниеОтвета = СтрЗаменить(СодержаниеОтвета, "[Заголовок]", "Swagger UI");
	СодержаниеОтвета = СтрЗаменить(СодержаниеОтвета, "[Иконка16Ссылка]", Иконка16Ссылка);
	СодержаниеОтвета = СтрЗаменить(СодержаниеОтвета, "[Иконка32Ссылка]", Иконка32Ссылка);
	СодержаниеОтвета = СтрЗаменить(СодержаниеОтвета, "[СтилиСсылка]", СтилиСсылка);
	СодержаниеОтвета = СтрЗаменить(СодержаниеОтвета, "[СкриптыСсылка]", СкриптыСсылка);
	СодержаниеОтвета = СтрЗаменить(СодержаниеОтвета, "[СпецификацияСсылка]", СпецификацияСсылка);
	
	ЗаголовкиОтвета = Новый Соответствие;
	ЗаголовкиОтвета.Вставить("Content-Type", "text/html; charset=utf-8");
	
	Возврат СформироватьРезультатОбработчика(КодСостояния, СодержаниеОтвета, ЗаголовкиОтвета);
	
КонецФункции

Функция ОбработчикМетодаИконка16ДокументацииСервиса(Параметры) Экспорт
	
	КодСостояния = Параметры.КодыСостояния.ОК_200;
	
	СодержаниеОтвета = ПолучитьОбщийМакет("пбп_СпецификацияИконка16СтраницыREST");
	
	ЗаголовкиОтвета = Новый Соответствие;
	ЗаголовкиОтвета.Вставить("Content-Type", "image/png");
	
	Возврат СформироватьРезультатОбработчика(КодСостояния, СодержаниеОтвета, ЗаголовкиОтвета);
	
КонецФункции

Функция ОбработчикМетодаИконка32ДокументацииСервиса(Параметры) Экспорт
	
	КодСостояния = Параметры.КодыСостояния.ОК_200;
	
	СодержаниеОтвета = ПолучитьОбщийМакет("пбп_СпецификацияИконка32СтраницыREST");
	
	ЗаголовкиОтвета = Новый Соответствие;
	ЗаголовкиОтвета.Вставить("Content-Type", "image/png");
	
	Возврат СформироватьРезультатОбработчика(КодСостояния, СодержаниеОтвета, ЗаголовкиОтвета);
	
КонецФункции

Функция ОбработчикМетодаСтилейДокументацииСервиса(Параметры) Экспорт
	
	КодСостояния = Параметры.КодыСостояния.ОК_200;
	
	СодержаниеОтвета = пбп_ПостроительСпецификацииOpenAPIПовтИсп
		.ПолучитьМакетСпецификации("пбп_СпецификацияСтилиСтраницыREST");
	
	ЗаголовкиОтвета = Новый Соответствие;
	ЗаголовкиОтвета.Вставить("Content-Type", "text/css; charset=utf-8");
	
	Возврат СформироватьРезультатОбработчика(КодСостояния, СодержаниеОтвета, ЗаголовкиОтвета);
	
КонецФункции

Функция ОбработчикМетодаСкриптовДокументацииСервиса(Параметры) Экспорт
	
	КодСостояния = Параметры.КодыСостояния.ОК_200;
	
	СодержаниеОтвета = пбп_ПостроительСпецификацииOpenAPIПовтИсп
		.ПолучитьМакетСпецификации("пбп_СпецификацияСкриптыСтраницыREST");
	
	ЗаголовкиОтвета = Новый Соответствие;
	ЗаголовкиОтвета.Вставить("Content-Type", "application/javascript; charset=utf-8");
	
	Возврат СформироватьРезультатОбработчика(КодСостояния, СодержаниеОтвета, ЗаголовкиОтвета);
	
КонецФункции

Функция ОбработчикМетодаСпецификацииСервиса(Параметры) Экспорт
	
	КодСостояния = Параметры.КодыСостояния.ОК_200;
	
	СодержаниеОтвета = ПолучитьСпецификациюСервиса(Параметры.ИмяСервиса);
	
	ЗаголовкиОтвета = Новый Соответствие;
	ЗаголовкиОтвета.Вставить("Content-Type", "application/json");
	
	Возврат СформироватьРезультатОбработчика(КодСостояния, СодержаниеОтвета, ЗаголовкиОтвета);
	
КонецФункции

Функция ОбработчикМетодаСостоянияСервиса(Параметры) Экспорт
	
	КодСостояния = Параметры.КодыСостояния.ОК_200;
	
	СодержаниеОтвета = Новый Структура;
	СодержаниеОтвета.Вставить("status", "pass");
	
	ЗаголовкиОтвета = Новый Соответствие;
	ЗаголовкиОтвета.Вставить("Content-Type", "application/json");
	
	Возврат СформироватьРезультатОбработчика(КодСостояния, СодержаниеОтвета, ЗаголовкиОтвета);
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция СформироватьОтветОшибки(ОписаниеОшибки, КодСостояния, КодыСостояния)
	
	СодержаниеОшибки = пбп_КоннекторHTTP.ПредставлениеКодаСостоянияHTTP(КодСостояния);
	
	РезультатОбработчика = СформироватьРезультатОбработчика(КодСостояния, СодержаниеОшибки);
	
	КонтекстОтвета = СформироватьДанныеКонтекстаОтвета(РезультатОбработчика, КодыСостояния);
	
	Возврат СформироватьОтвет(КонтекстОтвета);
	
КонецФункции

Функция СформироватьОтвет(КонтекстОтвета)
	
	Результат = Новый HTTPСервисОтвет(КонтекстОтвета.Код);
	
	Если ЗначениеЗаполнено(КонтекстОтвета.ТелоСтрока) Тогда
		Результат.УстановитьТелоИзСтроки(КонтекстОтвета.ТелоСтрока);
	ИначеЕсли ЗначениеЗаполнено(КонтекстОтвета.ТелоДвоичныеДанные) Тогда
		Результат.УстановитьТелоИзДвоичныхДанных(КонтекстОтвета.ТелоДвоичныеДанные);
	КонецЕсли;
	
	Для Каждого КЗ Из КонтекстОтвета.Заголовки Цикл
		Результат.Заголовки.Вставить(КЗ.Ключ, КЗ.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураДанныхКонтекстаОтвета()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Код", 200);
	Результат.Вставить("ТелоСтрока", Неопределено);
	Результат.Вставить("ТелоДвоичныеДанные", Неопределено);
	Результат.Вставить("Заголовки", Новый Соответствие);
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьДанныеКонтекстаОтвета(РезультатОбработчика, КодыСостояния)
	
	Код = РезультатОбработчика.Код;
	СодержаниеОтвета = РезультатОбработчика.СодержаниеОтвета;
	ЗаголовкиОтвета = РезультатОбработчика.ЗаголовкиОтвета;
	
	Результат = СтруктураДанныхКонтекстаОтвета();
	
	Результат.Код = Код;
	Если Код = КодыСостояния.ОК_200 Тогда
		Если ТипЗнч(СодержаниеОтвета) = Тип("ДвоичныеДанные") Тогда
			Результат.ТелоДвоичныеДанные = СодержаниеОтвета;
		Иначе
			Результат.ТелоСтрока = СодержаниеОтвета;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаголовкиОтвета) Тогда
			Для Каждого КЗ Из ЗаголовкиОтвета Цикл
				Результат.Заголовки.Вставить(КЗ.Ключ, КЗ.Значение);
			КонецЦикла;
		КонецЕсли;
	Иначе
		ОписаниеОшибки = СтруктураДанныхОписаниеОшибки();
		ОписаниеОшибки.error = СодержаниеОтвета;
		
		Результат.ТелоСтрока = пбп_КоннекторHTTP.ОбъектВJson(ОписаниеОшибки);
		Результат.Заголовки.Вставить("Content-Type", "application/json");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураДанныхОписаниеОшибки()
	
	Результат = Новый Структура;
	
	Результат.Вставить("error");
	
	Возврат Результат;
	
КонецФункции

#Область Ресурсы

Функция БазовыйРесурс()
	Возврат "/docs/openapi";
КонецФункции

Функция РесурсСпецификацииСервиса()
	Возврат "/spec/openapi.json";
КонецФункции

#КонецОбласти

Функция ПараметрыОбработчика(Запрос, КодыСостояния)
	
	Параметры = Новый Структура;
	
	ИмяСервиса = ПолучитьКлючСервиса(Запрос);
	
	Если Запрос.ОтносительныйURL = БазовыйРесурс() Тогда
		Параметры.Вставить("КорневойURL", Запрос.БазовыйURL);
	ИначеЕсли Запрос.ОтносительныйURL = РесурсСпецификацииСервиса() Тогда
		Параметры.Вставить("ИмяСервиса", ИмяСервиса);
	КонецЕсли;
	
	Параметры.Вставить("КодыСостояния", КодыСостояния);
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьКлючСервиса(Запрос)
	
	Адрес = Запрос.БазовыйURL;
	Позиция = СтрНайти(Адрес, "/", НаправлениеПоиска.СКонца);
	
	Результат = Сред(Адрес, Позиция + 1);
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьРезультатОбработчика(Код, СодержаниеОтвета = Неопределено, ЗаголовкиОтвета = Неопределено)
	
	Результат = Новый Структура;
	
	Результат.Вставить("Код", Код);
	Результат.Вставить("СодержаниеОтвета", СодержаниеОтвета);
	Результат.Вставить("ЗаголовкиОтвета", ЗаголовкиОтвета);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции