// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

// При установке нового номера
//
// Параметры:
//  Источник			 - ДокументОбъект, БизнесПроцессОбъект, ЗадачаОбъект - источник подписки на событие
//  СтандартнаяОбработка - Булево	 - стандартная обработка
//  Префикс				 - Строка	 - префикс, который будет использоваться при генерации номера
//
Процедура ПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Событие = "ПриУстановкеНовогоНомера";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПриУстановкеНовогоКодаИлиНомера(ИмяМетода, Источник, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// При установке нового кода
//
// Параметры:
//  Источник			 - СправочникОбъект, ПланВидовХарактеристикОбъект, ПланОбменаОбъект - источник подписки на событие
//  СтандартнаяОбработка - Булево	 - стандартная обработка
//  Префикс				 - Строка	 - префикс, который будет использоваться при генерации номера
//
Процедура ПриУстановкеНовогоКода(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Событие = "ПриУстановкеНовогоКода";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПриУстановкеНовогоКодаИлиНомера(ИмяМетода, Источник, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// При копировании
//
// Параметры:
//  Источник			 - СправочникОбъект, ДокументОбъект, ПланВидовХарактеристикОбъект, ПланСчетовОбъект,
// ПланВидовРасчетаОбъект, ПланОбменаОбъект, БизнесПроцессОбъект, ЗадачаОбъект - источник подписки на событие
//  ОбъектКопирования	 - СправочникОбъект, ДокументОбъект, ПланВидовХарактеристикОбъект, ПланСчетовОбъект,
// ПланВидовРасчетаОбъект, ПланОбменаОбъект, БизнесПроцессОбъект, ЗадачаОбъект - исходный элемент для копирования
//
Процедура ПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	Событие = "ПриКопировании";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(ОбъектКопирования);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка заполнения
//
// Параметры:
//  Источник			 - СправочникОбъект, ДокументОбъект, ПланВидовХарактеристикОбъект, ПланСчетовОбъект,
// ПланВидовРасчетаОбъект, ПланОбменаОбъект, БизнесПроцессОбъект, ЗадачаОбъект, РегистрСведенийНаборЗаписей - источник подписки на событие
//  ДанныеЗаполнения	 - Произвольный		 - данные заполнения
//  Параметр3			 - Строка, Булево	 - текст заполнения или стандартная обработка для регистра сведений
//  Параметр4			 - Булево			 - стандартная обработка - отсутствует для регистре сведений
//
Процедура ОбработкаЗаполнения(Источник, ДанныеЗаполнения, Параметр3, Параметр4 = Неопределено) Экспорт
	
	Событие = "ОбработкаЗаполнения";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(ДанныеЗаполнения);
			ПараметрыМетода.Добавить(Параметр3); // текст заполнения или стандартная обработка
			Если Параметр4 <> Неопределено Тогда
				ПараметрыМетода.Добавить(Параметр4); // стандартная обработка
			КонецЕсли;
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник			= ПараметрыМетода[0];
			ДанныеЗаполнения	= ПараметрыМетода[1];
			Параметр3			= ПараметрыМетода[2];
			Если Параметр4 <> Неопределено Тогда
				Параметр4		= ПараметрыМетода[3];
			КонецЕсли;
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Перед записью
//
// Параметры:
//  Источник	 - СправочникОбъект, КонстантаМенеджерЗначения, ДокументОбъект, ПланВидовХарактеристикОбъект,
// ПланСчетовОбъект, ПланВидовРасчетаОбъект, ПланОбменаОбъект, БизнесПроцессОбъект, ЗадачаОбъект,
// РегистрСведенийНаборЗаписей, РегистрНакопленияНаборЗаписей, РегистрБухгалтерииНаборЗаписей,
// РегистрРасчетаНаборЗаписей, ПоследовательностьНаборЗаписей - источник подписки на событие
//  Отказ		 - Булево							 - отказ
//  Параметр3	 - РежимЗаписиДокумента, Булево		 - режим записи документа или Замещение для наборов записей
//  Параметр4	 - РежимПроведенияДокумента, Булево	 - режим проведения документа или ТолькоЗапись для РегистрРасчетаНаборЗаписей
//  Параметр5	 - Булево							 - ЗаписьФактическогоПериодаДействия для РегистрРасчетаНаборЗаписей
//  Параметр6	 - Булево							 - ЗаписьПерерасчетов для РегистрРасчетаНаборЗаписей
//
Процедура ПередЗаписью(Источник, Отказ, Параметр3 = Неопределено,
	Параметр4 = Неопределено, Параметр5 = Неопределено, Параметр6 = Неопределено) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Событие = "ПередЗаписью";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПередЗаписьюПриЗаписи(ИмяМетода, Источник,
		Отказ, Параметр3, Параметр4, Параметр5, Параметр6);
	
КонецПроцедуры

// При записи
//
// Параметры:
//  Источник	 - СправочникОбъект, КонстантаМенеджерЗначения, ДокументОбъект, ПланВидовХарактеристикОбъект,
// ПланСчетовОбъект, ПланВидовРасчетаОбъект, ПланОбменаОбъект, БизнесПроцессОбъект, ЗадачаОбъект,
// РегистрСведенийНаборЗаписей, РегистрНакопленияНаборЗаписей, РегистрБухгалтерииНаборЗаписей,
// РегистрРасчетаНаборЗаписей, ПоследовательностьНаборЗаписей - источник подписки на событие
//  Отказ		 - Булево	 - отказ
//  Параметр3	 - Булево	 - Замещение для наборов записей
//  Параметр4	 - Булево	 - ТолькоЗапись для РегистрРасчетаНаборЗаписей
//  Параметр5	 - Булево	 - ЗаписьФактическогоПериодаДействия для РегистрРасчетаНаборЗаписей
//  Параметр6	 - Булево	 - ЗаписьПерерасчетов для РегистрРасчетаНаборЗаписей
//
Процедура ПриЗаписи(Источник, Отказ, Параметр3 = Неопределено,
	Параметр4 = Неопределено, Параметр5 = Неопределено, Параметр6 = Неопределено) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Событие = "ПриЗаписи";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПередЗаписьюПриЗаписи(ИмяМетода, Источник,
		Отказ, Параметр3, Параметр4, Параметр5, Параметр6);
	
КонецПроцедуры

// Перед удалением
//
// Параметры:
//  Источник - СправочникОбъект, ДокументОбъект, ПланВидовХарактеристикОбъект, ПланСчетовОбъект,
// ПланВидовРасчетаОбъект, ПланОбменаОбъект, БизнесПроцессОбъект, ЗадачаОбъект - источник подписки на событие
//  Отказ	 - Булево	 - отказ
//
Процедура ПередУдалением(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Событие = "ПередУдалением";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ВыполнитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// Обработка проведения
//
// Параметры:
//  Источник		 - ДокументОбъект			 - источник подписки на событие
//  Отказ			 - Булево					 - отказ
//  РежимПроведения	 - РежимПроведенияДокумента	 - режим проведения документа
//
Процедура ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Событие = "ОбработкаПроведения";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(Отказ);
			ПараметрыМетода.Добавить(РежимПроведения);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник = ПараметрыМетода[0];
			Если ПараметрыМетода[1] Тогда
				Отказ = Истина;
			КонецЕсли;
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка удаления проведения
//
// Параметры:
//  Источник		 - ДокументОбъект	 - источник подписки на событие
//  Отказ			 - Булево			 - отказ
//
Процедура ОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Событие = "ПередУдалением";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ВыполнитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// Обработка проверки заполнения
//
// Параметры:
//  Источник			 - СправочникОбъект, КонстантаМенеджерЗначения, ДокументОбъект, ПланВидовХарактеристикОбъект,
// ПланСчетовОбъект, ПланВидовРасчетаОбъект, ПланОбменаОбъект, БизнесПроцессОбъект, ЗадачаОбъект,
// РегистрСведенийНаборЗаписей, РегистрНакопленияНаборЗаписей, РегистрБухгалтерииНаборЗаписей,
// РегистрРасчетаНаборЗаписей, ПоследовательностьНаборЗаписей - источник подписки на событие
//  Отказ				 - Булево	 - отказ
//  ПроверяемыеРеквизиты - Массив	 - список проверяемых реквизитов
//
Процедура ОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Событие = "ОбработкаПроверкиЗаполнения";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(Отказ);
			ПараметрыМетода.Добавить(ПроверяемыеРеквизиты);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник = ПараметрыМетода[0];
			Если ПараметрыМетода[1] Тогда
				Отказ = Истина;
			КонецЕсли;
			ПроверяемыеРеквизиты = ПараметрыМетода[2];
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка формирования по версии истории данных
//
// Параметры:
//  Источник		 - СправочникОбъект, КонстантаМенеджерЗначения, ДокументОбъект,
// ПланВидовХарактеристикОбъект, ПланСчетовОбъект, ПланВидовРасчетаОбъект, ПланОбменаОбъект,
// БизнесПроцессОбъект, ЗадачаОбъект, РегистрСведенийНаборЗаписей - источник подписки на событие
//  ДанныеВерсии	 - ФиксированнаяСтруктура				 - данные версии
//  НомерВерсии		 - Число								 - номер версии
//  Параметр4		 - РегистрСведенийКлючЗаписи, Массив	 - ключ записи для РегистрСведенийНаборЗаписей или исключить данные
//  Параметр5		 - Массив, Булево						 - исключить данные для РегистрСведенийНаборЗаписей или стандартная обработка
//  Параметр6		 - Булево								 - стандартная обработка для РегистрСведенийНаборЗаписей
//
Процедура ОбработкаФормированияПоВерсииИсторииДанных(Источник,
	ДанныеВерсии, НомерВерсии, Параметр4, Параметр5, Параметр6 = Неопределено) Экспорт
	
	Событие = "ОбработкаФормированияПоВерсииИсторииДанных";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(ДанныеВерсии);
		ПараметрыМетода.Добавить(НомерВерсии);
		ПараметрыМетода.Добавить(Параметр4);
		ПараметрыМетода.Добавить(Параметр5);
		Если Параметр6 <> Неопределено Тогда
			ПараметрыМетода.Добавить(Параметр6);
		КонецЕсли;
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник		= ПараметрыМетода[0];
		ДанныеВерсии	= ПараметрыМетода[1];
		НомерВерсии		= ПараметрыМетода[2];
		Параметр4		= ПараметрыМетода[3];
		Параметр5		= ПараметрыМетода[4];
		Если Параметр6 <> Неопределено Тогда
			Параметр6	= ПараметрыМетода[5];
		КонецЕсли;
	Исключение
		ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки
	
КонецПроцедуры

// Обработка интерактивной активации
//
// Параметры:
//  Источник			 - БизнесПроцессОбъект, ЗадачаОбъект - источник подписки на событие
//  СтандартнаяОбработка - Булево							 - стандартная обработка
//
Процедура ОбработкаИнтерактивнойАктивации(Источник, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаИнтерактивнойАктивации";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(СтандартнаяОбработка);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник = ПараметрыМетода[0];
			Если Не ПараметрыМетода[1] Тогда
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка получения данных выбора
//
// Параметры:
//  Источник			 - СправочникМенеджер, ПеречислениеМенеджер, ДокументМенеджер, ПланВидовХарактеристикМенеджер, ПланСчетовМенеджер,
// ПланВидовРасчетаМенеджер, ПланОбменаМенеджер, БизнесПроцессМенеджер, ЗадачаМенеджер - источник подписки на событие
//  ДанныеВыбора		 - СписокЗначений	 - данные выбора
//  Параметры			 - Структура		 - параметры
//  СтандартнаяОбработка - Булево			 - стандартная обработка
//
Процедура ОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаПолученияДанныхВыбора";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(ДанныеВыбора);
			ПараметрыМетода.Добавить(Параметры);
			ПараметрыМетода.Добавить(СтандартнаяОбработка);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник				= ПараметрыМетода[0];
			ДанныеВыбора			= ПараметрыМетода[1];
			Параметры				= ПараметрыМетода[2];
			СтандартнаяОбработка	= ПараметрыМетода[3];
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка получения формы
//
// Параметры:
//  Источник				 - СправочникМенеджер, ПеречислениеМенеджер, 
// ОбработкаМенеджер, ДокументМенеджер, ЖурналДокументовМенеджер, РегистрСведенийМенеджер,
// РегистрНакопленияМенеджер, ОтчетМенеджер, ПланВидовХарактеристикМенеджер,
// ПланСчетовМенеджер, РегистрБухгалтерииМенеджер, ПланВидовРасчетаМенеджер, РегистрРасчетаМенеджер,
// ПланОбменаМенеджер, БизнесПроцессМенеджер, ЗадачаМенеджер - источник подписки на событие
//  ВидФормы				 - Строка	 - имя стандартной формы
//  Параметры				 - Структура - параметры формы
//  ВыбраннаяФорма			 - Строка	 - имя открываемой формы
//  ДополнительнаяИнформация - Структура - дополнительная информация
//  СтандартнаяОбработка	 - Булево	 - стандартная обработка
//
Процедура ОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаПолученияФормы";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(ВидФормы);
			ПараметрыМетода.Добавить(Параметры);
			ПараметрыМетода.Добавить(ВыбраннаяФорма);
			ПараметрыМетода.Добавить(ДополнительнаяИнформация);
			ПараметрыМетода.Добавить(СтандартнаяОбработка);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник					= ПараметрыМетода[0];
			ДанныеВыбора				= ПараметрыМетода[1];
			Параметры					= ПараметрыМетода[2];
			ВыбраннаяФорма				= ПараметрыМетода[3];
			ДополнительнаяИнформация	= ПараметрыМетода[4];
			СтандартнаяОбработка		= ПараметрыМетода[5];
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка получения полей представления
//
// Параметры:
//  Источник			 - СправочникМенеджер, ДокументМенеджер, ПланВидовХарактеристикМенеджер, ПланСчетовМенеджер,
// ПланВидовРасчетаМенеджер, ПланОбменаМенеджер, БизнесПроцессМенеджер, ЗадачаМенеджер - источник подписки на событие
//  Поля				 - Массив	 - имена полей
//  СтандартнаяОбработка - Булево	 - стандартная обработка
//
Процедура ОбработкаПолученияПолейПредставления(Источник, Поля, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаПолученияПолейПредставления";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(Поля);
			ПараметрыМетода.Добавить(СтандартнаяОбработка);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник				= ПараметрыМетода[0];
			Поля					= ПараметрыМетода[1];
			СтандартнаяОбработка	= ПараметрыМетода[2];
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка получения представления
//
// Параметры:
//  Источник			 - СправочникМенеджер, ДокументМенеджер, ПланВидовХарактеристикМенеджер, ПланСчетовМенеджер,
// ПланВидовРасчетаМенеджер, ПланОбменаМенеджер, БизнесПроцессМенеджер, ЗадачаМенеджер - источник подписки на событие
//  Данные				 - Структура	 - значения полей, из которых формируется представление
//  Представление		 - Строка		 - строка, в которую нужно поместить представление объекта или ссылки
//  СтандартнаяОбработка - Булево		 - стандартная обработка
//
Процедура ОбработкаПолученияПредставления(Источник, Данные, Представление, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаПолученияПредставления";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(Данные);
			ПараметрыМетода.Добавить(Представление);
			ПараметрыМетода.Добавить(СтандартнаяОбработка);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник				= ПараметрыМетода[0];
			Поля					= ПараметрыМетода[1];
			Представление			= ПараметрыМетода[2];
			СтандартнаяОбработка	= ПараметрыМетода[3];
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка после записи версий истории данных
//
// Параметры:
//  Источник			 - СправочникМенеджер, КонстантаМенеджер, ДокументМенеджер,
// РегистрСведенийМенеджер, ПланВидовХарактеристикМенеджер, ПланСчетовМенеджер, ПланВидовРасчетаМенеджер,
// ПланОбменаМенеджер, БизнесПроцессМенеджер, ЗадачаМенеджер - источник подписки на событие
//  ИнформацияОЗаписиВерсий	 - КоллекцияИнформацииОЗаписиВерсииИсторииДанных 	 - информация о записи версий истории данных
//
Процедура ОбработкаПослеЗаписиВерсийИсторииДанных(Источник, ИнформацияОЗаписиВерсий) Экспорт
	
	Событие = "ОбработкаПослеЗаписиВерсийИсторииДанных";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(ИнформацияОЗаписиВерсий);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник				= ПараметрыМетода[0];
			ИнформацияОЗаписиВерсий	= ПараметрыМетода[1];
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#Область Задачи

// Обработка проверки выполнения
//
// Параметры:
//  Источник	 - ЗадачаОбъект	 - источник подписки на событие
//  Результат	 - Булево		 - результат
//
Процедура ОбработкаПроверкиВыполнения(Источник, Результат) Экспорт
	
	Событие = "ОбработкаПроверкиВыполнения";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(Результат);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник = ПараметрыМетода[0];
			Если ПараметрыМетода[1] Тогда
				Отказ = Истина;
			КонецЕсли;
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Перед выполнением
//
// Параметры:
//  Источник - ЗадачаОбъект	 - источник подписки на событие
//  Отказ	 - Булево		 - отказ
//
Процедура ПередВыполнением(Источник, Отказ) Экспорт
	
	Событие = "ПередВыполнением";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ВыполнитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// Перед интерактивным выполнением
//
// Параметры:
//  Источник - ЗадачаОбъект	 - источник подписки на событие
//  Отказ	 - Булево		 - отказ
//
Процедура ПередИнтерактивнымВыполнением(Источник, Отказ) Экспорт
	
	Событие = "ПередИнтерактивнымВыполнением";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ВыполнитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// При выполнении
//
// Параметры:
//  Источник - ЗадачаОбъект	 - источник подписки на событие
//  Отказ	 - Булево		 - отказ
//
Процедура ПриВыполнении(Источник, Отказ) Экспорт
	
	Событие = "ПриВыполнении";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ВыполнитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

#КонецОбласти // Задачи

#Область ПланыОбмена

// При отправке данных подчиненному
//
// Параметры:
//  Источник				 - ПланОбменаОбъект			 - источник подписки на событие
//  ЭлементДанных			 - Произвольный				 - элемент данных
//  ОтправкаЭлемента		 - ОтправкаЭлементаДанных	 - отправка элемента данных
//  СозданиеНачальногоОбраза - Булево					 - создани начального образа
//
Процедура ПриОтправкеДанныхПодчиненному(Источник, ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза) Экспорт
	
	Событие = "ПриОтправкеДанныхПодчиненному";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПриОтправкеДанных(ИмяМетода, Источник, ЭлементДанных,
		ОтправкаЭлемента, СозданиеНачальногоОбраза);
	
КонецПроцедуры

// При отправке данных главному
//
// Параметры:
//  Источник				 - ПланОбменаОбъект			 - источник подписки на событие
//  ЭлементДанных			 - Произвольный				 - элемент данных
//  ОтправкаЭлемента		 - ОтправкаЭлементаДанных	 - отправка элемента данных
//
Процедура ПриОтправкеДанныхГлавному(Источник, ЭлементДанных, ОтправкаЭлемента) Экспорт
	
	Событие = "ПриОтправкеДанныхГлавному";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПриОтправкеДанных(ИмяМетода, Источник, ЭлементДанных, ОтправкаЭлемента);
	
КонецПроцедуры

// При получении данных от подчиненного
//
// Параметры:
//  Источник			 - ПланОбменаОбъект			 - источник подписки на событие
//  ЭлементДанных		 - Произвольный				 - элемент данных
//  ПолучениеЭлемента	 - ПолучениеЭлементаДанных	 - получение элемента данных
//  ОтправкаНазад		 - Булево					 - отправка назад
//
Процедура ПриПолученииДанныхОтПодчиненного(Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад) Экспорт
	
	Событие = "ПриПолученииДанныхОтПодчиненного";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПриПолученииДанных(ИмяМетода, Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад);
	
КонецПроцедуры

// При получении данных от главного
//
// Параметры:
//  Источник			 - ПланОбменаОбъект			 - источник подписки на событие
//  ЭлементДанных		 - Произвольный				 - элемент данных
//  ПолучениеЭлемента	 - ПолучениеЭлементаДанных	 - получение элемента данных
//  ОтправкаНазад		 - Булево					 - отправка назад
//
Процедура ПриПолученииДанныхОтГлавного(Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад) Экспорт
	
	Событие = "ПриПолученииДанныхОтГлавного";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПриПолученииДанных(ИмяМетода, Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад);
	
КонецПроцедуры

// При отправке данных узла подчиненному
//
// Параметры:
//  Источник		 - ПланОбменаОбъект	 - источник подписки на событие
//  ЭлементДанных	 - Произвольный		 - элемент данных
//  Игнорировать	 - Булево			 - игнорировать
//
Процедура ПриОтправкеДанныхУзлаПодчиненному(Источник, ЭлементДанных, Игнорировать) Экспорт
	
	Событие = "ПриОтправкеДанныхУзлаПодчиненному";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПриОтправкеДанныхУзла(ИмяМетода, Источник, ЭлементДанных, Игнорировать);
	
КонецПроцедуры

// При получении данных узла от главного
//
// Параметры:
//  Источник		 - ПланОбменаОбъект	 - источник подписки на событие
//  ЭлементДанных	 - Произвольный		 - элемент данных
//  Игнорировать	 - Булево			 - игнорировать
//
Процедура ПриПолученииДанныхУзлаОтГлавного(Источник, ЭлементДанных, Игнорировать) Экспорт
	
	Событие = "ПриПолученииДанныхУзлаОтГлавного";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПриОтправкеДанныхУзла(ИмяМетода, Источник, ЭлементДанных, Игнорировать);
	
КонецПроцедуры

// При автоматическом создании нового узла
//
// Параметры:
//  Источник - ПланОбменаОбъект	 - источник подписки на событие
//  Отказ	 - Булево			 - отказ
//
Процедура ПриАвтоматическомСозданииНовогоУзла(Источник, Отказ) Экспорт
	
	Событие = "ПриАвтоматическомСозданииНовогоУзла";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ВыполнитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// Перед созданием начального образа
//
// Параметры:
//  Источник				 - ПланОбменаОбъект		 - источник подписки на событие
//  ТолькоЗарегистрированные - Булево				 - только зарегистрированные
//  ПотокОбменаДанными		 - ПотокОбменаДанными	 - поток обмена данными
//
Процедура ПередСозданиемНачальногоОбраза(Источник, ТолькоЗарегистрированные, ПотокОбменаДанными) Экспорт
	
	Событие = "ПередСозданиемНачальногоОбраза";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(ТолькоЗарегистрированные);
			ПараметрыМетода.Добавить(ПотокОбменаДанными);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Перед началом отправки данных подчиненному
//
// Параметры:
//  Источник			 - ПланОбменаОбъект		 - источник подписки на событие
//  ПотокОбменаДанными	 - ПотокОбменаДанными	 - поток обмена данными
//
Процедура ПередНачаломОтправкиДанныхПодчиненному(Источник, ПотокОбменаДанными) Экспорт
	
	Событие = "ПередНачаломОтправкиДанныхПодчиненному";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПередНачаломОтправкиДанных(ИмяМетода, Источник, ПотокОбменаДанными);
	
КонецПроцедуры

// Перед началом отправки данных главному
//
// Параметры:
//  Источник			 - ПланОбменаОбъект		 - источник подписки на событие
//  ПотокОбменаДанными	 - ПотокОбменаДанными	 - поток обмена данными
//
Процедура ПередНачаломОтправкиДанныхГлавному(Источник, ПотокОбменаДанными) Экспорт
	
	Событие = "ПередНачаломОтправкиДанныхГлавному";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПередНачаломОтправкиДанных(ИмяМетода, Источник, ПотокОбменаДанными);
	
КонецПроцедуры

#КонецОбласти // ПланыОбмена

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Получить функцию соответствия обработчиков
//
// Параметры:
//  Источник	 - Произвольный	 - объект, набор записей или менеджер
//  Событие		 - Строка		 - имя события подписки
// 
// Возвращаемое значение:
//  Строка - имя метода, где будет расположено получение соответствия обработчиков событий
//
Функция ПолучитьИмяФункцииСоответствияОбработчиковСобытий(Источник, Событие)
	
	ТипЗначения = ТипЗнч(Источник);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
	
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "Справочники";
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "Документы";
	ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "ПланыВидовХарактеристик";
	ИначеЕсли Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "ПланыСчетов";
	ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "ПланыВидовРасчета";
	ИначеЕсли Метаданные.БизнесПроцессы.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "БизнесПроцессы";
	ИначеЕсли Метаданные.Задачи.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "Задачи";
	ИначеЕсли Метаданные.ПланыОбмена.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "ПланыОбмена";
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "РегистрыСведений";
	ИначеЕсли Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "РегистрыНакопления";
	ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "РегистрыБухгалтерии";
	ИначеЕсли Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "РегистрыРасчета";
	ИначеЕсли Метаданные.Константы.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "Константы";
	ИначеЕсли Метаданные.Обработки.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "Обработки";
	ИначеЕсли Метаданные.Отчеты.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "Отчеты";
	ИначеЕсли Метаданные.ЖурналыДокументов.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "ЖурналыДокументов";
	ИначеЕсли Метаданные.КритерииОтбора.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "КритерииОтбора";
	ИначеЕсли Метаданные.Последовательности.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "Последовательности";
	ИначеЕсли Метаданные.ХранилищаНастроек.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "ХранилищаНастроек";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СтрШаблон("%1%2", ПрефиксМетода, Событие);
	
КонецФункции

// Получить соответствие существующих обработчиков событий
//
// Параметры:
//  ИмяМетода	 - Строка	 - имя метода, где расположено получение соответствия обработчиков событий
// 
// Возвращаемое значение:
//  Соответствие - ключ - тип объекта, значение - наименование искомой функции с общим модулем
//
Функция ПолучитьСоответствиеСуществующихОбработчиковСобытий(ИмяМетода)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр ИмяМетода не может быть пустым'");
	КонецЕсли;
	
	// BSLLS:ExecuteExternalCodeInCommonModule-off
	ПолноеИмяМетода = СтрШаблон("пбп_ОбработкаСобытийПовтИсп.%1", ИмяМетода);
	Соответствие = пбп_Переадресация.ВызватьФункциюКонфигурации(ПолноеИмяМетода);
	// BSLLS:ExecuteExternalCodeInCommonModule-on
	
	Возврат Соответствие;
	
КонецФункции

// Получить имя метода
//
// Параметры:
//  Источник	 - Произвольный	 - объект, набор записей или менеджер
//  Событие		 - Строка		 - имя события подписки
// 
// Возвращаемое значение:
//  Строка - имя метода, которое должно быть вызвано при возникновении подписки на событие
//
Функция ПолучитьИмяМетода(Источник, Событие)
	
	МетодСоответствия = ПолучитьИмяФункцииСоответствияОбработчиковСобытий(Источник, Событие);
	
	СоответствиеОбработчиков = ПолучитьСоответствиеСуществующихОбработчиковСобытий(МетодСоответствия);
	
	ИмяМетода = СоответствиеОбработчиков.Получить(ТипЗнч(Источник));
	
	Возврат ИмяМетода;
	
КонецФункции

// Получить текст ошибки
//
// Параметры:
//  ИмяМетода		 - Строка	 - см. ПолучитьИмяМетода
//  ОписаниеОшибки	 - Строка	 - текст ошибки исключения
// 
// Возвращаемое значение:
//  Строка - сформированный текст ошибки мультиязычный
//
Функция ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки)
	
	ТекстОшибки = СтрШаблон("ru = '%1%2Имя метода: %3';en = '%1%2Method name: %3'",
		ОписаниеОшибки, Символы.ПС, ИмяМетода);
	
	Возврат НСтр(ТекстОшибки);
	
КонецФункции

Процедура ПередЗаписьюПриЗаписи(ИмяМетода, Источник,
	Отказ, Параметр3, Параметр4, Параметр5, Параметр6)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(Отказ);
		Если Параметр3 <> Неопределено Тогда
			ПараметрыМетода.Добавить(Параметр3); // Режим записи или замещение
		КонецЕсли;
		Если Параметр4 <> Неопределено Тогда
			ПараметрыМетода.Добавить(Параметр4); // Режим проведения или только запись
		КонецЕсли;
		Если Параметр5 <> Неопределено Тогда
			ПараметрыМетода.Добавить(Параметр5); // Запись фактического периода действия
		КонецЕсли;
		Если Параметр6 <> Неопределено Тогда
			ПараметрыМетода.Добавить(Параметр6); // Запись перерасчетов
		КонецЕсли;
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник = ПараметрыМетода[0];
		Если ПараметрыМетода[1] Тогда
			Отказ = Истина;
		КонецЕсли;
	Исключение
		ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоКодаИлиНомера(ИмяМетода, Источник, СтандартнаяОбработка, Префикс)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(СтандартнаяОбработка);
		ПараметрыМетода.Добавить(Префикс);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
	Исключение
		ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыполнитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(Отказ);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник = ПараметрыМетода[0];
		Если ПараметрыМетода[1] Тогда
			Отказ = Истина;
		КонецЕсли;
	Исключение
		ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПриОтправкеДанных(ИмяМетода, Источник, ЭлементДанных,
	ОтправкаЭлемента, СозданиеНачальногоОбраза = Неопределено)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(ЭлементДанных);
		ПараметрыМетода.Добавить(ОтправкаЭлемента);
		Если СозданиеНачальногоОбраза <> Неопределено Тогда
			ПараметрыМетода.Добавить(СозданиеНачальногоОбраза);
		КонецЕсли;
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник			= ПараметрыМетода[0];
		ЭлементДанных		= ПараметрыМетода[1];
		ОтправкаЭлемента	= ПараметрыМетода[2];
		Если СозданиеНачальногоОбраза <> Неопределено Тогда
			СозданиеНачальногоОбраза = ПараметрыМетода[3];
		КонецЕсли;
	Исключение
		ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПриПолученииДанных(ИмяМетода, Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(ЭлементДанных);
		ПараметрыМетода.Добавить(ПолучениеЭлемента);
		ПараметрыМетода.Добавить(ОтправкаНазад);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник			= ПараметрыМетода[0];
		ЭлементДанных		= ПараметрыМетода[1];
		ПолучениеЭлемента	= ПараметрыМетода[2];
		ОтправкаНазад		= ПараметрыМетода[3];
	Исключение
		ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПриОтправкеДанныхУзла(ИмяМетода, Источник, ЭлементДанных, Игнорировать)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(ЭлементДанных);
		ПараметрыМетода.Добавить(Игнорировать);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник			= ПараметрыМетода[0];
		ЭлементДанных		= ПараметрыМетода[1];
		Игнорировать		= ПараметрыМетода[2];
	Исключение
		ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПередНачаломОтправкиДанных(ИмяМетода, Источник, ПотокОбменаДанными)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(ПотокОбменаДанными);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
	Исключение
		ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции