// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

// Получить функцию соответствия обработчиков
//
// Параметры:
//  Источник	 - Произвольный	 - объект, набор записей или менеджер
//  Событие		 - Строка		 - имя события подписки
// 
// Возвращаемое значение:
//  Строка - имя метода, где будет расположено получение соответствия обработчиков событий
//
Функция ПолучитьИмяФункцииСоответствияОбработчиковСобытий(Источник, Событие) Экспорт
	
	ТипЗначения = ТипЗнч(Источник);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
	
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "Справочники";
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "Документы";
	ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "ПланыВидовХарактеристик";
	ИначеЕсли Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "ПланыСчетов";
	ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "ПланыВидовРасчета";
	ИначеЕсли Метаданные.БизнесПроцессы.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "БизнесПроцессы";
	ИначеЕсли Метаданные.Задачи.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "Задачи";
	ИначеЕсли Метаданные.ПланыОбмена.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "ПланыОбмена";
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "РегистрыСведений";
	ИначеЕсли Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "РегистрыНакопления";
	ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "РегистрыБухгалтерии";
	ИначеЕсли Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных) Тогда
		ПрефиксМетода = "РегистрыРасчета";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СтрШаблон("%1%2", ПрефиксМетода, Событие);
	
КонецФункции

// Получить соответствие существующих обработчиков событий
//
// Параметры:
//  ИмяМетода	 - Строка	 - имя метода, где расположено получение соответствия обработчиков событий
// 
// Возвращаемое значение:
//  Соответствие - ключ - тип объекта, значение - наименование искомой функции с общим модулем
//
Функция ПолучитьСоответствиеСуществующихОбработчиковСобытий(ИмяМетода) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		ВызватьИсключение НСтр("Параметр ИмяМетода не может быть пустым");
	КонецЕсли;
	
	// BSLLS:ExecuteExternalCodeInCommonModule-off
	ПолноеИмяМетода = СтрШаблон("пбп_ОбработкаСобытийПереопределяемый.%1", ИмяМетода);
	Соответствие = пбп_Переадресация.ВызватьФункциюКонфигурации(ПолноеИмяМетода);
	// BSLLS:ExecuteExternalCodeInCommonModule-on
	
	Возврат Соответствие;
	
КонецФункции

// Получить имя метода
//
// Параметры:
//  Источник	 - Произвольный	 - объект, набор записей или менеджер
//  Событие		 - Строка		 - имя события подписки
// 
// Возвращаемое значение:
//  Строка - имя метода, которое должно быть вызвано при возникновении подписки на событие
//
Функция ПолучитьИмяМетода(Источник, Событие) Экспорт
	
	МетодСоответствия = ПолучитьИмяФункцииСоответствияОбработчиковСобытий(Источник, Событие);
	
	СоответствиеОбработчиков = пбп_ОбщегоНазначенияПовтИсп
		.ПолучитьСоответствиеСуществующихОбработчиковСобытий(МетодСоответствия);
	
	ИмяМетода = СоответствиеОбработчиков.Получить(ТипЗнч(Источник));
	
	Возврат ИмяМетода;
	
КонецФункции

// Получить текст ошибки
//
// Параметры:
//  ИмяМетода		 - Строка	 - см. ПолучитьИмяМетода
//  ОписаниеОшибки	 - Строка	 - текст ошибки исключения
// 
// Возвращаемое значение:
//  Строка - сформированный текст ошибки мультиязычный
//
Функция ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки) Экспорт
	
	ТекстОшибки = СтрШаблон("ru = '%1%2Имя метода: %3';en = '%1%2Method name: %3'",
		ОписаниеОшибки, Символы.ПС, ИмяМетода);
	
	Возврат НСтр(ТекстОшибки);
	
КонецФункции

// Обработка проверки заполнения общая для объектов и наборов записей
//
// Параметры:
//  ИмяМетода			 - Строка							 - источник подписки на событие
//  Источник			 - Любой объект или набор записей	 - источник подписки на событие
//  Отказ				 - Булево							 - отказ от действия
//  ПроверяемыеРеквизиты - Массив							 - массив проверяемых реквизитов
//
Процедура ОбработкаПроверкиЗаполнения(ИмяМетода, Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(Отказ);
		ПараметрыМетода.Добавить(ПроверяемыеРеквизиты);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник = ПараметрыМетода[0];
		Если ПараметрыМетода[1] Тогда
			Отказ = Истина;
		КонецЕсли;
		ПроверяемыеРеквизиты = ПараметрыМетода[2];
	Исключение
		ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Обработка заполнения общая для объектов и наборов записей
//
// Параметры:
//  ИмяМетода			 - Строка							 - источник подписки на событие
//  Источник			 - Любой объект или набор записей	 - источник подписки на событие
//  ДанныеЗаполнения	 - Произвольный						 - данные для заполнения источника
//  СтандартнаяОбработка - Булево							 - стандартная обработка
//  ТекстЗаполнения		 - Строка							 - текст заполнения (только для объектов)
//
Процедура ОбработкаЗаполнения(ИмяМетода, Источник, ДанныеЗаполнения,
	СтандартнаяОбработка, ТекстЗаполнения = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(ДанныеЗаполнения);
			Если ТекстЗаполнения <> Неопределено Тогда
				ПараметрыМетода.Добавить(ТекстЗаполнения);
			КонецЕсли;
			ПараметрыМетода.Добавить(СтандартнаяОбработка);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник			= ПараметрыМетода[0];
			ДанныеЗаполнения	= ПараметрыМетода[1];
			Если ТекстЗаполнения <> Неопределено Тогда
				ТекстЗаполнения			= ПараметрыМетода[2];
				СтандартнаяОбработка	= ПараметрыМетода[3];
			Иначе
				СтандартнаяОбработка	= ПараметрыМетода[2];
			КонецЕсли;
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	
КонецПроцедуры

// Обработка формирования по версии истории данных общая для объектов и наборов записей
//
// Параметры:
//  ИмяМетода			 - Строка							 - источник подписки на событие
//  Источник			 - Любой объект или набор записей	 - источник подписки на событие
//  ДанныеВерсии		 - ФиксированнаяСтруктура			 - данные версии
//  НомерВерсии			 - Число							 - номер версии
//  ИсключитьДанные		 - Массив							 - исключаемые данные
//  СтандартнаяОбработка - Булево							 - стандартная обработка
//  КлючЗаписи			 - РегистрСведенийКлючЗаписи		 - ключ записи регистра сведений (только для наборов записей)
//
Процедура ОбработкаФормированияПоВерсииИсторииДанных(ИмяМетода, Источник, ДанныеВерсии,
	НомерВерсии, ИсключитьДанные, СтандартнаяОбработка, КлючЗаписи = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(ДанныеВерсии);
		ПараметрыМетода.Добавить(НомерВерсии);
		Если КлючЗаписи <> Неопределено Тогда
			ПараметрыМетода.Добавить(КлючЗаписи);
		КонецЕсли;
		ПараметрыМетода.Добавить(ИсключитьДанные);
		ПараметрыМетода.Добавить(СтандартнаяОбработка);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник			= ПараметрыМетода[0];
		ДанныеВерсии		= ПараметрыМетода[1];
		НомерВерсии			= ПараметрыМетода[2];
		Если КлючЗаписи <> Неопределено Тогда
			КлючЗаписи				= ПараметрыМетода[3];
			ИсключитьДанные			= ПараметрыМетода[4];
			СтандартнаяОбработка	= ПараметрыМетода[5];
		Иначе
			ИсключитьДанные			= ПараметрыМетода[3];
			СтандартнаяОбработка	= ПараметрыМетода[4];
		КонецЕсли;
	Исключение
		ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс