#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты
		.ДобавитьТестовыйНабор("ПреобразоватьДатуИзСтрокиПоФормату (0_0_0)")
			.ДобавитьСерверныйТест("ТестДолженПарситьISOБезМиллисекунд")
			.ДобавитьСерверныйТест("ТестДолженИгнорироватьМиллисекунды")
			.ДобавитьСерверныйТест("ТестДолженОбрабатыватьПустыеЗначения");

КонецПроцедуры

#КонецОбласти


#Область Тесты

Процедура ТестДолженПарситьISOБезМиллисекунд() Экспорт

	ИсходнаяСтрока = "2024-01-02T03:04:05";
	ОжидаемаяДата = Дата(2024, 1, 2, 3, 4, 5);

	Результат = пбп_СтроковыеФункцииКлиентСервер.ПреобразоватьДатуИзСтрокиПоФормату(ИсходнаяСтрока, "0_0_0");

	ЮТест.ОжидаетЧто(Тип(Результат)).Равно(Тип("Дата"));
	ЮТест.ОжидаетЧто(Результат).Равно(ОжидаемаяДата);

КонецПроцедуры

Процедура ТестДолженИгнорироватьМиллисекунды() Экспорт

	ИсходнаяСтрока = "2024-01-02T03:04:05.123";
	ОжидаемаяДата = Дата(2024, 1, 2, 3, 4, 5);

	Результат = пбп_СтроковыеФункцииКлиентСервер.ПреобразоватьДатуИзСтрокиПоФормату(ИсходнаяСтрока, "0_0_0");

	ЮТест.ОжидаетЧто(Тип(Результат)).Равно(Тип("Дата"));
	ЮТест.ОжидаетЧто(Результат).Равно(ОжидаемаяДата);

КонецПроцедуры

Процедура ТестДолженОбрабатыватьПустыеЗначения() Экспорт

	ПустаяДата = Дата(1, 1, 1, 0, 0, 0);

	Результат1 = пбп_СтроковыеФункцииКлиентСервер.ПреобразоватьДатуИзСтрокиПоФормату("", "0_0_0");
	Результат2 = пбп_СтроковыеФункцииКлиентСервер.ПреобразоватьДатуИзСтрокиПоФормату("2024-01-02T03:04:05", "");

	ЮТест.ОжидаетЧто(Результат1).Равно(ПустаяДата);
	ЮТест.ОжидаетЧто(Результат2).Равно(ПустаяДата);

КонецПроцедуры

#КонецОбласти
