// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПредопределенныеЗначенияИнтегрируемыеСистемы() Экспорт
	
	Результат = ТаблицаПредопределенныхИнтегрируемыеСистемы();
	
	// Добавление
	НоваяСистема = Результат.Добавить();
	НоваяСистема.Наименование = "Система N";
	НоваяСистема.ИдентификаторНастройки = "СистемаN";
	// КонецДобавления
	
	Возврат Результат;
	
КонецФункции

Функция ПредопределенныеЗначенияМетодыИнтеграции() Экспорт
	
	Результат = ТаблицаПредопределенныхМетодыИнтеграции();
	
	// Добавление
	НовыйМетод = Результат.Добавить();
	НовыйМетод.Наименование = "Метод интеграции системы N";
	НовыйМетод.ИдентификаторНастройки = "МетодИнтеграцииСистемыN";
	// КонецДобавления
	
	Возврат Результат;
	
КонецФункции

Функция ПредопределенныеЗначенияНастройкиИнтеграции() Экспорт
	
	Результат = ТаблицаПредопределенныхНастройкиИнтеграции();
	
	// Добавление
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Интеграция с системой N";
	НоваяНастройка.ИдентификаторНастройки = "ИнтеграцияССистемойN";
	// КонецДобавления
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаПредопределенныхИнтегрируемыеСистемы()
	
	Результат = Новый ТаблицаЗначений;
	
	пбп_ПредопределенныеЗначенияПереопределяемый.ОбщиеКолонкиТаблицыПредопределенныхЗначений(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаПредопределенныхМетодыИнтеграции()
	
	Результат = Новый ТаблицаЗначений;
	
	пбп_ПредопределенныеЗначенияПереопределяемый.ОбщиеКолонкиТаблицыПредопределенныхЗначений(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаПредопределенныхНастройкиИнтеграции()
	
	Результат = Новый ТаблицаЗначений;
	
	пбп_ПредопределенныеЗначенияПереопределяемый.ОбщиеКолонкиТаблицыПредопределенныхЗначений(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли