////////////////////////////////////////////////////////////////////////////////
// Работа со строками (клиент, сервер): Модуль содержит методы работы со строками.

#Область ПрограммныйИнтерфейс

// Процедура разбирает строку с разделителями и упаковывает значения в массив.
// 
// Параметры:
//  ИсходнаяСтрока  - Строка
//  Разделитель     - Строка
//  ПоНарастающей   - Булево (По умолчанию = Ложь) .
//
// ВозвращаемоеЗначение:
//  Массив
// 
Функция РазобратьСтрокуСРазделителями(ИсходнаяСтрока, Разделитель, ПоНарастающей = Ложь) Экспорт
	
	РезМассив = Новый Массив;
	
	Список = __ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(ИсходнаяСтрока, Разделитель);
	Если ПоНарастающей Тогда
		НарастающаяСтрока = "";
		Для каждого СтрокаСписка Из Список Цикл
			НарастающаяСтрока = ?(ПустаяСтрока(НарастающаяСтрока), СтрокаСписка, НарастающаяСтрока + "." + СтрокаСписка);
			РезМассив.Добавить(НарастающаяСтрока);
		КонецЦикла; 
	Иначе
		РезМассив = Список;
	КонецЕсли;
	
	Возврат РезМассив;
	
КонецФункции // РазобратьСтрокуСРазделителями()

// Функция возвращает текст с добавлением/удаление разделителя "|".
// 
// Параметры:
//  Текст    - Строка.
//  Добавить - Булево.
// 
// Возвращаемое значение:
//  ТекстНов - Строка.
// 
Функция УбратьДобавитьПалки(Текст, Добавить = Ложь) Экспорт
	
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст(Текст);
	КолСтрок = ТекстДок.КоличествоСтрок();
	
	Если Добавить Тогда
		
		Для н = 1 По КолСтрок Цикл
		
			ТекСтр = ТекстДок.ПолучитьСтроку(н);
			
			Если н = 1 Тогда
				ТекСтр = """" + ТекСтр;
			Иначе
				
				// Для строковых литералов делаем двойные кавычки.
				ТекСтр = СтрЗаменить(ТекСтр, """", """""");
				
				// Добавляем переносы строк
				ТекСтр = "|"+ТекСтр;
				
				Если н = КолСтрок Тогда
					ТекСтр = ТекСтр + """";
				КонецЕсли;
				
			КонецЕсли;
			
			ТекстДок.ЗаменитьСтроку(н, ТекСтр);
		КонецЦикла;
	Иначе
		
		Для н = 1 По КолСтрок Цикл
		
			ТекСтр = ТекстДок.ПолучитьСтроку(н);
			
			Если н = 1 Тогда
				
				// Убираем первую кавычку
				ТекСтр = Сред(ТекСтр, 2);
			ИначеЕсли н = КолСтрок Тогда
				
				// Убираем последнюю кавычку
				ТекСтр = Сред(ТекСтр, 1, СтрДлина(ТекСтр) - 1);
			КонецЕсли; 
			
				// Для строковых литералов заменям двойную кавычку на одинарную.
				ТекСтр = СтрЗаменить(ТекСтр, """""", """");
			
			ТекСтр = СтрЗаменить(ТекСтр, "|", "");
			
			ТекстДок.ЗаменитьСтроку(н, ТекСтр);
			
		КонецЦикла;
	КонецЕсли;
	
	ТекстНов = ТекстДок.ПолучитьТекст();
	// Убираем перенос последней строки
	ТекстНов = Сред(ТекстНов, 1, СтрДлина(ТекстНов) - 1);
	
	Возврат ТекстНов;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
