////////////////////////////////////////////////////////////////////////////////
// Документы событие "При копировании" (вызов сервера): обработка событий при копировании

#Область ПрограммныйИнтерфейс

Процедура ДокументыПриКопировании(Источник, ОбъектКопирования) Экспорт
		
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ИмяМетода = bit_ОбщегоНазначенияПовтИсп.ДокументыПриКопировании().Получить(ТипЗнч(Источник));
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			Выполнить(СтрШаблон("%1(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)", ИмяМетода));
		Исключение
			ВызватьИсключение СтрШаблон("%1%2Имя метода: %3", ОписаниеОшибки(), Символы.ПС, ИмяМетода);
		КонецПопытки;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти