////////////////////////////////////////////////////////////////////////////////
// Работа с диалогами (клиент): для клиентских методов работы с диалогами.

#Область ПрограммныйИнтерфейс

// Осуществляет выбор составного типа из списка в управляемой форме.
//
// Параметры:
//  ТекущаяФорма  - Форма
//  ЭлементВладелец - ЭлементУправления
//  Контейнер     - Объект,СтрокаТабличнойЧасти
//  ИмяРеквизита  - Строка
//  СписокВыбора  - Список с типами, которые выбираем
//  СтандартнаяОбработка - Булево
//
Процедура НачалоВыбораСоставного(ТекущаяФорма
								,ЭлементВладелец
								,Контейнер
								,ИмяРеквизита
								,СписокВыбора
								,СтандартнаяОбработка) Экспорт
	
	Если Контейнер = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементВладелец.ВыбиратьТип = Ложь;
	
	ТекущееЗначение = Контейнер[ИмяРеквизита];
	Если ТекущееЗначение = Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		ЭлементВладелец.ВыбиратьТип = Истина;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Контейнер", Контейнер);
		ДополнительныеПараметры.Вставить("ИмяРеквизита", ИмяРеквизита);
		ДополнительныеПараметры.Вставить("ЭлементВладелец", ЭлементВладелец);
		ДополнительныеПараметры.Вставить("СтандартнаяОбработка", СтандартнаяОбработка);
		ТекущаяФорма.ПоказатьВыборИзСписка(
			Новый ОписаниеОповещения("НачалоВыбораСоставного_Завершение", ЭтотОбъект, ДополнительныеПараметры), СписокВыбора);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
