////////////////////////////////////////////////////////////////////////////////
// Работа с диалогами (клиент): для клиентских методов работы с диалогами.

#Область ПрограммныйИнтерфейс

// Процедура осуществляет выбор составного типа из списка в управляемой форме. 
//
// Параметры:
//  ТекущаяФорма  - Форма
//  ЭлементВладелец - ЭлементУправления
//  Контейнер     - Объект,СтрокаТабличнойЧасти
//  ИмяРеквизита  - Строка
//  СписокВыбора  - Список с типами, которые выбираем
//  СтандартнаяОбработка - Булево
//
Процедура НачалоВыбораСоставного(ТекущаяФорма
								,ЭлементВладелец
								,Контейнер
								,ИмяРеквизита
								,СписокВыбора
								,СтандартнаяОбработка) Экспорт
	
	Если Контейнер = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущееЗначение = Контейнер[ИмяРеквизита];
	
	ЭлементВладелец.ВыбиратьТип = Ложь;  
	
	Если ТекущееЗначение = Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		ЭлементВладелец.ВыбиратьТип = Истина;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Контейнер", Контейнер);
		ДопПараметры.Вставить("ИмяРеквизита", ИмяРеквизита);
		ДопПараметры.Вставить("ЭлементВладелец", ЭлементВладелец);
		ДопПараметры.Вставить("СтандартнаяОбработка", СтандартнаяОбработка);
		Оп = Новый ОписаниеОповещения("НачалоВыбораСоставного_Завершение", ЭтотОбъект, ДопПараметры);
		ТекущаяФорма.ПоказатьВыборИзСписка(Оп, СписокВыбора);//, ЭлементВладелец, ТекущееЗначение);
		
	КонецЕсли; // Текущее значение неопределено.
	
КонецПроцедуры // НачалоВыбораСоставного()

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
