// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

#Область Общие

// При установке нового номера
//
// Параметры:
//  Источник			 - 	 - 
//  СтандартнаяОбработка - 	 - 
//  Префикс				 - 	 - 
//
Процедура ПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Событие = "ПриУстановкеНовогоНомера";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПриУстановкеНовогоКодаИлиНомера(ИмяМетода, Источник, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// При установке нового кода
//
// Параметры:
//  Источник			 - 	 - 
//  СтандартнаяОбработка - 	 - 
//  Префикс				 - 	 - 
//
Процедура ПриУстановкеНовогоКода(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Событие = "ПриУстановкеНовогоКода";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПриУстановкеНовогоКодаИлиНомера(ИмяМетода, Источник, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// При копировании
// Используется для:
//  Справочников, документов, внешних источников данных, планов видов характеристик,
//  планов счетов, планов вида расчета, планов обмена, бизнес-процессов, задач
//
// Параметры:
//  Источник			 - 	 - 
//  ОбъектКопирования	 - 	 - 
//
Процедура ПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	Событие = "ПриКопировании";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(ОбъектКопирования);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка заполнения
// Используется для:
//  Справочников, документов, внешних источников данных, планов видов характеристик,
//  планов счетов, планов вида расчета, планов обмена, бизнес-процессов, задач
//
// Параметры:
//  Источник			 - 	 - 
//  ДанныеЗаполнения	 - 	 - 
//  ТекстЗаполнения		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаЗаполнения";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(ДанныеЗаполнения);
			ПараметрыМетода.Добавить(ТекстЗаполнения);
			ПараметрыМетода.Добавить(СтандартнаяОбработка);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник			= ПараметрыМетода[0];
			ДанныеЗаполнения	= ПараметрыМетода[1];
			ТекстЗаполнения		= ПараметрыМетода[2];
			Если Не ПараметрыМетода[3] Тогда
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Перед записью
// Используется для:
//  Справочников, документов, внешних источников данных, планов видов характеристик,
//  планов счетов, планов вида расчета, планов обмена, бизнес-процессов, задач
//
// Параметры:
//  Источник		 - 	 - 
//  Отказ			 - 	 - 
//  РежимЗаписи		 - 	 - 
//  РежимПроведения	 - 	 - 
//
Процедура ПередЗаписью(Источник, Отказ, РежимЗаписи = Неопределено, РежимПроведения = Неопределено) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Событие = "ПередЗаписью";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(Отказ);
			Если ЗначениеЗаполнено(РежимЗаписи) Тогда
				ПараметрыМетода.Добавить(РежимЗаписи);
			КонецЕсли;
			Если ЗначениеЗаполнено(РежимПроведения) Тогда
				ПараметрыМетода.Добавить(РежимПроведения);
			КонецЕсли;
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник = ПараметрыМетода[0];
			Если ПараметрыМетода[1] Тогда
				Отказ = Истина;
			КонецЕсли;
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// При записи
// Используется для:
//  Справочников, документов, внешних источников данных, планов видов характеристик,
//  планов счетов, планов вида расчета, планов обмена, бизнес-процессов, задач
//
// Параметры:
//  Источник - 	 - 
//  Отказ	 - 	 - 
//
Процедура ПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Событие = "ПриЗаписи";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ВыпонитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// Перед удалением
// Используется для:
//  Справочников, документов, внешних источников данных, планов видов характеристик,
//  планов счетов, планов вида расчета, планов обмена, бизнес-процессов, задач
//
// Параметры:
//  Источник - 	 - 
//  Отказ	 - 	 - 
//
Процедура ПередУдалением(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Событие = "ПередУдалением";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ВыпонитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// Обработка проведения
// Используется только для документов
//
// Параметры:
//  Источник		 - 	 - 
//  Отказ			 - 	 - 
//  РежимПроведения	 - 	 - 
//
Процедура ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Событие = "ОбработкаПроведения";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(Отказ);
			ПараметрыМетода.Добавить(РежимПроведения);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник = ПараметрыМетода[0];
			Если ПараметрыМетода[1] Тогда
				Отказ = Истина;
			КонецЕсли;
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка удаления проведения
// Используется только для документов
//
// Параметры:
//  Источник - 	 - 
//  Отказ	 - 	 - 
//
Процедура ОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Событие = "ПередУдалением";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ВыпонитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// Обработка проверки заполнения
// Используется для:
//  Справочников, документов, внешних источников данных, планов видов характеристик,
//  планов счетов, планов вида расчета, бизнес-процессов, задач
//
// Параметры:
//  Источник			 - 	 - 
//  Отказ				 - 	 - 
//  ПроверяемыеРеквизиты - 	 - 
//
Процедура ОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Событие = "ОбработкаПроверкиЗаполнения";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(Отказ);
			ПараметрыМетода.Добавить(ПроверяемыеРеквизиты);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник = ПараметрыМетода[0];
			Если ПараметрыМетода[1] Тогда
				Отказ = Истина;
			КонецЕсли;
			ПроверяемыеРеквизиты = ПараметрыМетода[2];
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка формирования по версии истории данных
// Используется для:
//  Справочников, документов, внешних источников данных, планов видов характеристик,
//  планов счетов, планов вида расчета, планов обмена, бизнес-процессов, задач
//
// Параметры:
//  Источник			 - 	 - 
//  ДанныеВерсии		 - 	 - 
//  НомерВерсии			 - 	 - 
//  ИсключитьДанные		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаФормированияПоВерсииИсторииДанных(Источник,
	ДанныеВерсии, НомерВерсии, ИсключитьДанные, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаФормированияПоВерсииИсторииДанных";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(ДанныеВерсии);
			ПараметрыМетода.Добавить(НомерВерсии);
			ПараметрыМетода.Добавить(ИсключитьДанные);
			ПараметрыМетода.Добавить(СтандартнаяОбработка);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник		= ПараметрыМетода[0];
			ДанныеВерсии	= ПараметрыМетода[1];
			НомерВерсии		= ПараметрыМетода[2];
			ИсключитьДанные	= ПараметрыМетода[3];
			Если Не ПараметрыМетода[4] Тогда
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка интерактивной активации
//  Использовается для: бизнес-процессов, задач
//
// Параметры:
//  Источник			 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаИнтерактивнойАктивации(Источник, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаИнтерактивнойАктивации";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(СтандартнаяОбработка);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник = ПараметрыМетода[0];
			Если Не ПараметрыМетода[1] Тогда
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // Общие

#Область Задачи

// Обработка проверки выполнения
// Используется только для задач
//
// Параметры:
//  Источник	 - 	 - 
//  Результат	 - 	 - 
//
Процедура ОбработкаПроверкиВыполнения(Источник, Результат) Экспорт
	
	Событие = "ОбработкаПроверкиВыполнения";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(Результат);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник = ПараметрыМетода[0];
			Если ПараметрыМетода[1] Тогда
				Отказ = Истина;
			КонецЕсли;
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Перед выполнением
// Используется только для задач
//
// Параметры:
//  Источник - 	 - 
//  Отказ	 - 	 - 
//
Процедура ПередВыполнением(Источник, Отказ) Экспорт
	
	Событие = "ПередВыполнением";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ВыпонитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// Перед интерактивным выполнением
// Используется только для задач
//
// Параметры:
//  Источник - 	 - 
//  Отказ	 - 	 - 
//
Процедура ПередИнтерактивнымВыполнением(Источник, Отказ) Экспорт
	
	Событие = "ПередИнтерактивнымВыполнением";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ВыпонитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// При выполнении
// Используется только для задач
//
// Параметры:
//  Источник - 	 - 
//  Отказ	 - 	 - 
//
Процедура ПриВыполнении(Источник, Отказ) Экспорт
	
	Событие = "ПриВыполнении";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ВыпонитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

#КонецОбласти // Задачи

#Область ПланыОбмена

// При отправке данных подчиненному
//
// Параметры:
//  Источник				 - 	 - 
//  ЭлементДанных			 - 	 - 
//  ОтправкаЭлемента		 - 	 - 
//  СозданиеНачальногоОбраза - 	 - 
//
Процедура ПриОтправкеДанныхПодчиненному(Источник, ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза) Экспорт
	
	Событие = "ПриОтправкеДанныхПодчиненному";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПриОтправкеДанных(ИмяМетода, Источник, ЭлементДанных,
		ОтправкаЭлемента, СозданиеНачальногоОбраза);
	
КонецПроцедуры

// При отправке данных главному
//
// Параметры:
//  Источник		 - 	 - 
//  ЭлементДанных	 - 	 - 
//  ОтправкаЭлемента - 	 - 
//
Процедура ПриОтправкеДанныхГлавному(Источник, ЭлементДанных, ОтправкаЭлемента) Экспорт
	
	Событие = "ПриОтправкеДанныхГлавному";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПриОтправкеДанных(ИмяМетода, Источник, ЭлементДанных, ОтправкаЭлемента);
	
КонецПроцедуры

// При получении данных от подчиненного
//
// Параметры:
//  Источник			 - 	 - 
//  ЭлементДанных		 - 	 - 
//  ПолучениеЭлемента	 - 	 - 
//  ОтправкаНазад		 - 	 - 
//
Процедура ПриПолученииДанныхОтПодчиненного(Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад) Экспорт
	
	Событие = "ПриПолученииДанныхОтПодчиненного";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПриПолученииДанных(ИмяМетода, Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад);
	
КонецПроцедуры

// При получении данных от главного
//
// Параметры:
//  Источник			 - 	 - 
//  ЭлементДанных		 - 	 - 
//  ПолучениеЭлемента	 - 	 - 
//  ОтправкаНазад		 - 	 - 
//
Процедура ПриПолученииДанныхОтГлавного(Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад) Экспорт
	
	Событие = "ПриПолученииДанныхОтГлавного";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПриПолученииДанных(ИмяМетода, Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад);
	
КонецПроцедуры

// При отправке данных узла подчиненному
//
// Параметры:
//  Источник		 - 	 - 
//  ЭлементДанных	 - 	 - 
//  Игнорировать	 - 	 - 
//
Процедура ПриОтправкеДанныхУзлаПодчиненному(Источник, ЭлементДанных, Игнорировать) Экспорт
	
	Событие = "ПриОтправкеДанныхУзлаПодчиненному";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПриОтправкеДанныхУзла(ИмяМетода, Источник, ЭлементДанных, Игнорировать);
	
КонецПроцедуры

// При получении данных узла от главного
//
// Параметры:
//  Источник		 - 	 - 
//  ЭлементДанных	 - 	 - 
//  Игнорировать	 - 	 - 
//
Процедура ПриПолученииДанныхУзлаОтГлавного(Источник, ЭлементДанных, Игнорировать) Экспорт
	
	Событие = "ПриПолученииДанныхУзлаОтГлавного";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПриОтправкеДанныхУзла(ИмяМетода, Источник, ЭлементДанных, Игнорировать);
	
КонецПроцедуры

// При автоматическом создании нового узла
//
// Параметры:
//  Источник - 	 - 
//  Отказ	 - 	 - 
//
Процедура ПриАвтоматическомСозданииНовогоУзла(Источник, Отказ) Экспорт
	
	Событие = "ПриАвтоматическомСозданииНовогоУзла";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ВыпонитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// Перед созданием начального образа
//
// Параметры:
//  Источник				 - 	 - 
//  ТолькоЗарегистрированные - 	 - 
//  ПотокОбменаДанными		 - 	 - 
//
Процедура ПередСозданиемНачальногоОбраза(Источник, ТолькоЗарегистрированные, ПотокОбменаДанными) Экспорт
	
	Событие = "ПередСозданиемНачальногоОбраза";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(ТолькоЗарегистрированные);
			ПараметрыМетода.Добавить(ПотокОбменаДанными);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		Исключение
			ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Перед началом отправки данных подчиненному
//
// Параметры:
//  Источник			 - 	 - 
//  ПотокОбменаДанными	 - 	 - 
//
Процедура ПередНачаломОтправкиДанныхПодчиненному(Источник, ПотокОбменаДанными) Экспорт
	
	Событие = "ПередНачаломОтправкиДанныхПодчиненному";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПередНачаломОтправкиДанных(ИмяМетода, Источник, ПотокОбменаДанными);
	
КонецПроцедуры

// Перед началом отправки данных главному
//
// Параметры:
//  Источник			 - 	 - 
//  ПотокОбменаДанными	 - 	 - 
//
Процедура ПередНачаломОтправкиДанныхГлавному(Источник, ПотокОбменаДанными) Экспорт
	
	Событие = "ПередНачаломОтправкиДанныхГлавному";
	ИмяМетода = ПолучитьИмяМетода(Источник, Событие);
	
	ПередНачаломОтправкиДанных(ИмяМетода, Источник, ПотокОбменаДанными);
	
КонецПроцедуры

#КонецОбласти // ПланыОбмена

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьИмяМетода(Источник, Событие) Экспорт
	
	МетодСоответствия = пбп_ОбщегоНазначенияСервер
		.ПолучитьИмяФункцииСоответствияОбработчиковСобытий(Источник, Событие);
	
	СоответствиеОбработчиков = пбп_ОбщегоНазначенияПовтИсп
		.ПолучитьСоответствиеСуществующихОбработчиковСобытий(МетодСоответствия);
	
	ИмяМетода = СоответствиеОбработчиков.Получить(ТипЗнч(Источник));
	
	Возврат ИмяМетода;
	
КонецФункции

Функция ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки)
	
	ТекстОшибки = СтрШаблон("ru = '%1%2Имя метода: %3';en = '%1%2Method name: %3'",
		ОписаниеОшибки, Символы.ПС, ИмяМетода);
	
	Возврат НСтр(ТекстОшибки);
	
КонецФункции

Процедура ПриУстановкеНовогоКодаИлиНомера(ИмяМетода, Источник, СтандартнаяОбработка, Префикс)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(СтандартнаяОбработка);
		ПараметрыМетода.Добавить(Префикс);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
	Исключение
		ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыпонитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(Отказ);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник = ПараметрыМетода[0];
		Если ПараметрыМетода[1] Тогда
			Отказ = Истина;
		КонецЕсли;
	Исключение
		ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПриОтправкеДанных(ИмяМетода, Источник, ЭлементДанных,
	ОтправкаЭлемента, СозданиеНачальногоОбраза = Неопределено)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(ЭлементДанных);
		ПараметрыМетода.Добавить(ОтправкаЭлемента);
		Если СозданиеНачальногоОбраза <> Неопределено Тогда
			ПараметрыМетода.Добавить(СозданиеНачальногоОбраза);
		КонецЕсли;
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник			= ПараметрыМетода[0];
		ЭлементДанных		= ПараметрыМетода[1];
		ОтправкаЭлемента	= ПараметрыМетода[2];
		Если СозданиеНачальногоОбраза <> Неопределено Тогда
			СозданиеНачальногоОбраза = ПараметрыМетода[3];
		КонецЕсли;
	Исключение
		ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПриПолученииДанных(ИмяМетода, Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(ЭлементДанных);
		ПараметрыМетода.Добавить(ПолучениеЭлемента);
		ПараметрыМетода.Добавить(ОтправкаНазад);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник			= ПараметрыМетода[0];
		ЭлементДанных		= ПараметрыМетода[1];
		ПолучениеЭлемента	= ПараметрыМетода[2];
		ОтправкаНазад		= ПараметрыМетода[3];
	Исключение
		ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПриОтправкеДанныхУзла(ИмяМетода, Источник, ЭлементДанных, Игнорировать)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(ЭлементДанных);
		ПараметрыМетода.Добавить(Игнорировать);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник			= ПараметрыМетода[0];
		ЭлементДанных		= ПараметрыМетода[1];
		Игнорировать		= ПараметрыМетода[2];
	Исключение
		ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПередНачаломОтправкиДанных(ИмяМетода, Источник, ПотокОбменаДанными)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(ПотокОбменаДанными);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
	Исключение
		ВызватьИсключение ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции