// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

// При установке нового номера
//
// Параметры:
//  Источник			 - ДокументОбъект, БизнесПроцессОбъект, ЗадачаОбъект - источник подписки на событие
//  СтандартнаяОбработка - Булево	 - стандартная обработка
//  Префикс				 - Строка	 - префикс, который будет использоваться при генерации номера
//
Процедура ПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Событие = "ПриУстановкеНовогоНомера";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ПриУстановкеНовогоКодаИлиНомера(ИмяМетода, Источник, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// При установке нового кода
//
// Параметры:
//  Источник			 - СправочникОбъект, ПланВидовХарактеристикОбъект, ПланОбменаОбъект - источник подписки на событие
//  СтандартнаяОбработка - Булево	 - стандартная обработка
//  Префикс				 - Строка	 - префикс, который будет использоваться при генерации номера
//
Процедура ПриУстановкеНовогоКода(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Событие = "ПриУстановкеНовогоКода";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ПриУстановкеНовогоКодаИлиНомера(ИмяМетода, Источник, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// При копировании
//
// Параметры:
//  Источник			 - СправочникОбъект, ДокументОбъект, ПланВидовХарактеристикОбъект, ПланСчетовОбъект,
// ПланВидовРасчетаОбъект, ПланОбменаОбъект, БизнесПроцессОбъект, ЗадачаОбъект - источник подписки на событие
//  ОбъектКопирования	 - СправочникОбъект, ДокументОбъект, ПланВидовХарактеристикОбъект, ПланСчетовОбъект,
// ПланВидовРасчетаОбъект, ПланОбменаОбъект, БизнесПроцессОбъект, ЗадачаОбъект - исходный элемент для копирования
//
Процедура ПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	Событие = "ПриКопировании";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(ОбъектКопирования);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		Исключение
			ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка заполнения
//
// Параметры:
//  Источник			 - СправочникОбъект, ДокументОбъект, ПланВидовХарактеристикОбъект, ПланСчетовОбъект,
// ПланВидовРасчетаОбъект, ПланОбменаОбъект, БизнесПроцессОбъект, ЗадачаОбъект - источник подписки на событие
//  ДанныеЗаполнения	 - Произвольный	 - данные заполнения
//  ТекстЗаполнения		 - Строка		 - текст заполнения
//  СтандартнаяОбработка - Булево		 - стандартная обработка
//
Процедура ОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаЗаполнения";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	пбп_ОбработкаСобытий.ОбработкаЗаполнения(ИмяМетода, Источник,
		ДанныеЗаполнения, СтандартнаяОбработка, ТекстЗаполнения);
	
КонецПроцедуры

// Перед записью
//
// Параметры:
//  Источник		 - СправочникОбъект, КонстантаМенеджерЗначения, ДокументОбъект, ПланВидовХарактеристикОбъект,
// ПланСчетовОбъект, ПланВидовРасчетаОбъект, ПланОбменаОбъект, БизнесПроцессОбъект, ЗадачаОбъект - источник подписки на событие
//  Отказ			 - Булево					 - отказ
//  РежимЗаписи		 - РежимЗаписиДокумента		 - режим записи документа
//  РежимПроведения	 - РежимПроведенияДокумента	 - режим проведения документа
//
Процедура ПередЗаписью(Источник, Отказ, РежимЗаписи = Неопределено, РежимПроведения = Неопределено) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Событие = "ПередЗаписью";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(Отказ);
			Если ЗначениеЗаполнено(РежимЗаписи) Тогда
				ПараметрыМетода.Добавить(РежимЗаписи);
			КонецЕсли;
			Если ЗначениеЗаполнено(РежимПроведения) Тогда
				ПараметрыМетода.Добавить(РежимПроведения);
			КонецЕсли;
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник = ПараметрыМетода[0];
			Если ПараметрыМетода[1] Тогда
				Отказ = Истина;
			КонецЕсли;
		Исключение
			ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// При записи
//
// Параметры:
//  Источник - СправочникОбъект, КонстантаМенеджерЗначения, ДокументОбъект, ПланВидовХарактеристикОбъект,
// ПланСчетовОбъект, ПланВидовРасчетаОбъект, ПланОбменаОбъект, БизнесПроцессОбъект, ЗадачаОбъект - источник подписки на событие
//  Отказ	 - Булево	 - отказ
//
Процедура ПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Событие = "ПриЗаписи";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ВыпонитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// Перед удалением
//
// Параметры:
//  Источник - СправочникОбъект, ДокументОбъект, ПланВидовХарактеристикОбъект, ПланСчетовОбъект,
// ПланВидовРасчетаОбъект, ПланОбменаОбъект, БизнесПроцессОбъект, ЗадачаОбъект - источник подписки на событие
//  Отказ	 - Булево	 - отказ
//
Процедура ПередУдалением(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Событие = "ПередУдалением";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ВыпонитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// Обработка проведения
//
// Параметры:
//  Источник		 - ДокументОбъект			 - источник подписки на событие
//  Отказ			 - Булево					 - отказ
//  РежимПроведения	 - РежимПроведенияДокумента	 - режим проведения документа
//
Процедура ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Событие = "ОбработкаПроведения";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(Отказ);
			ПараметрыМетода.Добавить(РежимПроведения);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник = ПараметрыМетода[0];
			Если ПараметрыМетода[1] Тогда
				Отказ = Истина;
			КонецЕсли;
		Исключение
			ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Обработка удаления проведения
//
// Параметры:
//  Источник		 - ДокументОбъект	 - источник подписки на событие
//  Отказ			 - Булево			 - отказ
//
Процедура ОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Событие = "ПередУдалением";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ВыпонитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// Обработка проверки заполнения
//
// Параметры:
//  Источник			 - СправочникОбъект, КонстантаМенеджерЗначения, ДокументОбъект, ПланВидовХарактеристикОбъект,
// ПланСчетовОбъект, ПланВидовРасчетаОбъект, ПланОбменаОбъект, БизнесПроцессОбъект, ЗадачаОбъект - источник подписки на событие
//  Отказ				 - Булево	 - отказ
//  ПроверяемыеРеквизиты - Массив	 - список проверяемых реквизитов
//
Процедура ОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Событие = "ОбработкаПроверкиЗаполнения";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	пбп_ОбработкаСобытий.ОбработкаПроверкиЗаполнения(ИмяМетода, Источник, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

// Обработка формирования по версии истории данных
//
// Параметры:
//  Источник			 - СправочникОбъект, КонстантаМенеджерЗначения, ДокументОбъект, ПланВидовХарактеристикОбъект,
// ПланСчетовОбъект, ПланВидовРасчетаОбъект, ПланОбменаОбъект, БизнесПроцессОбъект, ЗадачаОбъект - источник подписки на событие
//  ДанныеВерсии		 - ФиксированнаяСтруктура	 - данные версии
//  НомерВерсии			 - Число					 - номер версии
//  ИсключитьДанные		 - Массив					 - список полей, исключаемые из стандартной обработки
//  СтандартнаяОбработка - Булево					 - стандартная обработка
//
Процедура ОбработкаФормированияПоВерсииИсторииДанных(Источник,
	ДанныеВерсии, НомерВерсии, ИсключитьДанные, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаФормированияПоВерсииИсторииДанных";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	пбп_ОбработкаСобытий.ОбработкаФормированияПоВерсииИсторииДанных(ИмяМетода,
		Источник, ДанныеВерсии, НомерВерсии, ИсключитьДанные, СтандартнаяОбработка);
	
КонецПроцедуры

// Обработка интерактивной активации
//
// Параметры:
//  Источник			 - БизнесПроцессОбъект, ЗадачаОбъект - источник подписки на событие
//  СтандартнаяОбработка - Булево							 - стандартная обработка
//
Процедура ОбработкаИнтерактивнойАктивации(Источник, СтандартнаяОбработка) Экспорт
	
	Событие = "ОбработкаИнтерактивнойАктивации";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(СтандартнаяОбработка);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник = ПараметрыМетода[0];
			Если Не ПараметрыМетода[1] Тогда
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		Исключение
			ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#Область Задачи

// Обработка проверки выполнения
//
// Параметры:
//  Источник	 - ЗадачаОбъект	 - источник подписки на событие
//  Результат	 - Булево		 - результат
//
Процедура ОбработкаПроверкиВыполнения(Источник, Результат) Экспорт
	
	Событие = "ОбработкаПроверкиВыполнения";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(Результат);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
			
			Источник = ПараметрыМетода[0];
			Если ПараметрыМетода[1] Тогда
				Отказ = Истина;
			КонецЕсли;
		Исключение
			ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Перед выполнением
//
// Параметры:
//  Источник - ЗадачаОбъект	 - источник подписки на событие
//  Отказ	 - Булево		 - отказ
//
Процедура ПередВыполнением(Источник, Отказ) Экспорт
	
	Событие = "ПередВыполнением";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ВыпонитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// Перед интерактивным выполнением
//
// Параметры:
//  Источник - ЗадачаОбъект	 - источник подписки на событие
//  Отказ	 - Булево		 - отказ
//
Процедура ПередИнтерактивнымВыполнением(Источник, Отказ) Экспорт
	
	Событие = "ПередИнтерактивнымВыполнением";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ВыпонитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// При выполнении
//
// Параметры:
//  Источник - ЗадачаОбъект	 - источник подписки на событие
//  Отказ	 - Булево		 - отказ
//
Процедура ПриВыполнении(Источник, Отказ) Экспорт
	
	Событие = "ПриВыполнении";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ВыпонитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

#КонецОбласти // Задачи

#Область ПланыОбмена

// При отправке данных подчиненному
//
// Параметры:
//  Источник				 - ПланОбменаОбъект			 - источник подписки на событие
//  ЭлементДанных			 - Произвольный				 - элемент данных
//  ОтправкаЭлемента		 - ОтправкаЭлементаДанных	 - отправка элемента данных
//  СозданиеНачальногоОбраза - Булево					 - создани начального образа
//
Процедура ПриОтправкеДанныхПодчиненному(Источник, ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза) Экспорт
	
	Событие = "ПриОтправкеДанныхПодчиненному";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ПриОтправкеДанных(ИмяМетода, Источник, ЭлементДанных,
		ОтправкаЭлемента, СозданиеНачальногоОбраза);
	
КонецПроцедуры

// При отправке данных главному
//
// Параметры:
//  Источник				 - ПланОбменаОбъект			 - источник подписки на событие
//  ЭлементДанных			 - Произвольный				 - элемент данных
//  ОтправкаЭлемента		 - ОтправкаЭлементаДанных	 - отправка элемента данных
//
Процедура ПриОтправкеДанныхГлавному(Источник, ЭлементДанных, ОтправкаЭлемента) Экспорт
	
	Событие = "ПриОтправкеДанныхГлавному";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ПриОтправкеДанных(ИмяМетода, Источник, ЭлементДанных, ОтправкаЭлемента);
	
КонецПроцедуры

// При получении данных от подчиненного
//
// Параметры:
//  Источник			 - ПланОбменаОбъект			 - источник подписки на событие
//  ЭлементДанных		 - Произвольный				 - элемент данных
//  ПолучениеЭлемента	 - ПолучениеЭлементаДанных	 - получение элемента данных
//  ОтправкаНазад		 - Булево					 - отправка назад
//
Процедура ПриПолученииДанныхОтПодчиненного(Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад) Экспорт
	
	Событие = "ПриПолученииДанныхОтПодчиненного";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ПриПолученииДанных(ИмяМетода, Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад);
	
КонецПроцедуры

// При получении данных от главного
//
// Параметры:
//  Источник			 - ПланОбменаОбъект			 - источник подписки на событие
//  ЭлементДанных		 - Произвольный				 - элемент данных
//  ПолучениеЭлемента	 - ПолучениеЭлементаДанных	 - получение элемента данных
//  ОтправкаНазад		 - Булево					 - отправка назад
//
Процедура ПриПолученииДанныхОтГлавного(Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад) Экспорт
	
	Событие = "ПриПолученииДанныхОтГлавного";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ПриПолученииДанных(ИмяМетода, Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад);
	
КонецПроцедуры

// При отправке данных узла подчиненному
//
// Параметры:
//  Источник		 - ПланОбменаОбъект	 - источник подписки на событие
//  ЭлементДанных	 - Произвольный		 - элемент данных
//  Игнорировать	 - Булево			 - игнорировать
//
Процедура ПриОтправкеДанныхУзлаПодчиненному(Источник, ЭлементДанных, Игнорировать) Экспорт
	
	Событие = "ПриОтправкеДанныхУзлаПодчиненному";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ПриОтправкеДанныхУзла(ИмяМетода, Источник, ЭлементДанных, Игнорировать);
	
КонецПроцедуры

// При получении данных узла от главного
//
// Параметры:
//  Источник		 - ПланОбменаОбъект	 - источник подписки на событие
//  ЭлементДанных	 - Произвольный		 - элемент данных
//  Игнорировать	 - Булево			 - игнорировать
//
Процедура ПриПолученииДанныхУзлаОтГлавного(Источник, ЭлементДанных, Игнорировать) Экспорт
	
	Событие = "ПриПолученииДанныхУзлаОтГлавного";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ПриОтправкеДанныхУзла(ИмяМетода, Источник, ЭлементДанных, Игнорировать);
	
КонецПроцедуры

// При автоматическом создании нового узла
//
// Параметры:
//  Источник - ПланОбменаОбъект	 - источник подписки на событие
//  Отказ	 - Булево			 - отказ
//
Процедура ПриАвтоматическомСозданииНовогоУзла(Источник, Отказ) Экспорт
	
	Событие = "ПриАвтоматическомСозданииНовогоУзла";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ВыпонитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ);
	
КонецПроцедуры

// Перед созданием начального образа
//
// Параметры:
//  Источник				 - ПланОбменаОбъект		 - источник подписки на событие
//  ТолькоЗарегистрированные - Булево				 - только зарегистрированные
//  ПотокОбменаДанными		 - ПотокОбменаДанными	 - поток обмена данными
//
Процедура ПередСозданиемНачальногоОбраза(Источник, ТолькоЗарегистрированные, ПотокОбменаДанными) Экспорт
	
	Событие = "ПередСозданиемНачальногоОбраза";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		Попытка
			ПараметрыМетода = Новый Массив;
			ПараметрыМетода.Добавить(Источник);
			ПараметрыМетода.Добавить(ТолькоЗарегистрированные);
			ПараметрыМетода.Добавить(ПотокОбменаДанными);
			
			пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		Исключение
			ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Перед началом отправки данных подчиненному
//
// Параметры:
//  Источник			 - ПланОбменаОбъект		 - источник подписки на событие
//  ПотокОбменаДанными	 - ПотокОбменаДанными	 - поток обмена данными
//
Процедура ПередНачаломОтправкиДанныхПодчиненному(Источник, ПотокОбменаДанными) Экспорт
	
	Событие = "ПередНачаломОтправкиДанныхПодчиненному";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ПередНачаломОтправкиДанных(ИмяМетода, Источник, ПотокОбменаДанными);
	
КонецПроцедуры

// Перед началом отправки данных главному
//
// Параметры:
//  Источник			 - ПланОбменаОбъект		 - источник подписки на событие
//  ПотокОбменаДанными	 - ПотокОбменаДанными	 - поток обмена данными
//
Процедура ПередНачаломОтправкиДанныхГлавному(Источник, ПотокОбменаДанными) Экспорт
	
	Событие = "ПередНачаломОтправкиДанныхГлавному";
	ИмяМетода = пбп_ОбработкаСобытий.ПолучитьИмяМетода(Источник, Событие);
	
	ПередНачаломОтправкиДанных(ИмяМетода, Источник, ПотокОбменаДанными);
	
КонецПроцедуры

#КонецОбласти // ПланыОбмена

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Процедура ПриУстановкеНовогоКодаИлиНомера(ИмяМетода, Источник, СтандартнаяОбработка, Префикс)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(СтандартнаяОбработка);
		ПараметрыМетода.Добавить(Префикс);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
	Исключение
		ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыпонитьСПараметрамиИсточникИОтказ(ИмяМетода, Источник, Отказ)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(Отказ);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник = ПараметрыМетода[0];
		Если ПараметрыМетода[1] Тогда
			Отказ = Истина;
		КонецЕсли;
	Исключение
		ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПриОтправкеДанных(ИмяМетода, Источник, ЭлементДанных,
	ОтправкаЭлемента, СозданиеНачальногоОбраза = Неопределено)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(ЭлементДанных);
		ПараметрыМетода.Добавить(ОтправкаЭлемента);
		Если СозданиеНачальногоОбраза <> Неопределено Тогда
			ПараметрыМетода.Добавить(СозданиеНачальногоОбраза);
		КонецЕсли;
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник			= ПараметрыМетода[0];
		ЭлементДанных		= ПараметрыМетода[1];
		ОтправкаЭлемента	= ПараметрыМетода[2];
		Если СозданиеНачальногоОбраза <> Неопределено Тогда
			СозданиеНачальногоОбраза = ПараметрыМетода[3];
		КонецЕсли;
	Исключение
		ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПриПолученииДанных(ИмяМетода, Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(ЭлементДанных);
		ПараметрыМетода.Добавить(ПолучениеЭлемента);
		ПараметрыМетода.Добавить(ОтправкаНазад);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник			= ПараметрыМетода[0];
		ЭлементДанных		= ПараметрыМетода[1];
		ПолучениеЭлемента	= ПараметрыМетода[2];
		ОтправкаНазад		= ПараметрыМетода[3];
	Исключение
		ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПриОтправкеДанныхУзла(ИмяМетода, Источник, ЭлементДанных, Игнорировать)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(ЭлементДанных);
		ПараметрыМетода.Добавить(Игнорировать);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Источник			= ПараметрыМетода[0];
		ЭлементДанных		= ПараметрыМетода[1];
		Игнорировать		= ПараметрыМетода[2];
	Исключение
		ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПередНачаломОтправкиДанных(ИмяМетода, Источник, ПотокОбменаДанными)
	
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Источник);
		ПараметрыМетода.Добавить(ПотокОбменаДанными);
		
		пбп_Переадресация.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
	Исключение
		ВызватьИсключение пбп_ОбработкаСобытий.ПолучитьТекстОшибки(ИмяМетода, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции