
////////////////////////////////////////////////////////////////////////////////
// Общего назначения (клиент): для клиентских и серверных функций общего назначения

#Область ПрограммныйИнтерфейс

// Упаковывает ДанныеФормыКоллекция в массив структур. 
// Может использоваться для передачи таблицы между клиентом и сервером.
//
// Параметры:
//  ДанныеФормыКоллекция - ДанныеФормыКоллекция - Данные формы коллекции
//  ИменаКолонок		 - Массив - Массив колонок.
// 
// Возвращаемое значение:
// Массив - Массив структур.
//
Функция УпаковатьДанныеФормыКоллекция(ДанныеФормыКоллекция, ИменаКолонок) Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ДанныеФормыКоллекция Цикл
		
		МодельСтроки = Новый Структура;
		
		Для Каждого Элемент Из ИменаКолонок Цикл
			
			Если ТипЗнч(ИменаКолонок) = Тип("Структура") Тогда
				ИмяКолонки = Элемент.Ключ;
			Иначе
				ИмяКолонки = Элемент;
			КонецЕсли;
			
			МодельСтроки.Вставить(ИмяКолонки, СтрокаТаблицы[ИмяКолонки]);
			
		КонецЦикла;
		
		Результат.Добавить(МодельСтроки);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Разбирает строку с разделителями и упаковывает значения в массив.
//
// Параметры:
//  ИсходнаяСтрока	 - Строка - Исходная строка.
//  Разделитель		 - Строка - Разделитель.
// 
// Возвращаемое значение:
// Массив - Массив подстрок.
//
Функция РазобратьСтрокуСРазделителями(ИсходнаяСтрока, Разделитель = ",") Экспорт
	
	Результат = Новый Массив;
	
	// Разделитель бывает длиной строки > 1, учитывая особенность "СтрЗаменить",
	// заменим его на редкий односимвольный разделитель - Символ(9786).
	Сепаратор = Символ(9786);
	Образец = СтрЗаменить(ИсходнаяСтрока, Разделитель, Сепаратор);
	Результат = СтрРазделить(Образец, Сепаратор, Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
