// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

// Процедура - Формирование таблицы
//
// Параметры:
//  АдресВХранилище	 - Строка - Адрес файла во временном хранилище
//  Расширение		 - Строка - Расширение файла (xls, xlsx)
//  ПараметрыЧтения	 - Структура - структура параметров загрузки Excel-файла
//  см. пбп_ЗагрузкаФайлаЧерезТабличныйДокументСервер.ПолучитьПараметрыЧтенияФайла
//
Процедура ФормированиеТаблицы(АдресВХранилище, Расширение, ПараметрыЧтения) Экспорт
	
	ТаблицаСвойств = ПолучитьИзВременногоХранилища(ПараметрыЧтения.АдресМакета);
	
	ТаблицаДанных = пбп_ЗагрузкаФайлаЧерезТабличныйДокументСервер
		.КонвертироватьДанныеТабличногоДокументаВТаблицуЗначений(
		АдресВХранилище, Расширение, ТаблицаСвойств, ПараметрыЧтения);
	
	ПоместитьВоВременноеХранилище(ТаблицаДанных, ПараметрыЧтения.АдресПомещения);
	
КонецПроцедуры

// Функция - Поместить заглушку
//
// Параметры:
//  Макет - Строка - Адрес временного хранилища, где находится таблица значений со списком колонок загружаемого файла
// 
// Возвращаемое значение:
//  - Строка - Адрес файла во временном хранилище
//
Функция ПоместитьЗаглушку(Макет) Экспорт
	
	Заглушка = Новый ТаблицаЗначений;
	
	МакетТаблица = ПолучитьИзВременногоХранилища(Макет);
	
	Для Каждого КолонкаТаблицы Из МакетТаблица Цикл
		Заглушка.Колонки.Добавить(КолонкаТаблицы.ИмяКолонки, Новый ОписаниеТипов(КолонкаТаблицы.ТипЗначения));
	КонецЦикла;
	
	ИД = ПоместитьВоВременноеХранилище(Заглушка, Новый УникальныйИдентификатор);
	
	Возврат ИД;
	
КонецФункции

// Инициализирует таблицу со свойствами колонок загружаемого файла
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица готовая для заполнения данных колонок
//
Функция ИнициализироватьТаблицуСоСвойствамиКолонок() Экспорт
	
	Возврат пбп_ЗагрузкаФайлаЧерезТабличныйДокументСервер.ИнициализироватьТаблицуСоСвойствамиКолонок();
	
КонецФункции

// Получить параметры чтения файла
// 
// Возвращаемое значение:
//  Структура - см. пбп_ЗагрузкаФайлаЧерезТабличныйДокументСервер.ПолучитьПараметрыЧтенияФайла
//
Функция ПолучитьПараметрыЧтенияФайла() Экспорт
	
	Возврат пбп_ЗагрузкаФайлаЧерезТабличныйДокументСервер.ПолучитьПараметрыЧтенияФайла();
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс