// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ПоказатьОписаниеФункции", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует описание функции или группы функций.
// 
// Параметры:
// 	Ссылка - СправочникСсылка.пбп_ПользовательскиеФункции.
//
&НаСервере
Процедура ПоказатьОписаниеФункцииСервер(Ссылка, ЭтоГруппа)
	
	Если ЭтоГруппа Тогда
		ПолеОписания = Справочники.пбп_ПользовательскиеФункции.СформироватьОписаниеФункций(Ссылка, ЭтоГруппа);
	Иначе
		Результат = Справочники.пбп_ПользовательскиеФункции.ПолучитьНазваниеПодпрограммыСПараметрами(Ссылка, ЭтоГруппа, Истина);
		Элементы.ДекорацияНазваниеСПараметрами.Заголовок = Результат[0].НазваниеСПараметрами;
		ПолеОписания = Результат[0].ОписаниеПараметров;
	КонецЕсли;
	
	Элементы.ГруппаШапкаФункции.Видимость = Не ЭтоГруппа;
	Элементы.ГруппаПодвалФункции.Видимость = Не ЭтоГруппа;
	
КонецПроцедуры

// Обработчик ожидания активизации строки.
//
&НаКлиенте
Процедура ПоказатьОписаниеФункции()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьОписаниеФункцииСервер(ТекущиеДанные.Ссылка, ТекущиеДанные.ЭтоГруппа);
	
КонецПроцедуры

#КонецОбласти

