// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавить запись.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров Для записи. Ключи:
//   * ИнтегрируемаяСистема	 - СправочникСсылка.пбп_ИнтегрируемыеСистемы	 - интегрируемая система
//   * Организация			 - ОпределяемыйТип.пбп_Организации				 - организация, которой назначен токен
//   * Пользователь			 - Строка										 - пользователь системы, которому назначен токен
//   * ВнешнийПользователь	 - Строка										 - идентификатор пользователя внешней системы.
// Идентификатором может являтся: логин, внутренний идентификатор, clientID и т.д.
//   * Сущность				 - ПеречислениеСсылка.пбп_СущностиАвторизации	 - секрет клиента, авто-код, сгенерированный
// другой системой для получения токенов доступа и обновления или токен доступа/обновления
//   * Значение				 - ХранилищеЗначения или Строка					 - значение. Если передана строка,
// то она будет помещена в ХранилищеЗначений
//   * СтрокЖизниДо			 - Дата											 - дата время до которой живет значение
//
Процедура ДобавитьЗапись(ПараметрыЗаписи) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.ИнтегрируемаяСистема) Тогда
		ВызватьИсключение НСтр("ru='Не указана интегрируемая система'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.ВнешнийПользователь) Тогда
		ВызватьИсключение НСтр("ru='Не указан внешний пользователь'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.Сущность) Тогда
		ВызватьИсключение НСтр("ru='Не указана сущность авторизации'");
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		
		ИсключаемыеСвойства = "";
		ЗначениеВХранилище = Неопределено;
		Если ТипЗнч(ПараметрыЗаписи.Значение) = Тип("Строка") Тогда
			ИсключаемыеСвойства = СтрСоединить("Значение", ",");
			ЗначениеВХранилище = Новый ХранилищеЗначения(ПараметрыЗаписи.Значение);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыЗаписи, , ИсключаемыеСвойства);
		Если ЗначениеВХранилище <> Неопределено Тогда
			МенеджерЗаписи.Значение = ЗначениеВХранилище;
		КонецЕсли;
		
		МенеджерЗаписи.Записать();
	Исключение
		ТекстСообщения = НСтр("ru='Ошибка добавления записи токенов интегрируемых систем'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, 
			, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Изменить запись.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров Для записи. Ключи:
//   * ИнтегрируемаяСистема	 - СправочникСсылка.пбп_ИнтегрируемыеСистемы	 - интегрируемая система
//   * Организация			 - ОпределяемыйТип.пбп_Организации				 - организация, которой назначен токен
//   * Пользователь			 - Строка										 - пользователь системы, которому назначен токен
//   * ВнешнийПользователь	 - Строка										 - идентификатор пользователя внешней системы.
// Идентификатором может являтся: логин, внутренний идентификатор, clientID и т.д.
//   * Сущность				 - ПеречислениеСсылка.пбп_СущностиАвторизации	 - секрет клиента, авто-код, сгенерированный
// другой системой для получения токенов доступа и обновления или токен доступа/обновления
//   * Значение				 - ХранилищеЗначения или Строка					 - значение. Если передана строка,
// то она будет помещена в ХранилищеЗначений
//   * СтрокЖизниДо			 - Дата											 - дата время до которой живет значение
//
Процедура ИзменитьЗапись(ПараметрыЗаписи) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	
	Если ЗначениеЗаполнено(ПараметрыЗаписи.ИнтегрируемаяСистема) Тогда
		НаборЗаписей.Отбор.ИнтегрируемаяСистема.Установить(ПараметрыЗаписи.ИнтегрируемаяСистема);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыЗаписи.ВнешнийПользователь) Тогда
		НаборЗаписей.Отбор.ВнешнийПользователь.Установить(ПараметрыЗаписи.ВнешнийПользователь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыЗаписи.Сущность) Тогда
		НаборЗаписей.Отбор.Сущность.Установить(ПараметрыЗаписи.Сущность);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("Организация")
		И ЗначениеЗаполнено(ПараметрыЗаписи.Организация) Тогда
		НаборЗаписей.Отбор.Организация.Установить(ПараметрыЗаписи.Организация);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("Пользователь")
		И ЗначениеЗаполнено(ПараметрыЗаписи.Пользователь) Тогда
		НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыЗаписи.Пользователь);
	КонецЕсли;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		Запись = НаборЗаписей[0];
		Для Каждого КлючИЗначение Из ПараметрыЗаписи Цикл
			Запись[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЦикла;
		
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Удалить запись.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров Для записи. Ключи:
//   * ИнтегрируемаяСистема	 - СправочникСсылка.пбп_ИнтегрируемыеСистемы	 - интегрируемая система
//   * Организация			 - ОпределяемыйТип.пбп_Организации				 - организация, которой назначен токен
//   * Пользователь			 - Строка										 - пользователь системы, которому назначен токен
//   * ВнешнийПользователь	 - Строка										 - идентификатор пользователя внешней системы.
// Идентификатором может являтся: логин, внутренний идентификатор, clientID и т.д.
//   * Сущность				 - ПеречислениеСсылка.пбп_СущностиАвторизации	 - секрет клиента, авто-код, сгенерированный
// другой системой для получения токенов доступа и обновления или токен доступа/обновлени
Процедура УдалитьЗаписи(ПараметрыЗаписи) Экспорт
	
	Если ТипЗнч(ПараметрыЗаписи) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru='Некорректный тип параметра'");
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	Для Каждого КлючИЗначение Из ПараметрыЗаписи Цикл
		Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей.Отбор[КлючИЗначение.Ключ].Установить(КлючИЗначение.Значение);
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ТекстСообщения = НСтр("ru='Ошибка удаления токена интегрируемых систем'");
		пбп_Переадресация.ДобавитьСообщениеДляЖурналаРегистрации(
			ТекстСообщения,
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли