// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура очищает основные реквизиты настроек в справочнике, например для тестовых баз и т.д.
Процедура ОчиститьОсновныеРеквизитыНастроекИнтеграции() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	пбп_НастройкиИнтеграции.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.пбп_НастройкиИнтеграции КАК пбп_НастройкиИнтеграции
		|ГДЕ
		|	НЕ пбп_НастройкиИнтеграции.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Попытка
		
		ОчищаемыеРеквизиты = Новый Структура("СтрокаПодключения");
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НастройкаИнтеграцииОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(НастройкаИнтеграцииОбъект, ОчищаемыеРеквизиты);
			УстановитьПривилегированныйРежим(Истина);
			пбп_Переадресация.УдалитьДанныеИзБезопасногоХранилища(ВыборкаДетальныеЗаписи.Ссылка);
			УстановитьПривилегированныйРежим(Ложь);
			НастройкаИнтеграцииОбъект.ОбменДанными.Загрузка = Истина;
			НастройкаИнтеграцииОбъект.Записать();
			
		КонецЦикла;
		
	Исключение
		
		ИмяСобытия = НСтр("ru = 'Очистка реквизитов настроек интеграции'");
		ЗаголовокОшибки = СтрШаблон("Не удалось очистить реквизиты в настройке %1", ВыборкаДетальныеЗаписи.Ссылка);
		
		ТекстОшибки = пбп_ОбщегоНазначенияСервер.ПолучениеПолногоТекстаОшибкиПриИсключении(ЗаголовокОшибки,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), ПолучитьСообщенияПользователю(Истина));
		пбп_Переадресация.ДобавитьСообщениеДляЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,
			,
			ВыборкаДетальныеЗаписи.Ссылка,
			ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли