// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстСообщения = НСтр("ru = 'Открытие формы прервано, т.к. передан некорректный параметр формы ""Действие""'");
	
	Если Параметры.Свойство("Действие") Тогда
		КлючДействия = Параметры.Действие;
	Иначе
		пбп_Переадресация.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	ОбщаяФормулировка = "ru = '%1.
	|Укажите параметры подключения к информационной базе, через которую будет выполнено создание обработки.
	|Важно, чтобы конфигуратор базы был не занят.'";
	Если КлючДействия = "ОбработкаЗагрузкиИзФайла" Тогда
		ЗаголовокТекст = СтрШаблон(ОбщаяФормулировка,
			"Для создания обработки загрузки из файла необходим доступ к конфигуратору");
		Элементы.ДекорацияЗаголовок.Заголовок = НСтр(ЗаголовокТекст, пбп_Переадресация.КодОсновногоЯзыка());
		Элементы.ВыполнитьДействиеПосле.Заголовок = НСтр("ru = 'Выбрать каталог сохранения и создать обработку'");
		Элементы.ГруппаДопИнформация.Видимость = Ложь;
		Элементы.СоздатьВременнуюФайловуюБазу.Видимость = Ложь;
	ИначеЕсли КлючДействия = "ОбработкаОтладкиПользовательскойФункции" Тогда
		ЗаголовокТекст = СтрШаблон(ОбщаяФормулировка,
			"Для создания внешний обработки, в которой будет размещен код пользовательской функции, необходим доступ к конфигуратору");
		Элементы.ДекорацияЗаголовок.Заголовок = НСтр(ЗаголовокТекст, пбп_Переадресация.КодОсновногоЯзыка());
		Элементы.ВыполнитьДействиеПосле.Заголовок = НСтр("ru = 'Запустить отладку'");
		Элементы.ГруппаДопИнформация.Видимость = Истина;
		Элементы.СоздатьВременнуюФайловуюБазу.Видимость = Истина;
	Иначе
		пбп_Переадресация.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	СтруктураНастроек = пбп_Переадресация.ПрочитатьДанныеИзБезопасногоХранилища(
		ПолучитьВладельцаЗначенияБезопасногоХранилища(),
		ПолучитьКлючДанныхБезопасногоХранилища());
	УстановитьПривилегированныйРежим(Ложь);
	
	Если СтруктураНастроек <> Неопределено Тогда
		ВариантПодключенияКБазе = СтруктураНастроек.СервернаяБаза;
		Если СтруктураНастроек.СервернаяБаза Тогда
			КластерСерверов			= СтруктураНастроек.КластерСерверов;
			ИмяИнформационнойБазы	= СтруктураНастроек.ИмяИнформационнойБазы;
		Иначе
			КаталогИнформационнойБазы = СтруктураНастроек.КаталогИнформационнойБазы;
		КонецЕсли;
		
		ИмяПользователя	= СтруктураНастроек.ИмяПользователя;
		Пароль			= СтруктураНастроек.Пароль;
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПодключенияКБазеПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура КаталогИнформационнойБазыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок			= НСтр("ru = 'Выберите каталог информационной базы'");
	Диалог.МножественныйВыбор	= Ложь;
	
	Результат = Ждать Диалог.ВыбратьАсинх();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ФайлБазы = Новый Файл(Результат[0] + "/1Cv8.1CD");
		ФайлСуществует = Ждать ФайлБазы.СуществуетАсинх();
		Если ФайлСуществует Тогда
			КаталогИнформационнойБазы = Результат[0];
		Иначе
			пбп_ПереадресацияКлиент.СообщитьПользователю(
				НСтр("ru = 'В каталоге отсутствует файл ИБ. Выберите каталог информационной базы 1С'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьДействиеПосле(Команда)
	
	СохранитьДанныеПриНеобходимости();
	
#Если ВебКлиент Или МобильноеПриложениеКлиент Или МобильныйКлиент Тогда
	ВызватьИсключение НСтр("ru = 'Создание внешней обработки недоступно в веб-клиенте и мобильном приложении'");
#Иначе
	Если КлючДействия = "ОбработкаЗагрузкиИзФайла" Тогда
		УказатьПутьКФайлуИЗакрытьФорму();
	ИначеЕсли КлючДействия = "ОбработкаОтладкиПользовательскойФункции" Тогда
		Закрыть(ПолучитьПараметрыАутентификацииИзФормы());
	КонецЕсли;
#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПоказатьПарольНаСервере(РежимПароля)
	Если РежимПароля Тогда
		Команды.Найти("ПоказатьПароль").Картинка = БиблиотекаКартинок.ПоказатьПароль;
	Иначе
		Команды.Найти("ПоказатьПароль").Картинка = БиблиотекаКартинок.СкрытьПароль;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПароль(Команда)
	
	РежимПароля = Не Элементы.Пароль.РежимПароля;
	
	Элементы.Пароль.РежимПароля = РежимПароля;
	
	ПоказатьПарольНаСервере(РежимПароля);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СоздатьВременнуюФайловуюБазу(Команда)
	
	Результат = Ждать КаталогВременныхФайловАсинх();
	Если Результат <> Неопределено Тогда
		ФайловаяБаза = 0;
		КаталогИнформационнойБазы = Результат + "Временная информационная база";
		
		КомандаСозданияИнформационнойБазы = СтрШаблон("1cv8.exe CREATEINFOBASE File=""%1""", КаталогИнформационнойБазы);
		
		Результат = Ждать ЗапуститьПриложениеАсинх(КомандаСозданияИнформационнойБазы, КаталогПрограммы(), Истина);
		Если Результат <> 0 Тогда
			Закрыть(ПолучитьПараметрыАутентификацииИзФормы(Истина));
		Иначе
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.КаталогИнформационнойБазы.Видимость = Не ВариантПодключенияКБазе;
	Элементы.КластерСерверов.Видимость = ВариантПодключенияКБазе;
	Элементы.ИмяИнформационнойБазы.Видимость = ВариантПодключенияКБазе;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеПриНеобходимости()
	
	Если Не ЗапомнитьДанные Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПодключения = Новый Структура;
	СтруктураПодключения.Вставить("СервернаяБаза", ВариантПодключенияКБазе = 1);
	Если ВариантПодключенияКБазе Тогда
		СтруктураПодключения.Вставить("КластерСерверов"			, КластерСерверов);
		СтруктураПодключения.Вставить("ИмяИнформационнойБазы"	, ИмяИнформационнойБазы);
	Иначе
		СтруктураПодключения.Вставить("КаталогИнформационнойБазы", КаталогИнформационнойБазы);
	КонецЕсли;
	
	СтруктураПодключения.Вставить("ИмяПользователя"	, ИмяПользователя);
	СтруктураПодключения.Вставить("Пароль"			, Пароль);
	
	УстановитьПривилегированныйРежим(Истина);
	пбп_Переадресация.ЗаписатьДанныеВБезопасноеХранилище(
		ПолучитьВладельцаЗначенияБезопасногоХранилища(),
		СтруктураПодключения,
		ПолучитьКлючДанныхБезопасногоХранилища());
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВладельцаЗначенияБезопасногоХранилища()
	
	Если пбп_ОбщегоНазначенияСервер.СуществуетБиблиотекаСтандартныхПодсистем() Тогда
		Владелец = пбп_Переадресация.АвторизованныйПользователь();
	Иначе
		Владелец = "пбп_ОбщегоНазначения";
	КонецЕсли;
	
	Возврат Владелец;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКлючДанныхБезопасногоХранилища()
	
	Возврат "ДанныеПодключенияКВнешнейБазе1С";
	
КонецФункции

&НаКлиенте
Асинх Процедура УказатьПутьКФайлуИЗакрытьФорму()
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок			= НСтр("ru = 'Выберите путь сохранения файла обработки'");
	Диалог.МножественныйВыбор	= Ложь;
	Диалог.Фильтр				= "Внешняя обработка 1С (*.epf)|*.epf";
	
	Результат = Ждать Диалог.ВыбратьАсинх();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ПараметрыСохранения = ПолучитьПараметрыАутентификацииИзФормы();
		ПараметрыСохранения.Вставить("ПутьКФайлу", Результат[0]);
		
		Закрыть(ПараметрыСохранения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыАутентификацииИзФормы(Временная = Ложь)
	
	ПараметрыСохранения = Новый Структура;
	ПараметрыСохранения.Вставить("ФайловаяБаза"				, ВариантПодключенияКБазе = 0);
	ПараметрыСохранения.Вставить("КаталогИнформационнойБазы", КаталогИнформационнойБазы);
	ПараметрыСохранения.Вставить("КластерСерверов"			, КластерСерверов);
	ПараметрыСохранения.Вставить("ИмяИнформационнойБазы"	, ИмяИнформационнойБазы);
	Если Временная Тогда
		ПараметрыСохранения.Вставить("ИмяПользователя"			, "");
		ПараметрыСохранения.Вставить("Пароль"					, "");
	Иначе
		ПараметрыСохранения.Вставить("ИмяПользователя"			, ИмяПользователя);
		ПараметрыСохранения.Вставить("Пароль"					, Пароль);
	КонецЕсли;
	ПараметрыСохранения.Вставить("Временная"				, Временная);
	
	Возврат ПараметрыСохранения;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции