// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

// Инициализирует предопределенные значения из таблицы.
//
// Параметры:
//  МенеджерОбъекта	 - СправочникМенеджер, ПланВидовХарактеристикМенеджер	 - менеджер объекта.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица с конфликтными элементами
//
Функция ИнициализироватьПредопределенныеЗначения(МенеджерОбъекта) Экспорт
	
	Если Не пбп_ПредопределенныеЗначенияСлужебный.МенеджерВходитВПодсистемуПредопределенных(МенеджерОбъекта) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ТЗПредопределенныхЗначений = пбп_ПредопределенныеЗначенияСлужебный
		.ТаблицаПредопределенныхЭлементов(МенеджерОбъекта);
	
	ТаблицаКонфликтныхЭлементов = пбп_ПредопределенныеЗначенияСлужебный
		.ОбработатьПредопределенныеЗначения(ТЗПредопределенныхЗначений, МенеджерОбъекта);
	
	Возврат ТаблицаКонфликтныхЭлементов;
	
КонецФункции

// Возвращает ключи хеша на основании менеджера объекта.
//
// Параметры:
//  МенеджерОбъекта	 - СправочникМенеджер, ПланВидовХарактеристикМенеджер - Менеджер обрабатываемого объекта.
// 
// Возвращаемое значение:
//  Структура - Ключи хеша
//    * КлючиХешаЭлемент	 - Структура - Структура ключей хеша для элемента.
//    * КлючиХешаГруппа		 - Структура - Структура ключей хеша для группы.
//
Функция КлючиХеша(МенеджерОбъекта) Экспорт
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(МенеджерОбъекта));
	
	Поля = пбп_ПредопределенныеЗначенияПереопределяемый.ДобавляемыеСтандартныеПоля();
	УдаляемыеСтандартныеПоля = пбп_ПредопределенныеЗначенияПереопределяемый.УдаляемыеСтандартныеПоля();
	
	Поля = пбп_ПереадресацияКлиентСервер.РазностьМассивов(Поля, УдаляемыеСтандартныеПоля);
	
	ДобавляемыеПоля = пбп_ПредопределенныеЗначенияСлужебный.ДобавляемыеПоляОбъектаДляРасчетаХеша(МенеджерОбъекта);
	пбп_ПереадресацияКлиентСервер.ДополнитьМассив(Поля, ДобавляемыеПоля);
	
	Ключи = Новый Структура("КлючиХешаЭлемент, КлючиХешаГруппа", Новый Структура, Новый Структура);
	Для Каждого Поле Из Поля Цикл
		Реквизит = ОбъектМетаданных.Реквизиты.Найти(Поле);
		ЕстьСтандартныйРеквизит = пбп_ПереадресацияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
			ОбъектМетаданных.СтандартныеРеквизиты,
			Поле);
		
		Если Реквизит = Неопределено И Не ЕстьСтандартныйРеквизит Тогда
			Продолжить;
		КонецЕсли;
		
		Ключи.КлючиХешаЭлемент.Вставить(Поле);
		
		Если ЕстьСтандартныйРеквизит
			Или Реквизит.Использование <> Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента Тогда
			Ключи.КлючиХешаГруппа.Вставить(Поле);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ключи;
	
КонецФункции

// Обновляет хеш предопределенного элемента в регистре, устанавливая при этом ручное изменение.
//
// Параметры:
//  Объект - СправочникОбъект, ПланВидовХарактеристикОбъект	 - предопределенный элемент.
//
Процедура ОбновитьХешПредопределенногоЭлемента(Объект) Экспорт
	
	Флаг = пбп_ПереадресацияКлиентСервер.СвойствоСтруктуры(Объект.ДополнительныеСвойства, "РучноеИзменение", Истина);
	
	РегистрыСведений.пбп_СостоянияПредопределенныхЭлементов.ОбновитьХешЭлемента(Объект.Ссылка, Объект.ЭтоГруппа, Флаг);
	
КонецПроцедуры

// Создает запись регистра с заданными параметрами.
//
// Параметры:
//  Объект		 - СправочникСсылка, ПланВидовХарактеристикСсылка	 - Ссылка на предопределенный элемент.
//  ЭтоГруппа	 - Булево - - Признак того что элемент является группой.
//  КлючиХеша	 - Структура, Неопределено - Если ключи хеша не переданы, то они будут сформированы заново.
//
Процедура СоздатьЗаписьСостоянияПредопределенногоЭлемента(Объект, ЭтоГруппа, КлючиХеша = Неопределено) Экспорт
	РегистрыСведений.пбп_СостоянияПредопределенныхЭлементов.СоздатьЗаписьРегистра(Объект, ЭтоГруппа, КлючиХеша);
КонецПроцедуры

// Обновляет флаг ручного изменения элемента
//
// Параметры:
//  Элемент  - СправочникСсылка, ПланВидовХарактеристикСсылка - Ссылка на предопределенный элемент
//  Флаг     - Булево - Устанавливается если были изменены ключевые поля пользователем.
//
Процедура УстановитьФлагРучноеИзменение(Элемент, Флаг = Ложь) Экспорт
	РегистрыСведений.пбп_СостоянияПредопределенныхЭлементов.ОбновитьФлагРучногоИзменения(Элемент, Флаг);
КонецПроцедуры

// Заполнение предопределенных элементов, с возможностью серверного оповещения
// о существующих конфликтах при создании элементов.
//
// Параметры:
//  ОтправитьСерверноеОповещение - Булево - В случае необходимости оповещения пользователей, установить флаг в Истину.
//
Процедура ЗаполнениеПредопределенныхЭлементов(ОтправитьСерверноеОповещение = Ложь) Экспорт
	
	Адресаты = пбп_ОбщегоНазначенияСервер.ПолучитьАдресатовСПолнымиПравами();
	
	Типы = Метаданные.ОпределяемыеТипы.пбп_ПредопределенныеВсеСсылкиПереопределяемый.Тип.Типы();
	
	Для Каждого Тип Из Типы Цикл
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		
		Менеджер = пбп_Переадресация.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
		
		Если Не ОтправитьСерверноеОповещение Тогда
			ИнициализироватьПредопределенныеЗначения(Менеджер);
			Продолжить;
		КонецЕсли;
		
		ПредставлениеОбъекта = ?(ПустаяСтрока(ОбъектМетаданных.ПредставлениеОбъекта),
			ОбъектМетаданных.Синоним,
			ОбъектМетаданных.ПредставлениеОбъекта);
		
		ТаблицаКонфликтныхЭлементов = ИнициализироватьПредопределенныеЗначения(Менеджер);
		
		Если ЗначениеЗаполнено(ТаблицаКонфликтныхЭлементов) Тогда
			Результат = Новый Структура;
			Результат.Вставить("ИмяОбъектаМетаданных", ПолноеИмя);
			Результат.Вставить("ПредставлениеОбъекта", ПредставлениеОбъекта);
			
			пбп_Переадресация.ОтправитьСерверноеОповещение(
				пбп_ПредопределенныеЗначенияСлужебный.ИмяСерверногоОповещения(),
				Результат,
				Адресаты);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Выполняет действия при записи предопределенного элемента.
//
// Параметры:
//  Объект - СправочникОбъект, ПланВидовХарактеристикОбъект - предопределенный элемент
//                             из подсистемы предопределенных элементов
//
Процедура ОбработатьСуществующийПредопределенныйЭлемент(Объект) Экспорт
	
	Если пбп_ПереадресацияКлиентСервер.СвойствоСтруктуры(Объект.ДополнительныеСвойства, "ЭтоНовый", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизита = пбп_ПредопределенныеЗначенияСлужебный.ИмяПоляПредопределенности();
	Если пбп_ПереадресацияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита)
		И Не Объект.ЭтоПредопределенный Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьХешПредопределенногоЭлемента(Объект);
	
КонецПроцедуры

#Область Обработчики

// Вызывается из одноименного обработчика ПередЗаписью.
//
// Параметры:
//  Объект	 - СправочникОбъект, ПланВидовХарактеристикОбъект - редопределенный элемент
//                             из подсистемы предопределенных элементов.
//  Отказ	 - Булево - Признак отказа от записи.
//
Процедура ПередЗаписью(Объект, Отказ) Экспорт
	
	Объект.ДополнительныеСвойства.Вставить("ЭтоНовый", Объект.ЭтоНовый());
	
	УстановитьФлагПредопределенногоЭлемента(Объект);
	
КонецПроцедуры

// Вызывается из одноименного обработчика ПриЗаписи.
//
// Параметры:
//  Объект	 - СправочникОбъект, ПланВидовХарактеристикОбъект - редопределенный элемент
//                             из подсистемы предопределенных элементов.
//  Отказ	 - Булево - Признак отказа от записи.ы
//
Процедура ПриЗаписи(Объект, Отказ) Экспорт
	
	ОбработатьСуществующийПредопределенныйЭлемент(Объект);
	
КонецПроцедуры

// Выводит подключенные команды в форме.
// Для вызова из обработчика формы ПриСозданииНаСервере.
//
// Если в форме несколько списков, то в обработчике формы ПриСозданииНаСервере
// следует разместить несколько вызовов этой процедуры с указанием параметра ПараметрыРазмещения.
// Параметр ПараметрыРазмещения также применяется, когда типы источников зависят от параметров открытия формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо разместить команды.
//   ПараметрыРазмещения - см. пбп_ПредопределенныеЗначения.ПараметрыРазмещения
//                       - Неопределено
//
Процедура ПриСозданииНаСервере(Форма, Знач ПараметрыРазмещения = Неопределено) Экспорт
	
	ПереданныеПараметрыРазмещения = ПараметрыРазмещения;
	
	ПараметрыРазмещения = ПараметрыРазмещения();
	Если ПереданныеПараметрыРазмещения <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыРазмещения, ПереданныеПараметрыРазмещения);
	КонецЕсли;
	
	СоздатьКомандуЗаполнения(Форма);
	
КонецПроцедуры

#КонецОбласти

// Конструктор одноименного параметра процедуры пбп_ПредопределенныеЗначения.ПриСозданииНаСервере.
//
// Возвращаемое значение:
//   Структура - параметры размещения подключаемых команд:
//       * Источники - ОписаниеТипов
//                   - Массив из ОбъектМетаданных - источники команд.
//           Используется для второстепенных списков, а также в формах объектов, не являющихся поставщиками
//           команд (обработки, общие формы).
//       * КоманднаяПанель - ГруппаФормы - командная панель или группа команд, в которой выводятся подменю.
//           Используется как родитель для создания подменю в случае их отсутствия.
//           Если не указан то в первую очередь ищется группа "ПодключаемыеКоманды".
//       * ПрефиксГрупп - Строка - добавка к именам подменю и имени командной панели.
//           Используется при необходимости префиксации групп с командами (в частности, когда в форме несколько таблиц).
//           В качестве префикса рекомендуется использовать имя таблицы формы, для которой выводятся команды.
//           Например, если ПрефиксГрупп = "СкладскиеДокументы" (имя второстепенной таблицы формы),
//           то используются подменю с именами "СкладскиеДокументыПодменюПечать", "СкладскиеДокументыПодменюОтчеты" и т.д.
//       * ВладелецКоманд - ДанныеФормыСтруктура, ТаблицаФормы - объект или элемент формы, для которого выводятся команды.
//
Функция ПараметрыРазмещения() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Источники");
	Результат.Вставить("КоманднаяПанель");
	Результат.Вставить("ПрефиксГрупп", "");
	Результат.Вставить("ВладелецКоманд");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьФлагПредопределенногоЭлемента(Объект)
	
	ИмяРеквизита = пбп_ПредопределенныеЗначенияСлужебный.ИмяПоляПредопределенности();
	Если Не пбп_ПереадресацияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ЭтоПредопределенный = ЗначениеЗаполнено(Объект.ИдентификаторНастройки);
	
КонецПроцедуры

Функция КоманднаяПанельФормы(Форма, ПрефиксГрупп, ЭтоФормаОбъекта)
	
	Элементы = Форма.Элементы;
	
	Результат = Элементы.Найти(ПрефиксГрупп + "ПодключаемыеКоманды");
	Если Результат = Неопределено Тогда
		Результат = Элементы.Найти(ПрефиксГрупп + "КоманднаяПанель");
		
		Если Результат = Неопределено Тогда
			Результат = Элементы.Найти(ПрефиксГрупп + "ОсновнаяКоманднаяПанель");
			
			Если Результат = Неопределено И ЗначениеЗаполнено(ПрефиксГрупп) Тогда
				ТаблицаФормы = Элементы.Найти(ПрефиксГрупп);
				Если ТипЗнч(ТаблицаФормы) = Тип("ТаблицаФормы") Тогда
					Результат = ТаблицаФормы.КоманднаяПанель;
				КонецЕсли;
			КонецЕсли;
			
			Если Не ЭтоФормаОбъекта
				И Результат = Неопределено
				И Не ЗначениеЗаполнено(ПрефиксГрупп) Тогда
				ТаблицаФормы = Элементы.Найти("Список");
				Если ТипЗнч(ТаблицаФормы) = Тип("ТаблицаФормы")
					И ТаблицаФормы.ПоложениеКоманднойПанели <> ПоложениеКоманднойПанелиЭлементаФормы.Нет Тогда
					Результат = ТаблицаФормы.КоманднаяПанель;
				КонецЕсли;
			КонецЕсли;
			
			Если Результат = Неопределено Тогда
				Результат = Форма.КоманднаяПанель;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Процедура СоздатьКомандуЗаполнения(Форма)
	
	Идентификатор = "_" + СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
	ИмяКоманды = пбп_ПредопределенныеЗначенияКлиентСервер.ИмяКомандыЗаполненияПредопределенных() + Идентификатор;
	ИмяДействия = "Подключаемый_ПредопределенныеВыполнитьКоманду";
	Представление = НСтр("ru = 'Заполнить предопределенные!'; en = 'Fill in the predefined!'");
	
	пбп_РаботаСФормами.СоздатьКоманду(Форма, ИмяКоманды, Представление, ИмяДействия);
	
	КомандаФормы = Форма.Команды.Найти(ИмяКоманды);
	КомандаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КомандаФормы.Картинка = БиблиотекаКартинок.ВосстановитьЗначения;
	
	КоманднаяПанель = КоманднаяПанельФормы(Форма, "", Ложь);
	
	пбп_РаботаСФормами.СоздатьКнопка(Форма, ИмяКоманды, КоманднаяПанель, , ИмяКоманды, 3);

КонецПроцедуры

#КонецОбласти
