// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

// Инициализирует предопределенные значения из таблицы.
//
// Параметры:
//  МенеджерОбъекта	 - СправочникМенеджер, ПланВидовХарактеристикМенеджер	 - менеджер объекта.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица с конфликтными элементами
//
Функция ИнициализироватьПредопределенныеЗначения(МенеджерОбъекта) Экспорт
	
	Если Не пбп_ПредопределенныеЗначенияСлужебный.МенеджерВходитВПодсистемуПредопределенных(МенеджерОбъекта) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ТЗПредопределенныхЗначений = пбп_ПредопределенныеЗначенияСлужебный
		.ТаблицаПредопределенныхЭлементов(МенеджерОбъекта);
	
	ТаблицаКонфликтныхЭлементов = пбп_ПредопределенныеЗначенияСлужебный
		.ОбработатьПредопределенныеЗначения(ТЗПредопределенныхЗначений, МенеджерОбъекта);
	
	Возврат ТаблицаКонфликтныхЭлементов;
	
КонецФункции

// Возвращает ключи хеша на основании менеджера объекта.
//
// Параметры:
//  МенеджерОбъекта	 - СправочникМенеджер, ПланВидовХарактеристикМенеджер - Менеджер обрабатываемого объекта.
// 
// Возвращаемое значение:
//  Структура - Ключи хеша
//    * КлючиХешаЭлемент	 - Структура - Структура ключей хеша для элемента.
//    * КлючиХешаГруппа		 - Структура - Структура ключей хеша для группы.
//
Функция КлючиХеша(МенеджерОбъекта) Экспорт
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(МенеджерОбъекта));
	
	Поля = пбп_ПредопределенныеЗначенияПереопределяемый.ДобавляемыеСтандартныеПоля();
	УдаляемыеСтандартныеПоля = пбп_ПредопределенныеЗначенияПереопределяемый.УдаляемыеСтандартныеПоля();
	
	Поля = пбп_ПереадресацияКлиентСервер.РазностьМассивов(Поля, УдаляемыеСтандартныеПоля);
	
	ДобавляемыеПоля = пбп_ПредопределенныеЗначенияСлужебный.ДобавляемыеПоляОбъектаДляРасчетаХеша(МенеджерОбъекта);
	пбп_ПереадресацияКлиентСервер.ДополнитьМассив(Поля, ДобавляемыеПоля);
	
	Ключи = Новый Структура("КлючиХешаЭлемент, КлючиХешаГруппа", Новый Структура, Новый Структура);
	Для Каждого Поле Из Поля Цикл
		Реквизит = ОбъектМетаданных.Реквизиты.Найти(Поле);
		ЕстьСтандартныйРеквизит = пбп_ПереадресацияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
			ОбъектМетаданных.СтандартныеРеквизиты,
			Поле);
		
		Если Реквизит = Неопределено И Не ЕстьСтандартныйРеквизит Тогда
			Продолжить;
		КонецЕсли;
		
		Ключи.КлючиХешаЭлемент.Вставить(Поле);
		
		Если ЕстьСтандартныйРеквизит
			Или Реквизит.Использование <> Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента Тогда
			Ключи.КлючиХешаГруппа.Вставить(Поле);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ключи;
	
КонецФункции

// Обновляет хеш предопределенного элемента в регистре, устанавливая при этом ручное изменение.
//
// Параметры:
//  Объект - СправочникОбъект, ПланВидовХарактеристикОбъект	 - предопределенный элемент.
//
Процедура ОбновитьХешПредопределенногоЭлемента(Объект) Экспорт
	
	Флаг = пбп_ПереадресацияКлиентСервер.СвойствоСтруктуры(Объект.ДополнительныеСвойства, "РучноеИзменение", Истина);
	
	РегистрыСведений.пбп_СостоянияПредопределенныхЭлементов.ОбновитьХешЭлемента(Объект.Ссылка, Объект.ЭтоГруппа, Флаг);
	
КонецПроцедуры

// Создает запись регистра с заданными параметрами.
//
// Параметры:
//  Объект		 - СправочникСсылка, ПланВидовХарактеристикСсылка	 - Ссылка на предопределенный элемент.
//  ЭтоГруппа	 - Булево - - Признак того что элемент является группой.
//  КлючиХеша	 - Структура, Неопределено - Если ключи хеша не переданы, то они будут сформированы заново.
//
Процедура СоздатьЗаписьСостоянияПредопределенногоЭлемента(Объект, ЭтоГруппа, КлючиХеша = Неопределено) Экспорт
	РегистрыСведений.пбп_СостоянияПредопределенныхЭлементов.СоздатьЗаписьРегистра(Объект, ЭтоГруппа, КлючиХеша);
КонецПроцедуры

// Обновляет флаг ручного изменения элемента
//
// Параметры:
//  Элемент  - СправочникСсылка, ПланВидовХарактеристикСсылка - Ссылка на предопределенный элемент
//  Флаг     - Булево - Устанавливается если были изменены ключевые поля пользователем.
//
Процедура УстановитьФлагРучноеИзменение(Элемент, Флаг = Ложь) Экспорт
	РегистрыСведений.пбп_СостоянияПредопределенныхЭлементов.ОбновитьФлагРучногоИзменения(Элемент, Флаг);
КонецПроцедуры

// Заполнение предопределенных элементов, с возможностью серверного оповещения
// о существующих конфликтах при создании элементов.
//
// Параметры:
//  ОтправитьСерверноеОповещение - Булево - В случае необходимости оповещения пользователей, установить флаг в Истину.
//
Процедура ЗаполнениеПредопределенныхЭлементов(ОтправитьСерверноеОповещение = Ложь) Экспорт
	
	Адресаты = пбп_ОбщегоНазначенияСервер.ПолучитьАдресатовСПолнымиПравами();
	
	Типы = Метаданные.ОпределяемыеТипы.пбп_ПредопределенныеВсеСсылкиПереопределяемый.Тип.Типы();
	
	Для Каждого Тип Из Типы Цикл
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		
		Менеджер = пбп_Переадресация.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
		
		Если Не ОтправитьСерверноеОповещение Тогда
			ИнициализироватьПредопределенныеЗначения(Менеджер);
			Продолжить;
		КонецЕсли;
		
		ПредставлениеОбъекта = ?(ПустаяСтрока(ОбъектМетаданных.ПредставлениеОбъекта),
			ОбъектМетаданных.Синоним,
			ОбъектМетаданных.ПредставлениеОбъекта);
		
		ТаблицаКонфликтныхЭлементов = ИнициализироватьПредопределенныеЗначения(Менеджер);
		
		Если ЗначениеЗаполнено(ТаблицаКонфликтныхЭлементов) Тогда
			Результат = Новый Структура;
			Результат.Вставить("ИмяОбъектаМетаданных", ПолноеИмя);
			Результат.Вставить("ПредставлениеОбъекта", ПредставлениеОбъекта);
			
			пбп_Переадресация.ОтправитьСерверноеОповещение(
				пбп_ПредопределенныеЗначенияСлужебный.ИмяСерверногоОповещения(),
				Результат,
				Адресаты);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Выполняет действия при записи предопределенного элемента.
//
// Параметры:
//  Объект - СправочникОбъект, ПланВидовХарактеристикОбъект - предопределенный элемент
//                             из подсистемы предопределенных элементов
//
Процедура ОбработатьСуществующийПредопределенныйЭлемент(Объект) Экспорт
	
	Если пбп_ПереадресацияКлиентСервер.СвойствоСтруктуры(Объект.ДополнительныеСвойства, "ЭтоНовый", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Если пбп_ПереадресацияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ЭтоПредопределенный")
		И Не Объект.ЭтоПредопределенный Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьХешПредопределенногоЭлемента(Объект);
	
КонецПроцедуры

// Вызывается из одноименного обработчика ПередЗаписью.
//
// Параметры:
//  Объект	 - СправочникОбъект, ПланВидовХарактеристикОбъект - редопределенный элемент
//                             из подсистемы предопределенных элементов.
//  Отказ	 - Булево - Признак отказа от записи.
//
Процедура ПередЗаписью(Объект, Отказ) Экспорт
	
	Объект.ДополнительныеСвойства.Вставить("ЭтоНовый", Объект.ЭтоНовый());
	
	УстановитьФлагПредопределенногоЭлемента(Объект);
	
КонецПроцедуры

// Вызывается из одноименного обработчика ПриЗаписи.
//
// Параметры:
//  Объект	 - СправочникОбъект, ПланВидовХарактеристикОбъект - редопределенный элемент
//                             из подсистемы предопределенных элементов.
//  Отказ	 - Булево - Признак отказа от записи.ы
//
Процедура ПриЗаписи(Объект, Отказ) Экспорт
	
	ОбработатьСуществующийПредопределенныйЭлемент(Объект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьФлагПредопределенногоЭлемента(Объект)
	
	Если Не пбп_ПереадресацияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ЭтоПредопределенный") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ЭтоПредопределенный = ЗначениеЗаполнено(Объект.ИдентификаторНастройки);
	
КонецПроцедуры

#КонецОбласти
