////////////////////////////////////////////////////////////////////////////////
// Общего назначения (сервер): для серверных функций общего назначения

#Область ПрограммныйИнтерфейс

Функция ПолучитьИмяИнформационнойБазы() Экспорт

    СтрокаПодключения = СтрокаСоединенияИнформационнойБазы();

    НомерСимвола = СтрНайти(СтрокаПодключения, "File=");
    Если НомерСимвола > 0 Тогда
        //Это Файловая база
        СтрокаСправа = Сред(СтрокаПодключения, НомерСимвола + 6);
        Возврат Сред(СтрокаСправа, 1, СтрДлина(СтрокаСправа) - 2);
    КонецЕсли;

    НомерСимвола = СтрНайти(СтрокаПодключения, "Ref=");
    Если НомерСимвола > 0 Тогда
        //Это серверная база
        СтрокаСправа = Сред(СтрокаПодключения, НомерСимвола + 5);
        Возврат Сред(СтрокаСправа, 1, СтрДлина(СтрокаСправа) - 2);
    КонецЕсли;

    Возврат "";
Конецфункции

// Возвращает значение предопределенного элемента ПВХ по имени.
//
// Параметры:
//  Имя - Строка - Имя переменной ПВХ.
//  МассивЗначений - Булево - Истина, если необходимо получить массив значений.
// 
// Возвращаемое значение:
//  - ПроизвольныйТип - Значение переменной ПВХ.
//  - Массив - Массив значений переменной ПВХ.
// 
Функция ПолучитьПредопределенноеЗначение(Имя, МассивЗначений = Ложь) Экспорт
	
	Если МассивЗначений Тогда
		Возврат ПланыВидовХарактеристик.bit_ПредопределенныеЗначения.ПолучитьМассивЗначений(Имя);		
	Иначе
		Возврат ПланыВидовХарактеристик.bit_ПредопределенныеЗначения.ПолучитьЗначение(Имя);
	КонецЕсли; 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти