
#Область ПрограммныйИнтерфейс

Функция ПредопределенныеЗначения() Экспорт	
	
	Результат = ТаблицаПредопределенных();

	ОписаниеЧисло = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,0));
	
	// Добавление
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Количество дней хранения истории интеграции";
	НоваяНастройка.ИдентификаторНастройки = "КолДнейХраненияИсторииИнтеграции";
	НоваяНастройка.Пароль = Ложь;
	НоваяНастройка.СписокЗначений = Ложь;
	НоваяНастройка.ТипЗначения = ОписаниеЧисло;
	
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Количество дней хранения ошибок истории интеграции";
	НоваяНастройка.ИдентификаторНастройки = "КолДнейХраненияОшибокИсторииИнтеграции";
	НоваяНастройка.Пароль = Ложь;
	НоваяНастройка.СписокЗначений = Ложь;
	НоваяНастройка.ТипЗначения = ОписаниеЧисло;
	
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Тест_бул";
	НоваяНастройка.ИдентификаторНастройки = "Тест_бул";
	НоваяНастройка.Пароль = Ложь;
	НоваяНастройка.СписокЗначений = Ложь;
	НоваяНастройка.ТипЗначения = Новый ОписаниеТипов("Булево");
	
	НоваяНастройка = Результат.Добавить();
	НоваяНастройка.Наименование = "Тест_список";
	НоваяНастройка.ИдентификаторНастройки = "Тест_список";
	НоваяНастройка.Пароль = Ложь;
	НоваяНастройка.СписокЗначений = Истина;
	НоваяНастройка.ТипЗначения = Новый ОписаниеТипов("Строка");
	// КонецДобавления
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ТаблицаПредопределенных()
	
	Результат = Новый ТаблицаЗначений;
	
	ОписаниеСтрока = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(150));
	ОписаниеБулево = Новый ОписаниеТипов("Булево");
	
	Результат.Колонки.Добавить("ИдентификаторНастройки", ОписаниеСтрока);
	Результат.Колонки.Добавить("Наименование", ОписаниеСтрока);
	Результат.Колонки.Добавить("Пароль", ОписаниеБулево);
	Результат.Колонки.Добавить("СписокЗначений", ОписаниеБулево);
	Результат.Колонки.Добавить("ТипЗначения", Новый ОписаниеТипов("ОписаниеТипов"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти