///////////////////////////////////////////////////////////////////////////////////////////////////////
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL: https://github.com/firstBitSportivnaya/PSSL/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьПрефиксаКонфигурации();
	УстановитьВидимостьПрефиксаСуффикса();
	УстановитьЗначенияСлужебныхРеквизитов();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если Не ЗаменятьПрефиксКонфигурации Тогда
		НепроверяемыеРеквизиты.Добавить("ПрефиксКонфигурации");
	КонецЕсли;
	
	пбп_Переадресация.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ПодготовитьКонфигурацию(Команда)
	
	ОчиститьСообщения();
	
	Если Ждать ПроверитьПутьКИсходнымФайлам()
		И ПроверитьЗаполнение() Тогда
		ЗапуститьОбработку();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Асинх Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Результат = Ждать Диалог.ВыбратьАсинх();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		КаталогИсходныхФайлов = Результат[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыходнойПутьНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Результат = Ждать Диалог.ВыбратьАсинх();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ВыходнойПуть = Результат[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменятьПрефиксКонфигурацииПриИзменении(Элемент)
	УстановитьВидимостьПрефиксаКонфигурации();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПрефиксСуффиксПриИзменении(Элемент)
	УстановитьВидимостьПрефиксаСуффикса();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Функция ПроверитьПутьКИсходнымФайлам()
	
	Если Не Ждать ЭтоКаталогСИсходнымиФайлами() Тогда
		СообщитьОбОшибкеВыбранногоКаталога();
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Асинх Процедура ЗапуститьОбработку()
	
	ИмяВременногоФайлаАрхив = ПолучитьИмяВременногоФайла("zip"); 
	ЗаписьZip = Новый ЗаписьZipФайла(ИмяВременногоФайлаАрхив, "", "", МетодСжатияZIP.Сжатие);
	
	ЗаписьZip.Добавить(КаталогИсходныхФайлов + "\*",
		РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
		РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	
	ЗаписьZip.Записать();
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайлаАрхив);
	
	Ждать УдалитьФайлыАсинх(ИмяВременногоФайлаАрхив);
	
	Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	АдресФайлаВыгрузки = СформироватьФайлКонфигурации(Адрес);
	
	Файл = ПолучитьИзВременногоХранилища(АдресФайлаВыгрузки);
	
	ЧастьИмени = ИмяКонфигурации + СтрЗаменить(ВерсияКонфигурации, ".", "_");
	Если ФорматСохранения = 0 Тогда
		ЧастьИмени = ЧастьИмени + ".cf";
		ИмяФайлаВыгрузки = ПолучитьИмяВременногоФайла("cf");
	ИначеЕсли ФорматСохранения = 1 Тогда
		ЧастьИмени = ЧастьИмени + ".zip";
		ИмяФайлаВыгрузки = ПолучитьИмяВременногоФайла("zip");
	КонецЕсли;
	
	Ждать Файл.ЗаписатьАсинх(ИмяФайлаВыгрузки);
	
	Ждать КопироватьФайлАсинх(ИмяФайлаВыгрузки, ВыходнойПуть + "\" + ЧастьИмени);
	
	Текст = СтрШаблон(НСтр("ru = 'Файл успешно сохранен в каталог: %1, имя файла: %2'"), ВыходнойПуть, ЧастьИмени);
	ПоказатьПредупреждение(Неопределено, Текст);
	
	Ждать УдалитьФайлыАсинх(ИмяФайлаВыгрузки);
	
КонецПроцедуры

&НаСервере
Функция СформироватьФайлКонфигурации(Знач Адрес)
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("zip");
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ВременныйКаталогИсходныхФайлов = ПолучитьИмяВременногоФайла();
	
	ZipАрхив = Новый ЧтениеZipФайла(ИмяВременногоФайла);
	ZipАрхив.ИзвлечьВсе(ВременныйКаталогИсходныхФайлов, РежимВосстановленияПутейФайловZIP.Восстанавливать);
	ZipАрхив.Закрыть(); 
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Маска = "*"; // Получим все файлы и подкаталоги
	Файлы = НайтиФайлы(ВременныйКаталогИсходныхФайлов, Маска, Истина);
	
	Данные = ДанныеФайлов(файлы);
	СоответствиеМетодов = ОбработатьМодулиПереадресации(Данные.МодулиПереадресации);
	
	ЗаменитьДанныеВФайлах(Данные, СоответствиеМетодов);
	
	КаталогиКонвертации = Новый Структура;
	КаталогиКонвертации.Вставить("КаталогИБ", ПолучитьИмяВременногоФайла());
	КаталогиКонвертации.Вставить("ФайлВыгрузки", "");
	КаталогиКонвертации.Вставить("ВременныйКаталогИсходныхФайлов", ВременныйКаталогИсходныхФайлов);
	
	ЗапускКомандКонвертации(КаталогиКонвертации);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(КаталогиКонвертации.ФайлВыгрузки);
	
	УдалитьФайлы(ВременныйКаталогИсходныхФайлов);
	УдалитьФайлы(КаталогиКонвертации.КаталогИБ);
	УдалитьФайлы(КаталогиКонвертации.ФайлВыгрузки);
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции

&НаСервере
Процедура ЗапуститьПредприятие(ПараметрыЗапуска)
	
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("txt");
	ПараметрыЗапуска.Добавить("/Out " + ОбернутьВКавычки(ИмяФайлаЛога));
	
	СтрокаЗапуска = СтрСоединить(ПараметрыЗапуска, " ");
	КодВозврата = 0;
	Попытка
		ЗапуститьПриложение(СтрокаЗапуска,, Истина, КодВозврата); // BSLLS:ExternalAppStarting-off
	Исключение
		ТекстОшибки = ТекстОшибкиЗапуска(СтрокаЗапуска, ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Если КодВозврата <> 0 Тогда
		ЛогЗапуска = ПрочитатьФайл(ИмяФайлаЛога);
		ТекстОшибки = НСтр("ru = 'Операция не выполнена.'") + Символы.ПС 
			+ НСтр("ru = 'Строка запуска:'") + Символы.ПС 
			+ СтрокаЗапуска + Символы.ПС 
			+ НСтр("ru = 'Код возврата:'")+ " " + КодВозврата + Символы.ПС
			+ НСтр("ru = 'Содержимое лога'") + " " + ИмяФайлаЛога + ":" + Символы.ПС
			+ ЛогЗапуска;
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	УдалитьФайлы(ИмяФайлаЛога);
	
КонецПроцедуры

&НаСервере
Функция ОбернутьВКавычки(Строка)
	Возврат """" + СтрЗаменить(Строка, """", """""") + """";
КонецФункции

&НаСервере
Функция ПрочитатьФайл(ИмяФайла)
	Файл = Новый Файл(ИмяФайла);
	Если Не Файл.Существует() Тогда
		Возврат "";
	КонецЕсли;
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайла);
	Результат = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗапускКомандКонвертации(КаталогиКонвертации)
	
	ИсполняемыйФайл = КаталогПрограммы() + "1cv8.exe"; // пока только под windows
	
	РежимКонфигуратор = "DESIGNER";
	РежимСозданияБазы = "CREATEINFOBASE";
	
	// Создаем временную базу
	CreateInfobase(ИсполняемыйФайл, КаталогиКонвертации.КаталогИБ, РежимСозданияБазы);
	
	// Загружаем исходники во временную базу
	LoadConfigFromFiles(КаталогиКонвертации.ВременныйКаталогИсходныхФайлов,
		ИсполняемыйФайл,
		КаталогиКонвертации.КаталогИБ,
		РежимКонфигуратор);
	
	// Выгружаем конфигурацию
	Если ФорматСохранения = 0 Тогда
		КаталогиКонвертации.ФайлВыгрузки = ПолучитьИмяВременногоФайла("cf");
		DumpCfg(ИсполняемыйФайл, КаталогиКонвертации.КаталогИБ, РежимКонфигуратор, КаталогиКонвертации.ФайлВыгрузки);
	ИначеЕсли ФорматСохранения = 1 Тогда
		КаталогВыгрузки = ПолучитьИмяВременногоФайла();
		DumpConfigToFiles(ИсполняемыйФайл, КаталогиКонвертации.КаталогИБ, РежимКонфигуратор, КаталогВыгрузки);
		
		КаталогиКонвертации.ФайлВыгрузки = ПолучитьИмяВременногоФайла("zip"); 
		ЗаписьZip = Новый ЗаписьZipФайла(КаталогиКонвертации.ФайлВыгрузки, "", "", МетодСжатияZIP.Сжатие);
		
		ЗаписьZip.Добавить(КаталогВыгрузки + "\*",
		РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
		РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
		
		ЗаписьZip.Записать();
	КонецЕсли;
	
КонецПроцедуры

#Область КомандыПакетногоРежимаЗапуска

&НаСервере
Процедура CreateInfobase(ИсполняемыйФайл, КаталогИБ, РежимСозданияБазы)
	
	ПараметрыЗапуска = Новый Массив;
	ПараметрыЗапуска.Добавить(ОбернутьВКавычки(ИсполняемыйФайл));
	ПараметрыЗапуска.Добавить(РежимСозданияБазы);
	ПараметрыЗапуска.Добавить(ОбернутьВКавычки("FILE=""" + КаталогИБ + """"));
	
	ЗапуститьПредприятие(ПараметрыЗапуска);
	
КонецПроцедуры

&НаСервере
Процедура LoadConfigFromFiles(ВременныйКаталогИсходныхФайлов, ИсполняемыйФайл, КаталогИБ, РежимКонфигуратор)
	
	ПараметрыЗапуска = Новый Массив;
	ПараметрыЗапуска.Добавить(ОбернутьВКавычки(ИсполняемыйФайл));
	ПараметрыЗапуска.Добавить(РежимКонфигуратор);
	ПараметрыЗапуска.Добавить("/F");
	ПараметрыЗапуска.Добавить(ОбернутьВКавычки(КаталогИБ));
	ПараметрыЗапуска.Добавить("/LoadConfigFromFiles");
	ПараметрыЗапуска.Добавить(ОбернутьВКавычки(ВременныйКаталогИсходныхФайлов));
	ПараметрыЗапуска.Добавить("/UpdateDBCfg");
	ПараметрыЗапуска.Добавить("/DisableStartupMessages");
	ПараметрыЗапуска.Добавить("/DisableStartupDialogs");
	
	ЗапуститьПредприятие(ПараметрыЗапуска);
	
КонецПроцедуры

&НаСервере
Процедура DumpCfg(ИсполняемыйФайл, КаталогИБ, РежимКонфигуратор, ФайлВыгрузки)
	
	ПараметрыЗапуска = Новый Массив;
	ПараметрыЗапуска.Добавить(ОбернутьВКавычки(ИсполняемыйФайл));
	ПараметрыЗапуска.Добавить(РежимКонфигуратор);
	ПараметрыЗапуска.Добавить("/F");
	ПараметрыЗапуска.Добавить(ОбернутьВКавычки(КаталогИБ));
	ПараметрыЗапуска.Добавить("/DumpCfg");
	ПараметрыЗапуска.Добавить(ОбернутьВКавычки(ФайлВыгрузки));
	ПараметрыЗапуска.Добавить("/DisableStartupMessages");
	ПараметрыЗапуска.Добавить("/DisableStartupDialogs");
	
	ЗапуститьПредприятие(ПараметрыЗапуска);
	
КонецПроцедуры

&НаСервере
Процедура DumpConfigToFiles(ИсполняемыйФайл, КаталогИБ, РежимКонфигуратор, КаталогВыгрузки)
	
	ПараметрыЗапуска = Новый Массив;
	ПараметрыЗапуска.Добавить(ОбернутьВКавычки(ИсполняемыйФайл));
	ПараметрыЗапуска.Добавить(РежимКонфигуратор);
	ПараметрыЗапуска.Добавить("/F");
	ПараметрыЗапуска.Добавить(ОбернутьВКавычки(КаталогИБ));
	ПараметрыЗапуска.Добавить("/DumpConfigToFiles");
	ПараметрыЗапуска.Добавить(ОбернутьВКавычки(КаталогВыгрузки));
	ПараметрыЗапуска.Добавить("/DisableStartupMessages");
	ПараметрыЗапуска.Добавить("/DisableStartupDialogs");
	
	ЗапуститьПредприятие(ПараметрыЗапуска);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ДанныеФайлов(Файлы)
	
	Результат = Новый Структура("МодулиПереадресации, Модули", Новый Массив, Новый Массив);
	
	МаркерПереадресации = МаркерПереадресации();
	Ключи = "ПолноеИмя,Имя,ЭтоФайл,Расширение";
	
	Просмотренные = Новый Массив;
	
	Для Каждого Файл Из Файлы Цикл
		ДанныеМодуля = Новый Структура(Ключи);
		ЗаполнитьЗначенияСвойств(ДанныеМодуля, Файл);
		ДанныеМодуля.ЭтоФайл = Файл.ЭтоФайл();
		
		ОбработатьФайлЗаменаПрефикса(ДанныеМодуля, Просмотренные, Файл);
		
		Если СтрНайти(ДанныеМодуля.ПолноеИмя, МаркерПереадресации) > 0
			И ДанныеМодуля.Расширение = РасширениеИсходныхФайлов Тогда
			Результат.МодулиПереадресации.Добавить(ДанныеМодуля);
		КонецЕсли;
		Результат.Модули.Добавить(ДанныеМодуля);
	КонецЦикла;
	
	УдалитьПросмотренныеФайлы(Просмотренные);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбработатьФайлЗаменаПрефикса(ДанныеМодуля, Просмотренные, Знач Файл)
	
	Если Не ЗаменятьПрефиксКонфигурации Тогда
		Возврат;
	КонецЕсли;
	
	Если Не (СтрНачинаетсяС(Файл.Имя, ПрефиксБиблиотеки) Или СтрНайти(Файл.ПолноеИмя, ПрефиксБиблиотеки) > 0) Тогда
		Возврат;
	КонецЕсли;
	
	ПолныйПуть = СтрЗаменить(Файл.ПолноеИмя, ПрефиксБиблиотеки, ПрефиксКонфигурации);
	
	Если Файл.ЭтоКаталог() Тогда
		СоздатьКаталог(ПолныйПуть);
	Иначе
		КопироватьФайл(Файл.ПолноеИмя, ПолныйПуть);
	КонецЕсли;
	ДанныеМодуля.ПолноеИмя = ПолныйПуть;
	
	Если СтрНачинаетсяС(Файл.Имя, ПрефиксБиблиотеки) Тогда
		НовоеИмя = СтрЗаменить(Файл.Имя, ПрефиксБиблиотеки, ПрефиксКонфигурации);
		ДанныеМодуля.Имя = НовоеИмя;
		
		Просмотренные.Добавить(Файл.ПолноеИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПросмотренныеФайлы(Просмотренные)
	
	Для Каждого Путь Из Просмотренные Цикл
		УдалитьФайлы(Путь);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаменитьДанныеВФайлах(Данные, СоответствиеМетодов)
	
	ШаблонДляСтрок = ПрефиксБиблиотеки + ИмяМодуляПереадресации;
	МаркерПереадресации = МаркерПереадресации();
	
	Сч = 1;
	Для Каждого ДанныеМодуля Из Данные.Модули Цикл
		Результат = СтрНайтиПоРегулярномуВыражению(ДанныеМодуля.ПолноеИмя, МаркерПереадресации, , , ,Истина);
		Если АдаптироватьПодБСП И Результат.НачальнаяПозиция > 0 Тогда
			УдалитьФайлы(ДанныеМодуля.ПолноеИмя);
			Продолжить;
		КонецЕсли;
		
		Если Не ДанныеМодуля.ЭтоФайл Тогда
			Продолжить;
		КонецЕсли;
		
		Контекст = СоздатьКонтекстФайла(ДанныеМодуля, СоответствиеМетодов, ШаблонДляСтрок);
		
		ПрочитатьЗаписатьДанныеВФайл(Контекст);
		
		Сч = Сч + 1;
	КонецЦикла;
	Текст = СтрШаблон(НСтр("ru = 'Успешно обработано файлов и каталогов: %1'"), Сч);
	СообщитьПользователю(Текст)
	
КонецПроцедуры

#Область ОбработкаФайлов

&НаСервереБезКонтекста
Функция СоздатьКонтекстФайла(ДанныеМодуля, СоответствиеМетодов, ШаблонДляСтрок)
	
	БуферСтроки = Новый Структура("Строка,Позиция,Заполнен,СтрокаОбработана", "", 0, Ложь, Ложь);
	
	Контекст = Новый Структура;
	Контекст.Вставить("ДанныеМодуля", ДанныеМодуля);
	Контекст.Вставить("СоответствиеМетодов", СоответствиеМетодов);
	Контекст.Вставить("ШаблонДляСтрок", ШаблонДляСтрок);
	Контекст.Вставить("БуферСтроки", БуферСтроки);
	
	Возврат Контекст;
	
КонецФункции

&НаСервере
Процедура ПрочитатьЗаписатьДанныеВФайл(Контекст)
	
	ДанныеМодуля = Контекст.ДанныеМодуля;
	
	Если ЭтоИзображение(ДанныеМодуля.Расширение) Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстКонстант = Новый Структура(
		"ТегProperties,ТегChildObjects,ТегSynonym,РасширениеXML,ФайлConfig",
		"Properties", "ChildObjects", "Synonym", ".xml", "Configuration.xml"
	);
	
	ФайловыйПоток = Новый ФайловыйПоток(ДанныеМодуля.ПолноеИмя, РежимОткрытияФайла.Открыть);
	Чтение = Новый ЧтениеДанных(ФайловыйПоток);
	
	ВременныйФайл = ПолучитьИмяВременногоФайла(ДанныеМодуля.Расширение);
	ПотокДанных = Новый ФайловыйПоток(ВременныйФайл, РежимОткрытияФайла.Создать);
	Запись = Новый ЗаписьДанных(ПотокДанных);
	Запись.РазделительСтрок = "";
	
	ПредыдущаяСтрока = "";
	
	// Работа с синонимом
	БуферXML = Новый Массив;
	ВБуфере = Ложь;
	ЭтоТегProperties = Ложь;
	ЭтоТегChildObjects = Ложь;
	
	Пока Не Чтение.ЧтениеЗавершено Цикл
		ИсходнаяСтрока = Чтение.ПрочитатьСтроку();
		
		ПолучитьДанныеКонфигурации(ДанныеМодуля, ИсходнаяСтрока);
		
		ОбработаннаяСтрока = ИсходнаяСтрока;
		
		Если ОбработатьСтрокуПодБСП(ОбработаннаяСтрока, Контекст) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Контекст.БуферСтроки.СтрокаОбработана Тогда
			ПредыдущаяСтрока = Контекст.БуферСтроки.Строка;
			Контекст.БуферСтроки.Заполнен = Ложь;
			Контекст.БуферСтроки.СтрокаОбработана = Ложь;
		КонецЕсли;
		
		ЗаменитьПрефиксаБиблиотеки(ОбработаннаяСтрока);
		
		ЭтоТегProperties = ОбновитьФлаг(ОбработаннаяСтрока, КонтекстКонстант.ТегProperties, ЭтоТегProperties);
		ЭтоТегChildObjects = ОбновитьФлаг(ОбработаннаяСтрока, КонтекстКонстант.ТегChildObjects, ЭтоТегChildObjects);
		Если ИспользоватьПрефиксСуффиксСинонима
			И (НужноДобавитьВБуфер(ЭтоТегProperties, ЭтоТегChildObjects, ДанныеМодуля, ОбработаннаяСтрока, КонтекстКонстант)
			Или ВБуфере) Тогда
			БуферXML.Добавить(ОбработаннаяСтрока);
			ВБуфере = Истина;
			
			ОбработатьЕслиЗакрылсяТегСиноним(ОбработаннаяСтрока, КонтекстКонстант, БуферXML, ПредыдущаяСтрока, ВБуфере);
		КонецЕсли;
		
		Если Не ПустаяСтрока(ПредыдущаяСтрока) И Не ВБуфере Тогда
			Запись.ЗаписатьСтроку(ПредыдущаяСтрока, , Символы.ПС);
		КонецЕсли;
		
		ПредыдущаяСтрока = ОбработаннаяСтрока;
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ПредыдущаяСтрока) Тогда
		Запись.ЗаписатьСтроку(ПредыдущаяСтрока);
	КонецЕсли;
	
	Чтение.Закрыть();
	ФайловыйПоток.Закрыть();
	
	Запись.Закрыть();
	ПотокДанных.Закрыть();
	
	КопироватьФайл(ВременныйФайл, ДанныеМодуля.ПолноеИмя);
	
	УдалитьФайлы(ВременныйФайл);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЕслиЗакрылсяТегСиноним(ОбработаннаяСтрока, КонтекстКонстант, БуферXML, ПредыдущаяСтрока, ВБуфере)
	Если СтрНайти(ОбработаннаяСтрока, "</" + КонтекстКонстант.ТегSynonym + ">") > 0 Тогда
		ПредыдущаяСтрока = "";
		ОбработаннаяСтрока = ОбработатьБуферСинонима(БуферXML);
		БуферXML = Новый Массив;
		ВБуфере = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЭтоСтрокаСинонима(ДанныеМодуля, Строка, Константы)
	Возврат ДанныеМодуля.Расширение = Константы.РасширениеXML И ДанныеМодуля.Имя <> Константы.ФайлConfig И
		(СтрНайти(Строка, "<" + Константы.ТегSynonym + ">") > 0 Или СтрНайти(Строка, "</" + Константы.ТегSynonym + ">") > 0);
КонецФункции

&НаСервере
Функция ОбновитьФлаг(Строка, ИмяТега, БылоВнутри)
	
	Если СтрНайти(Строка, "<" + ИмяТега + ">") > 0 Тогда
		Возврат Истина;
	ИначеЕсли СтрНайти(Строка, "</" + ИмяТега + ">") > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат БылоВнутри;
	
КонецФункции

&НаСервере
Функция НужноДобавитьВБуфер(ЭтоТегProperties, ЭтоТегChildObjects, ДанныеМодуля, Строка, Константы)
	Возврат Не ЭтоТегChildObjects И ЭтоТегProperties И ЭтоСтрокаСинонима(ДанныеМодуля, Строка, Константы);
КонецФункции

&НаСервере
Функция ОбработатьБуферСинонима(БуферXML)
	
	xmlns = "xmlns:v8=""http://v8.1c.ru/8.1/data/core"">";
	
	БуферXML[0] = СтрЗаменить(БуферXML[0], ">", " " + xmlns);
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрСоединить(БуферXML, Символы.ПС));
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
	ТекущийЯзык = "";
	Элемент = "";
	Пока ЧтениеXML.Прочитать() Цикл
		ТипУзла = ЧтениеXML.ТипУзла;
		
		Если ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента(ЧтениеXML.Имя);
			Элемент = ЧтениеXML.ЛокальноеИмя;
			
		ИначеЕсли ТипУзла = ТипУзлаXML.Текст Тогда
			Значение = ЧтениеXML.Значение;
			
			Если Элемент = "lang" Тогда
				ТекущийЯзык = Значение;
			ИначеЕсли Элемент = "content" Тогда
				ЗаписьXML.ЗаписатьТекст(ДобавитьПрефиксСуффиксКСинониму(Значение, ТекущийЯзык));
			Иначе
				ЗаписьXML.ЗаписатьТекст(Значение);
			КонецЕсли;
			
		ИначеЕсли ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		ИначеЕсли ТипУзла = ТипУзлаXML.Комментарий Тогда
			ЗаписьXML.ЗаписатьКомментарий(ЧтениеXML.Значение());
		КонецЕсли;
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

&НаСервере
Функция ДобавитьПрефиксСуффиксКСинониму(Значение, Язык)
	
	Если ПустаяСтрока(ВыбратьПрефиксСуффикс) Тогда
		Возврат Значение;
	КонецЕсли;
	
	Метка = "";
	
	Если Язык = "ru" Тогда
		Метка = ПрефиксСуффиксСинонимаRU;
	ИначеЕсли Язык = "en" Тогда
		Метка = ПрефиксСуффиксСинонимаEN;
	КонецЕсли;
	
	БуфферТекста = Новый Массив(2);
	
	БуфферТекста[0] = Метка;
	БуфферТекста[1] = Значение;
	
	Если ВыбратьПрефиксСуффикс = "Суффикс" Тогда
		БуфферТекста[0] = Значение;
		БуфферТекста[1] = ПрефиксСуффиксСинонимаRU;
	КонецЕсли;
	
	Возврат СтрСоединить(БуфферТекста, " ");
	
КонецФункции

&НаСервере
Процедура ПолучитьДанныеКонфигурации(ДанныеМодуля, ВходящаяСтрока)
	
	Если ДанныеМодуля.Имя <> "Configuration.xml" Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(ВходящаяСтрока, "<Name>") > 0 Тогда
		ИмяКонфигурации = ПолучитьЗначениеТега(ВходящаяСтрока);
	ИначеЕсли СтрНайти(ВходящаяСтрока, "<Version>") > 0 Тогда
		ВерсияКонфигурации = ПолучитьЗначениеТега(ВходящаяСтрока);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеТега(ВходящаяСтрока)
	
	ПозицияЗакрывающегоСимвола = СтрНайти(ВходящаяСтрока, ">");
	ЧислоСимволов = СтрНайти(ВходящаяСтрока, "<", , ПозицияЗакрывающегоСимвола) - ПозицияЗакрывающегоСимвола - 1;
	НайденноеЗначение = Сред(ВходящаяСтрока, ПозицияЗакрывающегоСимвола + 1, ЧислоСимволов);
	
	Возврат НайденноеЗначение;
	
КонецФункции

&НаСервере
Функция ЭтоИзображение(Расширение)
	Возврат Не ФорматыКартинок()[Расширение] = Неопределено;
КонецФункции

&НаСервере
Функция ФорматыКартинок()
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить(".bmp", Истина);
	Соответствие.Вставить(".emf", Истина);
	Соответствие.Вставить(".gif", Истина);
	Соответствие.Вставить(".icon", Истина);
	Соответствие.Вставить(".jpeg", Истина);
	Соответствие.Вставить(".png", Истина);
	Соответствие.Вставить(".svg", Истина);
	Соответствие.Вставить(".tiff", Истина);
	Соответствие.Вставить(".wmf", Истина);
	
	Возврат Соответствие;
	
КонецФункции

&НаСервере
Процедура ЗаменитьПрефиксаБиблиотеки(ВходящаяСтрока)
	
	Если Не ЗаменятьПрефиксКонфигурации Или СтрНайти(ВходящаяСтрока, ПрефиксБиблиотеки) = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВходящаяСтрока = СтрЗаменить(ВходящаяСтрока, ПрефиксБиблиотеки, ПрефиксКонфигурации);
	
КонецПроцедуры

&НаСервере
Процедура ЗаменитьПрефиксаСуффиксаБиблиотекиВСинониме(ВходящаяСтрока) // не используется
	
	Если Не ЗаменятьПрефиксКонфигурации Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонРегВыражения = "(?<=^|\[)%1(?= |])";
	
	РегВыражениеRU = СтрШаблон(ШаблонРегВыражения, ПрефиксСуффиксСинонимовБиблиотеки);
	РегВыражениеEN = СтрШаблон(ШаблонРегВыражения, ПрефиксСуффиксСинонимовБиблиотекиEN);
	
	РезультатRU = СтрНайтиПоРегулярномуВыражению(ВходящаяСтрока, РегВыражениеRU, , , , Истина);
	РезультатEN = СтрНайтиПоРегулярномуВыражению(ВходящаяСтрока, РегВыражениеEN, , , , Истина);
	
	Если РезультатRU.НачальнаяПозиция = 0 И РезультатEN.НачальнаяПозиция = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаменитьПрефиксСуффиксСинонимаПоРегВыражению(ВходящаяСтрока, ПрефиксСуффиксСинонимаRU, РезультатRU);
	ЗаменитьПрефиксСуффиксСинонимаПоРегВыражению(ВходящаяСтрока, ПрефиксСуффиксСинонимаEN, РезультатEN);
	
КонецПроцедуры

&НаСервере
Процедура ЗаменитьПрефиксСуффиксСинонимаПоРегВыражению(ВходящаяСтрока, СтрокаЗамены, РезультатПоиска) // не используется
	
	Если РезультатПоиска.НачальнаяПозиция = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Части = Новый Массив;
	Части.Добавить(Лев(ВходящаяСтрока, РезультатПоиска.НачальнаяПозиция - 1));
	Части.Добавить(СтрокаЗамены);
	Части.Добавить(Прав(ВходящаяСтрока,
		СтрДлина(ВходящаяСтрока) - РезультатПоиска.НачальнаяПозиция - РезультатПоиска.Длина + 1));
	
	ВходящаяСтрока = СтрСоединить(Части);
	
КонецПроцедуры

&НаСервере
Функция ОбработатьСтрокуПодБСП(ТекущаяСтрока, Контекст)
	
	Если Не АдаптироватьПодБСП Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПозицияОМ = СтрНайтиПоРегулярномуВыражению(ТекущаяСтрока, Контекст.ШаблонДляСтрок, , , , Истина).НачальнаяПозиция;
	
	Если ПозицияОМ = 0 И Не Контекст.БуферСтроки.Заполнен Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Контекст.ДанныеМодуля.Расширение = ".xml" Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПозицияОМ = ?(ПозицияОМ = 0, 1, ПозицияОМ);
	
	Рег = "\.[A-Za-zА-Яа-я_][A-Za-zА-Яа-я0-9_]*";
	
	ПозицияМетода = СтрНайтиПоРегулярномуВыражению(ТекущаяСтрока, Рег, , ПозицияОМ, , Истина).НачальнаяПозиция;
	
	// Буферизация, если метод на следующей строке
	Если ПозицияМетода = 0 И Не Контекст.БуферСтроки.Заполнен Тогда
		Контекст.БуферСтроки.Строка = ТекущаяСтрока;
		Контекст.БуферСтроки.Позиция = ПозицияОМ;
		Контекст.БуферСтроки.Заполнен = Истина;
		
		Возврат Ложь;
	КонецЕсли;
	
	Если Контекст.БуферСтроки.Заполнен Тогда
		ЗаменитьПереадресациюМодулемБСП(Контекст, ПозицияМетода, ПозицияОМ, ТекущаяСтрока, Истина);
		Контекст.БуферСтроки.СтрокаОбработана = Истина;
		
		Возврат Ложь;
	КонецЕсли;
	
	ЗаменитьПереадресациюМодулемБСП(Контекст, ПозицияМетода, ПозицияОМ, ТекущаяСтрока);
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ЗаменитьПереадресациюМодулемБСП(Контекст, ПозицияМетода, ПозицияОМ, ТекущаяСтрока, МетодВБуфере = Ложь)
	
	Пока ПозицияОМ > 0 Цикл
		ПозицияПараметров = СтрНайти(ТекущаяСтрока, "(", , ПозицияМетода);
		Метод = Сред(ТекущаяСтрока, ПозицияМетода + 1, ПозицияПараметров - ПозицияМетода - 1);
		
		МодульОМ = Сред(ТекущаяСтрока, ПозицияОМ, ПозицияМетода - ПозицияОМ);
		Если МетодВБуфере Тогда
			МодульОМ = Сред(Контекст.БуферСтроки.Строка,
				Контекст.БуферСтроки.Позиция,
				СтрНайти(Контекст.БуферСтроки.Строка, ".") - Контекст.БуферСтроки.Позиция);
		КонецЕсли;
		
		ИмяМодуляБСП = ПолучитьМетодИзКонтекста(Контекст, МодульОМ, Метод);
		
		ТекущаяСтрока = СтрЗаменить(ТекущаяСтрока, МодульОМ, ИмяМодуляБСП);
		Если МетодВБуфере Тогда
			Контекст.БуферСтроки.Строка = СтрЗаменить(Контекст.БуферСтроки.Строка, МодульОМ, ИмяМодуляБСП);
		КонецЕсли;
		
		ПозицияОМ = СтрНайтиПоРегулярномуВыражению(ТекущаяСтрока, Контекст.ШаблонДляСтрок, , , , Истина).НачальнаяПозиция;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМетодИзКонтекста(Контекст, МодульОМ, Метод)
	
	ИмяДляПоиска = ?(ЗаменятьПрефиксКонфигурации, СтрЗаменить(МодульОМ, ПрефиксБиблиотеки, ПрефиксКонфигурации), МодульОМ);
	Методы = Контекст.СоответствиеМетодов[НРег(ИмяДляПоиска)];
	
	Если Методы = Неопределено Или Методы[Метод] = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Методы[Метод];
	
КонецФункции

#КонецОбласти

#Область ПарсерМодулейПереадресации

&НаСервере
Функция ОбработатьМодулиПереадресации(МодулиПереадресации)
	
	Если Не АдаптироватьПодБСП Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Маркеры = ПолучитьМаркеры();
	
	СтруктураМодулей = Новый Соответствие;
	
	Для Каждого ДанныеМодуля Из МодулиПереадресации Цикл
		ИмяМодуля = ПолучитьИмяМодуля(ДанныеМодуля.ПолноеИмя, Маркеры.МаркерПереадресации);
		
		СтруктураМодулей.Вставить(ИмяМодуля, Новый Соответствие);
		
		Контекст = СоздатьКонтекстОбработки(ИмяМодуля, СтруктураМодулей, Маркеры);
		
		ФайловыйПоток = Новый ФайловыйПоток(ДанныеМодуля.ПолноеИмя, РежимОткрытияФайла.Открыть);
		Чтение = Новый ЧтениеДанных(ФайловыйПоток);
		ОбластьПереадресации = Ложь;
		
		Пока Не Чтение.ЧтениеЗавершено Цикл
			Стр = Чтение.ПрочитатьСтроку();
			
			Если ЭтоНачалаОбластиПереадресации(Стр, Контекст) Тогда
				ОбластьПереадресации = Истина;
			КонецЕсли;
			
			Если СтрНачинаетсяС(Стр, "//") Или Не ОбластьПереадресации Тогда
				Продолжить;
			КонецЕсли;
			
			Если ОбластьПереадресации И ОбработатьСтроку(Стр, Контекст) Тогда
				ОбластьПереадресации = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Чтение.Закрыть();
		
		ФайловыйПоток.Закрыть();
	КонецЦикла;
	
	Возврат СтруктураМодулей;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоНачалаОбластиПереадресации(Стр, Контекст)
	Возврат СтрНачинаетсяС(Стр, Контекст.Маркеры.МаркерНачалоОбласти)
		И СтрНайти(Стр, Контекст.Маркеры.МаркерОбластьПереадресации) > 0;
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьКонтекстОбработки(ИмяМодуля, СтруктураМодулей, Маркеры)
	
	Контекст = Новый Структура;
	Контекст.Вставить("СтекОбластей", Новый Массив);
	Контекст.Вставить("ТекущийМодуль", "");
	Контекст.Вставить("ИмяМодуля", ИмяМодуля);
	Контекст.Вставить("СтруктураМодулей", СтруктураМодулей);
	Контекст.Вставить("Маркеры", Маркеры);
	Возврат Контекст;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИмяМодуля(ПолноеИмя, МаркерПрефикс)
	
	Позиция = СтрНайти(ПолноеИмя, МаркерПрефикс);
	Разделитель = СтрНайти(ПолноеИмя, "\", , СтрНайти(ПолноеИмя, МаркерПрефикс));
	
	ИмяМодуля = НРег(Сред(ПолноеИмя, Позиция, Разделитель - Позиция));
	
	Возврат ИмяМодуля;
	
КонецФункции

&НаСервере
Функция ПолучитьМаркеры()
	
	Маркеры = Новый Структура;
	
	Маркеры.Вставить("МаркерНачалоОбласти", "#Область");
	Маркеры.Вставить("МаркерКонецОбласти", "#КонецОбласти");
	Маркеры.Вставить("МаркерОбластьПереадресации", "ПереадресацияМетодов");
	Маркеры.Вставить("МаркерПроцедура", "Процедура");
	Маркеры.Вставить("МаркерФункция", "Функция");
	Маркеры.Вставить("МаркерПереадресации", МаркерПереадресации());
	
	Возврат Новый ФиксированнаяСтруктура(Маркеры);
	
КонецФункции

&НаСервере
Функция МаркерПереадресации()
	
	Если ЗаменятьПрефиксКонфигурации Тогда
		Возврат ПрефиксКонфигурации + ИмяМодуляПереадресации;
	КонецЕсли;
	
	Возврат ПрефиксБиблиотеки + ИмяМодуляПереадресации;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбработатьСтроку(Стр, Контекст)
	
	Если СтрНачинаетсяС(Стр, Контекст.Маркеры.МаркерНачалоОбласти) Тогда
		ОбработатьНачалоОбласти(Стр, Контекст);
		
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрНачинаетсяС(Стр, Контекст.Маркеры.МаркерКонецОбласти) Тогда
		ОбработатьКонецОбласти(Стр, Контекст);
		
		Возврат Контекст.СтекОбластей.Количество() = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контекст.ТекущийМодуль)
		И СтрНачинаетсяС(Стр, Контекст.Маркеры.МаркерПроцедура) Или СтрНачинаетсяС(Стр, Контекст.Маркеры.МаркерФункция) Тогда
		ОбработатьПроцедуруФункцию(Стр, Контекст);
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбработатьНачалоОбласти(Стр, Контекст)
	
	ДопустимоеКоличествоЭлементовВСтеке = 2;
	
	Контекст.СтекОбластей.Добавить(Контекст.Маркеры.МаркерНачалоОбласти);
	
	Если Контекст.СтекОбластей.Количество() <= ДопустимоеКоличествоЭлементовВСтеке
		И СтрНайти(Стр, Контекст.Маркеры.МаркерОбластьПереадресации) = 0 Тогда
		Контекст.ТекущийМодуль = Прав(Стр, СтрДлина(Стр) - СтрНайти(Стр, " "));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьКонецОбласти(Стр, Контекст)
	
	Контекст.СтекОбластей.Удалить(Контекст.СтекОбластей.ВГраница());
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьПроцедуруФункцию(Стр, Контекст)
	
	ПозицияРазделителя = СтрНайти(Стр, " ");
	ПозицияСкобки = СтрНайти(Стр, "(", НаправлениеПоиска.СКонца);
	
	ИмяМетода = Сред(Стр, ПозицияРазделителя + 1, ПозицияСкобки - ПозицияРазделителя - 1);
	
	Контекст.СтруктураМодулей[Контекст.ИмяМодуля].Вставить(ИмяМетода, Контекст.ТекущийМодуль);
	
КонецПроцедуры

#КонецОбласти

#Область Сообщения

&НаКлиенте
Процедура СообщитьОбОшибкеВыбранногоКаталога()
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = НСтр("ru = 'Укажите каталог с исходными файлами!';
		|en = 'Specify the directory with the source files' ");
	Сообщение.Поле = "КаталогИсходныхФайлов";
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаСервере
Функция ТекстОшибкиЗапуска(СтрокаЗапуска, ИнформацияОбОшибке)
	
	ШаблонОшибки = НСтр("ru = 'Не удалось запустить: %1 по причине: %2'");
	ТекстОшибки = СтрШаблон(ШаблонОшибки,
		СтрокаЗапуска,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
	Возврат ТекстОшибки;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СообщитьПользователю(Текст, ПутьКДанным = "")
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.ПутьКДанным = ПутьКДанным;
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Асинх Функция ЭтоКаталогСИсходнымиФайлами()
	
	Файлы = Ждать НайтиФайлыАсинх(КаталогИсходныхФайлов, "Configuration.xml");
	
	Возврат ЗначениеЗаполнено(Файлы);
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьПрефиксаКонфигурации()
	Элементы.ГруппаПрефиксКонфигурации.Видимость = ЗаменятьПрефиксКонфигурации;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПрефиксаСуффикса()
	Элементы.ГруппаПрефиксСуффиксСиноним.Видимость = ИспользоватьПрефиксСуффиксСинонима;
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияСлужебныхРеквизитов()
	
	ИмяМодуляПереадресации = "Переадресация";
	ПрефиксБиблиотеки = "пбп_";
	РасширениеИсходныхФайлов = ".bsl";
	ПрефиксСуффиксСинонимовБиблиотеки = "пбп";
	ПрефиксСуффиксСинонимовБиблиотекиEN = "pssl";
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции