
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьПрефикса();
	УстановитьЗначенияСлужебныхРеквизитов();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ПодготовитьКонфигурацию(Команда)
	
	Если Ждать ПроверитьПути() Тогда
		ЗапуститьОбработку();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Асинх Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Результат = Ждать Диалог.ВыбратьАсинх();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		КаталогИсходныхФайлов = Результат[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыходнойПутьНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Результат = Ждать Диалог.ВыбратьАсинх();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ВыходнойПуть = Результат[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменятьПрефиксПриИзменении(Элемент)
	УстановитьВидимостьПрефикса();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Функция ПроверитьПути()
	
	Если Не Ждать ЭтоКаталогСИсходнымиФайлами() Тогда
		СообщитьОбОшибкеВыбранногоКаталога();
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВыходнойПуть) Тогда
		СообщитьОбОшибкеВыходногоПути();
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Асинх Процедура ЗапуститьОбработку()
	
	ИмяВременногоФайлаАрхив = ПолучитьИмяВременногоФайла("zip"); 
	ЗаписьZip = Новый ЗаписьZipФайла(ИмяВременногоФайлаАрхив, "", "", МетодСжатияZIP.Сжатие);
	
	ЗаписьZip.Добавить(КаталогИсходныхФайлов + "\*",
		РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
		РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	
	ЗаписьZip.Записать();
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайлаАрхив);
	
	Ждать УдалитьФайлыАсинх(ИмяВременногоФайлаАрхив);
	
	Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	АдресФайлаВыгрузки = СформироватьФайлКонфигурации(Адрес);
	
	Файл = ПолучитьИзВременногоХранилища(АдресФайлаВыгрузки);
	
	ИмяФайлаВыгрузки = ПолучитьИмяВременногоФайла(".cf");
	
	Ждать Файл.ЗаписатьАсинх(ИмяФайлаВыгрузки);
	
	Имя = Прав(ИмяФайлаВыгрузки, СтрДлина(ИмяФайлаВыгрузки) - СтрНайти(ИмяФайлаВыгрузки, "\", НаправлениеПоиска.СКонца));
	Ждать КопироватьФайлАсинх(ИмяФайлаВыгрузки, ВыходнойПуть + "\" + Имя);
	
	Ждать УдалитьФайлыАсинх(ИмяФайлаВыгрузки);
	
КонецПроцедуры

&НаСервере
Функция СформироватьФайлКонфигурации(Знач Адрес)
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("zip");
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ВременныйКаталогИсходныхФайлов = ПолучитьИмяВременногоФайла();
	
	ZipАрхив = Новый ЧтениеZipФайла(ИмяВременногоФайла);
	ZipАрхив.ИзвлечьВсе(ВременныйКаталогИсходныхФайлов, РежимВосстановленияПутейФайловZIP.Восстанавливать);
	ZipАрхив.Закрыть(); 
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Маска = "*"; // Получим все файлы и подкаталоги
	Файлы = НайтиФайлы(ВременныйКаталогИсходныхФайлов, Маска, Истина);
	
	Данные = ДанныеФайлов(файлы);
	СоответствиеМетодов = ОбработатьМодулиПереадресации(Данные.МодулиПереадресации);
	
	ЗаменитьДанныеВФайлах(Данные, СоответствиеМетодов);
	
	КаталогИБ = ПолучитьИмяВременногоФайла();
	ФайлВыгрузки = ПолучитьИмяВременногоФайла(".cf");
	
	ЗапускКомандыКонвертации(ВременныйКаталогИсходныхФайлов, КаталогИБ, ФайлВыгрузки);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ФайлВыгрузки);
	
	УдалитьФайлы(ВременныйКаталогИсходныхФайлов);
	УдалитьФайлы(КаталогИБ);
	УдалитьФайлы(ФайлВыгрузки);
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции

&НаСервере
Процедура ЗапускКомандыКонвертации(ВременныйКаталогИсходныхФайлов, КаталогИБ, ФайлВыгрузки)
	
	ИсполняемыйФайл = КаталогПрограммы() + "1cv8.exe"; // пока только под windows
	
	РежимКонфигуратор = "DESIGNER";
	РежимСозданияБазы = "CREATEINFOBASE";
	
	// Создаем временную базу
	СтрокаПараметров = """%1"" %2 FILE=""%3"" /DisableStartupDialogs";
	СтрокаЗапуска = СтрШаблон(СтрокаПараметров, ИсполняемыйФайл, РежимСозданияБазы, КаталогИБ);
	
	КодВозврата = 0;
	Попытка
		// BSLLS:ExternalAppStarting-off
		ЗапуститьПриложение(СтрокаЗапуска, , Истина, КодВозврата);
		// BSLLS:ExternalAppStarting-on
	Исключение
		ТекстОшибки = ТекстОшибкиЗапуска(СтрокаЗапуска, ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	// Загружаем исходники во временную базу
	СтрокаПараметров = """%1"" %2 /F ""%3"" /LoadConfigFromFiles ""%4"" /UpdateDBCfg /DisableStartupDialogs";
	СтрокаЗапуска = СтрШаблон(СтрокаПараметров,
		ИсполняемыйФайл,
		РежимКонфигуратор,
		КаталогИБ,
		ВременныйКаталогИсходныхФайлов);
	
	КодВозврата = 0;
	Попытка
		// BSLLS:ExternalAppStarting-off
		ЗапуститьПриложение(СтрокаЗапуска, , Истина, КодВозврата);
		// BSLLS:ExternalAppStarting-on
	Исключение
		ТекстОшибки = ТекстОшибкиЗапуска(СтрокаЗапуска, ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	// Выгружаем конфигурацию
	СтрокаПараметров = """%1"" %2 /F ""%3"" /DumpCfg ""%4"" /DisableStartupDialogs";
	СтрокаЗапуска = СтрШаблон(СтрокаПараметров, ИсполняемыйФайл, РежимКонфигуратор, КаталогИБ, ФайлВыгрузки);
	
	КодВозврата = 0;
	Попытка
		// BSLLS:ExternalAppStarting-off
		ЗапуститьПриложение(СтрокаЗапуска, , Истина, КодВозврата);
		// BSLLS:ExternalAppStarting-on
	Исключение
		ТекстОшибки = ТекстОшибкиЗапуска(СтрокаЗапуска, ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Если КодВозврата <> 0 Тогда
		ТекстОшибки = НСтр("ru = 'Операция не выполнена.'") + Символы.ПС 
			+ НСтр("ru = 'Строка запуска:'") + Символы.ПС 
			+ СтрокаЗапуска + Символы.ПС 
			+ НСтр("ru = 'Код возврата:'")+ " " + КодВозврата + Символы.ПС;
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокиКоманд()
	
	СтрокиКоманд = Новый Структура;
	СтрокиКоманд.Вставить("CREATEINFOBASE", "FILE=""%3"" /DisableStartupDialogs");
	СтрокиКоманд.Вставить("LoadConfigFromFiles",
		"/F ""%3"" /LoadConfigFromFiles ""%4"" /UpdateDBCfg /DisableStartupDialogs");
	СтрокиКоманд.Вставить("DumpCfg", "/F ""%3"" /DumpCfg ""%4"" /DisableStartupDialogs");
	
	Возврат СтрокиКоманд;
	
КонецФункции

&НаСервере
Функция ПолучитьРежимыВыполненияКоманд()
	
	РежимыВыполненияКоманд = Новый Структура;
	РежимыВыполненияКоманд.Вставить("РежимКонфигуратора", "DESIGNER");
	РежимыВыполненияКоманд.Вставить("РежимПредприятия", "ENTERPRISE");
	РежимыВыполненияКоманд.Вставить("РежимСозданияИБ", "CREATEINFOBASE");
	
	Возврат РежимыВыполненияКоманд;
	
КонецФункции

&НаСервере
Функция ДанныеФайлов(Файлы)
	
	Результат = Новый Структура("МодулиПереадресации, Модули", Новый Массив, Новый Массив);
	
	МаркерПереадресации = МаркерПереадресации();
	Ключи = "ПолноеИмя,Имя,ЭтоФайл,Расширение";
	
	Просмотренные = Новый Массив;
	
	Для Каждого Файл Из Файлы Цикл
		ДанныеМодуля = Новый Структура(Ключи);
		ЗаполнитьЗначенияСвойств(ДанныеМодуля, Файл);
		ДанныеМодуля.ЭтоФайл = Файл.ЭтоФайл();
		
		ОбработатьФайлЗаменаПрефикса(ДанныеМодуля, Просмотренные, Файл);
		
		Если СтрНайти(ДанныеМодуля.ПолноеИмя, МаркерПереадресации) > 0
			И ДанныеМодуля.Расширение = РасширениеИсходныхФайлов Тогда
			Результат.МодулиПереадресации.Добавить(ДанныеМодуля);
		КонецЕсли;
		Результат.Модули.Добавить(ДанныеМодуля);
	КонецЦикла;
	
	УдалитьПросмотренныеФайлы(Просмотренные);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбработатьФайлЗаменаПрефикса(ДанныеМодуля, Просмотренные, Знач Файл)
	
	Если Не ЗаменятьПрефикс Тогда
		Возврат;
	КонецЕсли;
	
	Если Не (СтрНачинаетсяС(Файл.Имя, ПрефиксБиблиотеки) Или СтрНайти(Файл.ПолноеИмя, ПрефиксБиблиотеки) > 0) Тогда
		Возврат;
	КонецЕсли;
	
	ПолныйПуть = СтрЗаменить(Файл.ПолноеИмя, ПрефиксБиблиотеки, Префикс);
	
	Если Файл.ЭтоКаталог() Тогда
		СоздатьКаталог(ПолныйПуть);
	Иначе
		КопироватьФайл(Файл.ПолноеИмя, ПолныйПуть);
	КонецЕсли;
	ДанныеМодуля.ПолноеИмя = ПолныйПуть;
	
	Если СтрНачинаетсяС(Файл.Имя, ПрефиксБиблиотеки) Тогда
		НовоеИмя = СтрЗаменить(Файл.Имя, ПрефиксБиблиотеки, Префикс);
		ДанныеМодуля.Имя = НовоеИмя;
		
		Просмотренные.Добавить(Файл.ПолноеИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПросмотренныеФайлы(Просмотренные)
	
	Для Каждого Путь Из Просмотренные Цикл
		УдалитьФайлы(Путь);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаменитьДанныеВФайлах(Данные, СоответствиеМетодов)
	
	ШаблонДляСтрок = ПрефиксБиблиотеки + ИмяМодуляПереадресации;
	МаркерПереадресации = МаркерПереадресации();
	
	Для Каждого ДанныеМодуля Из Данные.Модули Цикл
		Результат = СтрНайтиПоРегулярномуВыражению(ДанныеМодуля.ПолноеИмя, МаркерПереадресации, , , ,Истина);
		Если АдаптироватьПодБСП И Результат.НачальнаяПозиция > 0 Тогда
			УдалитьФайлы(ДанныеМодуля.ПолноеИмя);
			Продолжить;
		КонецЕсли;
		
		Если Не ДанныеМодуля.ЭтоФайл Тогда
			Продолжить;
		КонецЕсли;
		
		ПрочитатьЗаписатьДанныеВФайл(ДанныеМодуля, СоответствиеМетодов, ШаблонДляСтрок);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьЗаписатьДанныеВФайл(ДанныеМодуля, СоответствиеМетодов, ШаблонДляСтрок)
	
	ФайловыйПоток = Новый ФайловыйПоток(ДанныеМодуля.ПолноеИмя, РежимОткрытияФайла.Открыть);
	Чтение = Новый ЧтениеДанных(ФайловыйПоток);
	
	ВременныйФайл = ПолучитьИмяВременногоФайла(".bsl");
	ПотокДанных = Новый ФайловыйПоток(ВременныйФайл, РежимОткрытияФайла.Создать);
	Запись = Новый ЗаписьДанных(ПотокДанных);
	
	Пока Не Чтение.ЧтениеЗавершено Цикл
		Стр = Чтение.ПрочитатьСтроку();
		
		Выход = Стр;
		Переадресация = ОбработатьСтрокуПодБСП(Выход, ДанныеМодуля, СоответствиеМетодов, ШаблонДляСтрок);
		Если Переадресация Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаменитьПрефиксБиблиотеки(Выход);
		
		Запись.ЗаписатьСтроку(Выход);
	КонецЦикла;
	
	Чтение.Закрыть();
	ФайловыйПоток.Закрыть();
	
	Запись.Закрыть();
	ПотокДанных.Закрыть();
	
	КопироватьФайл(ВременныйФайл, ДанныеМодуля.ПолноеИмя);
	
	УдалитьФайлы(ВременныйФайл);

КонецПроцедуры

&НаСервере
Процедура ЗаменитьПрефиксБиблиотеки(Выход)
	
	Если Не ЗаменятьПрефикс Или СтрНайти(Выход, ПрефиксБиблиотеки) = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Выход = СтрЗаменить(Выход, ПрефиксБиблиотеки, Префикс);
	
КонецПроцедуры

&НаСервере
Функция ОбработатьСтрокуПодБСП(Выход, ДанныеМодуля, СоответствиеМетодов, ШаблонДляСтрок)
	
	Если Не АдаптироватьПодБСП Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПозицияОМ = СтрНайтиПоРегулярномуВыражению(Выход, ШаблонДляСтрок, , , ,Истина).НачальнаяПозиция;
	
	Если ПозицияОМ = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДанныеМодуля.Расширение = ".xml" Тогда
		Возврат Истина;//Продолжить; // Не записываем в новый файл
	КонецЕсли;
	
	ПозицияМетода = СтрНайти(Выход, ".",, ПозицияОМ);
	Если ПозицияМетода > 0 Тогда
		МодульОМ = Сред(Выход, ПозицияОМ, ПозицияМетода - ПозицияОМ);
		
		ПозицияПараметров = СтрНайти(Выход, "(",, ПозицияМетода);
		Метод = Сред(Выход, ПозицияМетода + 1, ПозицияПараметров - ПозицияМетода - 1);
		
		ИмяДляПоиска = ?(ЗаменятьПрефикс, СтрЗаменить(МодульОМ, ПрефиксБиблиотеки, Префикс), МодульОМ);
		
		Методы = СоответствиеМетодов[НРег(ИмяДляПоиска)];
		
		Выход = СтрЗаменить(Выход, МодульОМ, Методы[Метод]);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#Область ПарсерМодулейПереадресации

&НаСервере
Функция ОбработатьМодулиПереадресации(МодулиПереадресации)
	
	Если Не АдаптироватьПодБСП Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Маркеры = ПолучитьМаркеры();
	
	СтруктураМодулей = Новый Соответствие;
	
	Для Каждого ДанныеМодуля Из МодулиПереадресации Цикл
		ИмяМодуля = ПолучитьИмяМодуля(ДанныеМодуля.ПолноеИмя, Маркеры.МаркерПереадресации);
		
		СтруктураМодулей.Вставить(ИмяМодуля, Новый Соответствие);
		
		Контекст = СоздатьКонтекстОбработки(ИмяМодуля, СтруктураМодулей, Маркеры);
		
		ФайловыйПоток = Новый ФайловыйПоток(ДанныеМодуля.ПолноеИмя, РежимОткрытияФайла.Открыть);
		Чтение = Новый ЧтениеДанных(ФайловыйПоток);
		ОбластьПереадресации = Ложь;
		
		Пока Не Чтение.ЧтениеЗавершено Цикл
			Стр = Чтение.ПрочитатьСтроку();
			
			Если ЭтоНачалаОбластиПереадресации(Стр, Контекст) Тогда
				ОбластьПереадресации = Истина;
			КонецЕсли;
			
			Если СтрНачинаетсяС(Стр, "//") Или Не ОбластьПереадресации Тогда
				Продолжить;
			КонецЕсли;
			
			Если ОбластьПереадресации И ОбработатьСтроку(Стр, Контекст) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Чтение.Закрыть();
		
		ФайловыйПоток.Закрыть();
	КонецЦикла;
	
	Возврат СтруктураМодулей;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоНачалаОбластиПереадресации(Стр, Контекст)
	Возврат СтрНачинаетсяС(Стр, Контекст.Маркеры.МаркерНачалоОбласти)
		И СтрНайти(Стр, Контекст.Маркеры.МаркерОбластьПереадресации) > 0;
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьКонтекстОбработки(ИмяМодуля, СтруктураМодулей, Маркеры)
	
	Контекст = Новый Структура;
	Контекст.Вставить("СтекОбластей", Новый Массив);
	Контекст.Вставить("ТекущийМодуль", "");
	Контекст.Вставить("ИмяМодуля", ИмяМодуля);
	Контекст.Вставить("СтруктураМодулей", СтруктураМодулей);
	Контекст.Вставить("Маркеры", Маркеры);
	Возврат Контекст;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИмяМодуля(ПолноеИмя, МаркерПрефикс)
	
	Позиция = СтрНайти(ПолноеИмя, МаркерПрефикс);
	Разделитель = СтрНайти(ПолноеИмя, "\", , СтрНайти(ПолноеИмя, МаркерПрефикс));
	
	ИмяМодуля = НРег(Сред(ПолноеИмя, Позиция, Разделитель - Позиция));
	
	Возврат ИмяМодуля;
	
КонецФункции

&НаСервере
Функция ПолучитьМаркеры()
	
	Маркеры = Новый Структура;
	
	Маркеры.Вставить("МаркерНачалоОбласти", "#Область");
	Маркеры.Вставить("МаркерКонецОбласти", "#КонецОбласти");
	Маркеры.Вставить("МаркерОбластьПереадресации", "ПереадресацияМетодов");
	Маркеры.Вставить("МаркерПроцедура", "Процедура");
	Маркеры.Вставить("МаркерФункция", "Функция");
	Маркеры.Вставить("МаркерПереадресации", МаркерПереадресации());
	
	Возврат Новый ФиксированнаяСтруктура(Маркеры);
	
КонецФункции

&НаСервере
Функция МаркерПереадресации()
	
	Если ЗаменятьПрефикс Тогда
		Возврат Префикс + ИмяМодуляПереадресации;
	КонецЕсли;
	
	Возврат ПрефиксБиблиотеки + ИмяМодуляПереадресации;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбработатьСтроку(Стр, Контекст)
	
	Если СтрНачинаетсяС(Стр, Контекст.Маркеры.МаркерНачалоОбласти) Тогда
		ОбработатьНачалоОбласти(Стр, Контекст);
		
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрНачинаетсяС(Стр, Контекст.Маркеры.МаркерКонецОбласти) Тогда
		ОбработатьКонецОбласти(Стр, Контекст);
		
		Возврат Контекст.СтекОбластей.Количество() = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контекст.ТекущийМодуль)
		И СтрНачинаетсяС(Стр, Контекст.Маркеры.МаркерПроцедура) Или СтрНачинаетсяС(Стр, Контекст.Маркеры.МаркерФункция) Тогда
		ОбработатьПроцедуруФункцию(Стр, Контекст);
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбработатьНачалоОбласти(Стр, Контекст)
	
	ДопустимоеКоличествоЭлементовВСтеке = 2;
	
	Контекст.СтекОбластей.Добавить(Контекст.Маркеры.МаркерНачалоОбласти);
	
	Если Контекст.СтекОбластей.Количество() <= ДопустимоеКоличествоЭлементовВСтеке
		И СтрНайти(Стр, Контекст.Маркеры.МаркерОбластьПереадресации) = 0 Тогда
		Контекст.ТекущийМодуль = Прав(Стр, СтрДлина(Стр) - СтрНайти(Стр, " "));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьКонецОбласти(Стр, Контекст)
	
	Контекст.СтекОбластей.Удалить(Контекст.СтекОбластей.ВГраница());
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьПроцедуруФункцию(Стр, Контекст)
	
	ПозицияРазделителя = СтрНайти(Стр, " ");
	ПозицияСкобки = СтрНайти(Стр, "(", НаправлениеПоиска.СКонца);
	
	ИмяМетода = Сред(Стр, ПозицияРазделителя + 1, ПозицияСкобки - ПозицияРазделителя - 1);
	
	Контекст.СтруктураМодулей[Контекст.ИмяМодуля].Вставить(ИмяМетода, Контекст.ТекущийМодуль);
	
КонецПроцедуры

#КонецОбласти

#Область Сообщения

&НаКлиенте
Процедура СообщитьОбОшибкеВыбранногоКаталога()
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = НСтр("ru = 'Укажите каталог с исходными файлами!';
		|en = 'Specify the directory with the source files' ");
	Сообщение.Поле = "КаталогИсходныхФайлов";
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбОшибкеВыходногоПути()
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = НСтр("ru = 'Укажите каталог для сохранения конфигурации!';
		|en = 'Specify the directory to save the configuration!' ");
	Сообщение.Поле = "ВыходнойПуть";
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаСервере
Функция ТекстОшибкиЗапуска(СтрокаЗапуска, ИнформацияОбОшибке)
	
	ШаблонОшибки = НСтр("ru = 'Не удалось запустить: %1 по причине: %2'");
	ТекстОшибки = СтрШаблон(ШаблонОшибки,
		СтрокаЗапуска,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
	Возврат ТекстОшибки;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Асинх Функция ЭтоКаталогСИсходнымиФайлами()
	
	Файлы = Ждать НайтиФайлыАсинх(КаталогИсходныхФайлов, "Configuration.xml");
	
	Возврат ЗначениеЗаполнено(Файлы);
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьПрефикса()
	Элементы.Префикс.Видимость = ЗаменятьПрефикс;
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияСлужебныхРеквизитов()
	
	ИмяМодуляПереадресации = "Переадресация";
	ПрефиксБиблиотеки = "пбп_";
	РасширениеИсходныхФайлов = ".bsl";
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции