// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

///////////////////////////////////////////////////////////////////////////////
//

#Область ПрограммныйИнтерфейс

// Возвращает соответствие имени формы и типа XDTO
// 
// Возвращаемое значение:
//  Соответствие - Ключ - имя формы, Значение - имя корневого типа XDTO-пакета
//
Функция СоответствиеФормыТипаXDTO() Экспорт
	
	СписокФорм = Новый Соответствие;
	
	// Добавление
	СписокФорм.Вставить("Обработка.пбп_УниверсальнаяЗагрузкаИзФайлаЧерезТабличныйДокумент.Форма.Форма",
		"DataProcessor.UniversalFileDownloadFromTableFile");
	// КонецДобавления
	
	Возврат Новый ФиксированноеСоответствие(СписокФорм);
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

#Область НастройкиФормы

#Область пбп_УниверсальнаяЗагрузкаИзФайлаЧерезТабличныйДокумент

Функция ПередКонвертацией_пбп_УниверсальнаяЗагрузкаИзФайлаЧерезТабличныйДокументФорма(ЭтоЗагрузка) Экспорт
	
	СписокОбработчиков = Новый Массив;
	
	// Добавление
	// Общие для загрузки и выгрузки
	СписокОбработчиков.Добавить("НастройкаСтруктурыКолонокФайла.ТипЗначения");
	СписокОбработчиков.Добавить("НастройкаСтруктурыКолонокФайла.ФорматДаты");
	
	Если Не ЭтоЗагрузка Тогда
		СписокОбработчиков.Добавить("КодПостобработки");
	КонецЕсли;
	// КонецДобавления
	
	Возврат СписокОбработчиков;
	
КонецФункции

Процедура ПриЗагрузке_пбп_УниверсальнаяЗагрузкаИзФайлаЧерезТабличныйДокументФорма_НастройкаСтруктурыКолонокФайла_ТипЗначения(
	ДанныеРеквизитов, ДанныеXDTO, ИмяПоля, ИсточникДанных) Экспорт
	
	ДанныеРеквизитов[ИмяПоля] = Новый ОписаниеТипов(ДанныеXDTO[ИмяПоля]);
	
КонецПроцедуры

Процедура ПриЗагрузке_пбп_УниверсальнаяЗагрузкаИзФайлаЧерезТабличныйДокументФорма_НастройкаСтруктурыКолонокФайла_ФорматДаты(
	ДанныеРеквизитов, ДанныеXDTO, ИмяПоля, ИсточникДанных) Экспорт
	
	МассивФормата = пбп_ПереадресацияКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДанныеXDTO[ИмяПоля], "_");
	Если МассивФормата.Количество() = 3 Тогда
		ДанныеРеквизитов.ФорматДаты	= СтрШаблон("%1_%2", МассивФормата[0], МассивФормата[1]);
		ДанныеРеквизитов.ЕстьВремя	= Число(МассивФормата[2]);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриВыгрузке_пбп_УниверсальнаяЗагрузкаИзФайлаЧерезТабличныйДокументФорма_КодПостобработки(
	ДанныеРеквизитов, ДанныеXDTO, ИмяПоля, ИсточникДанных) Экспорт
	
	ДанныеXDTO[ИмяПоля] = ?(ДанныеРеквизитов.ЭтоЗагрузка
		И Не ДанныеРеквизитов.ПостобработкаПользовательскойФункцией,
		ДанныеРеквизитов[ИмяПоля], "");
	
КонецПроцедуры

Процедура ПриВыгрузке_пбп_УниверсальнаяЗагрузкаИзФайлаЧерезТабличныйДокументФорма_НастройкаСтруктурыКолонокФайла_ТипЗначения(
	ДанныеРеквизитов, ДанныеXDTO, ИмяПоля, ИсточникДанных) Экспорт
	
	ДанныеXDTO[ИмяПоля] = пбп_ПодключаемыеКоманды
		.ПолучитьСтроковоеЗначениеТипа(ДанныеРеквизитов[ИмяПоля]);
	
КонецПроцедуры

Процедура ПриВыгрузке_пбп_УниверсальнаяЗагрузкаИзФайлаЧерезТабличныйДокументФорма_НастройкаСтруктурыКолонокФайла_ФорматДаты(
	ДанныеРеквизитов, ДанныеXDTO, ИмяПоля, ИсточникДанных) Экспорт
	
	ДанныеXDTO[ИмяПоля] = пбп_ПодключаемыеКомандыКлиентСерверСлужебный
		.ПолучитьФорматДаты(ДанныеРеквизитов[ИмяПоля], ДанныеРеквизитов.ЕстьВремя);
	
КонецПроцедуры

#КонецОбласти // пбп_УниверсальнаяЗагрузкаИзФайлаЧерезТабличныйДокумент

#КонецОбласти // НастройкиФормы

#КонецОбласти // СлужебныйПрограммныйИнтерфейс