// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8, включая доработку типовых конфигураций.
//
// Copyright 2017-2024 First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
// e-mail: ivssmirnov@1bit.com
// Версия: 1.0.0.1
//
// Требования: платформа 1С версии 8.3.17 и выше

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой()									// новый
		И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда	// копирование
		
		Элементы.ТипСоответствия.ТолькоПросмотр = Истина;
		Элементы.Объект2.ВыбиратьТип = Ложь;
		Элементы.Объект1.ВыбиратьТип = Ложь;
		ОбъектОбязателен = Параметры.ЗначенияЗаполнения.Количество() > 0 И Параметры.ЗначенияЗаполнения.Свойство("Объект1");
		Элементы.Объект1.ТолькоПросмотр = ОбъектОбязателен;
		
	ИначеЕсли Параметры.Ключ.Пустой()								// новый
		И Параметры.ЗначенияЗаполнения.Количество() > 0				// заполняется при переходе из объекта
		И Параметры.ЗначенияЗаполнения.Свойство("Объект1")			// есть свойство
		И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда	// не копирование
		
		ТипОбъект1 = ТипЗнч(Параметры.ЗначенияЗаполнения.Объект1);
		ДанныеИзменены = Ложь;
		
		Если ДанныеИзменены Тогда
			
			Элементы.Объект2.ВыбиратьТип = Ложь;
			Элементы.Объект1.ВыбиратьТип = Ложь;
			Элементы.Объект1.ТолькоПросмотр = Истина;
			Элементы.ТипСоответствия.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Параметры.Ключ.Пустой()
		И ЭтаФорма.ВладелецФормы.Родитель.Окно.Содержимое.Количество() > 1 Тогда
		// Форма открывается из Объекта1
		
		Элементы.Объект2.ВыбиратьТип = Ложь;
		Элементы.Объект1.ВыбиратьТип = Ложь;
		Элементы.Объект1.ТолькоПросмотр = Истина;
		Элементы.ТипСоответствия.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы