
#Область ПрограммныйИнтерфейс

// Возвращает значение ПВХ по имени.
//
// Параметры:
//  Имя - Строка - Имя переменной ПВХ.
// 
// Возвращаемое значение:
//  ПроизвольныйТип - Значение переменной ПВХ.
// 
Функция ПолучитьЗначение(Имя) Экспорт
	
	Возврат ПланыВидовХарактеристик.bit_ПредопределенныеЗначения[Имя].Значение;  
	
КонецФункции

// Возвращает массив значений ПВХ по имени.
//
// Параметры:
//  Имя - Строка - Имя переменной ПВХ.
// 
// Возвращаемое значение:
//  Массив - Значения переменной ПВХ.
//
Функция ПолучитьМассивЗначений(Имя) Экспорт
		
	Возврат ОбщегоНазначения.ВыгрузитьКолонку(
		ПланыВидовХарактеристик.bit_ПредопределенныеЗначения[Имя].ЗначенияЭлементов, "Значение", Истина);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
