
#Область ПрограммныйИнтерфейс

// Возвращает значение ПВХ по имени.
//
// Параметры:
//  Имя - Строка - Имя переменной ПВХ.
// 
// Возвращаемое значение:
//  ПроизвольныйТип - Значение переменной ПВХ.
// 
Функция ПолучитьЗначение(Имя) Экспорт
	
	Если ПланыВидовХарактеристик.bit_ПредопределенныеЗначения[Имя].СписокЗначений Тогда
		Возврат ОбщегоНазначения.ВыгрузитьКолонку(
			ПланыВидовХарактеристик.bit_ПредопределенныеЗначения[Имя].ЗначенияЭлементов, "Значение", Истина);
	ИначеЕсли ПланыВидовХарактеристик.bit_ПредопределенныеЗначения[Имя].Пароль Тогда
		
		УстановитьПривилегированныйРежим(Истина);	
		ДанныеХранилища = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			Строка(ПланыВидовХарактеристик.bit_ПредопределенныеЗначения[Имя].УникальныйИдентификатор()));
		УстановитьПривилегированныйРежим(Ложь);
		
		Если ТипЗнч(ДанныеХранилища) = Тип("Структура") Тогда 
			Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеХранилища, "bit_password", "");	
		Иначе
			Возврат "";	
		КонецЕсли;
	Иначе
		Возврат ПланыВидовХарактеристик.bit_ПредопределенныеЗначения[Имя].Значение;  
	КонецЕсли; 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
