
#Область ПрограммныйИнтерфейс

// Возвращает значение ПВХ по имени.
//
// Параметры:
//  Имя - Строка - Имя переменной ПВХ.
// 
// Возвращаемое значение:
//  ПроизвольныйТип - Значение переменной ПВХ.
// 
Функция ПолучитьЗначение(Имя) Экспорт
	
	Если ПланыВидовХарактеристик.bit_ПредопределенныеЗначения[Имя].СписокЗначений Тогда
		Возврат ОбщегоНазначения.ВыгрузитьКолонку(
			ПланыВидовХарактеристик.bit_ПредопределенныеЗначения[Имя].ЗначенияЭлементов, "Значение", Истина);
	Иначе
		Возврат ПланыВидовХарактеристик.bit_ПредопределенныеЗначения[Имя].Значение;  
	КонецЕсли; 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
