#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавить запись.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров Для записи. Ключи:
//   * ИнтегрируемаяСистема - СправочникСсылка.пбп_ИнтегрируемыеСистемы - интегрируемая система
//   * СсылкаНаОбъект - ОпределяемыйТип.пбп_ОбъектыИнтегрируемыхСистем - ссылка на объект
//   * ИдентификаторСистемы - Строка - Идентификатор интегрируемой системы
Процедура ДобавитьЗапись(ПараметрыЗаписи) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.ИнтегрируемаяСистема) Тогда
		ВызватьИсключение НСтр("ru='Не указана интегрируемая система'");
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыЗаписи);
		
		МенеджерЗаписи.Записать();
	Исключение
		ТекстСообщения = НСтр("ru='Ошибка добавления записи соответствия'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, 
			, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Изменить запись.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров Для записи. Ключи:
//   * ИнтегрируемаяСистема - СправочникСсылка.пбп_ИнтегрируемыеСистемы - интегрируемая система
//   * СсылкаНаОбъект - ОпределяемыйТип.пбп_ОбъектыИнтегрируемыхСистем - ссылка на объект
//   * ИдентификаторСистемы - Строка - Идентификатор интегрируемой системы
Процедура ИзменитьЗапись(ПараметрыЗаписи) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	
	Если ЗначениеЗаполнено(ПараметрыЗаписи.ИнтегрируемаяСистема) Тогда
		НаборЗаписей.Отбор.ИнтегрируемаяСистема.Установить(ПараметрыЗаписи.ИнтегрируемаяСистема);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("СсылкаНаОбъект")
		И ЗначениеЗаполнено(ПараметрыЗаписи.СсылкаНаОбъект) Тогда
		НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(ПараметрыЗаписи.СсылкаНаОбъект);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ИдентификаторСистемы")
		И ЗначениеЗаполнено(ПараметрыЗаписи.ИдентификаторСистемы) Тогда
		НаборЗаписей.Отбор.ИдентификаторСистемы.Установить(ПараметрыЗаписи.ИдентификаторСистемы);
	КонецЕсли;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		Запись = НаборЗаписей[0];
		Для Каждого КлючИЗначение Из ПараметрыЗаписи Цикл
			Запись[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЦикла;
		
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Удалить запись.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров Для записи. Ключи:
//   * ИнтегрируемаяСистема - СправочникСсылка.пбп_ИнтегрируемыеСистемы - интегрируемая система
//   * СсылкаНаОбъект - ОпределяемыйТип.пбп_ОбъектыИнтегрируемыхСистем - ссылка на объект
//   * ИдентификаторСистемы - Строка - Идентификатор интегрируемой системы
Процедура УдалитьЗаписи(ПараметрыЗаписи) Экспорт
	
	Если ТипЗнч(ПараметрыЗаписи) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru='Некорректный тип параметра'");
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		НаборЗаписей = СоздатьНаборЗаписей();
		Для Каждого КлючИЗначение Из ПараметрыЗаписи Цикл
			Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей.Отбор[КлючИЗначение.Ключ].Установить(КлючИЗначение.Значение);
		КонецЦикла;
		
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
		
		ТекстСообщения = НСтр("ru='Удаление записей соответствия'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, 
			УровеньЖурналаРегистрации.Информация, , , 
			"Параметры: " + СтрСоединить(ПараметрыЗаписи));
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли