// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

////////////////////////////////////////////////////////////////////////////////
// Работа со строками (клиент, сервер): Модуль содержит методы работы со строками.

#Область ПрограммныйИнтерфейс

// Разбирает строку с разделителями и упаковывает значения в массив.
// 
// Параметры:
//  ИсходнаяСтрока  - Строка
//  Разделитель     - Строка
//  ПоНарастающей   - Булево (По умолчанию = Ложь) .
//
// ВозвращаемоеЗначение:
//  Массив
//
Функция РазобратьСтрокуСРазделителями(ИсходнаяСтрока, Разделитель, ПоНарастающей = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	Список = пбп_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(ИсходнаяСтрока, Разделитель);
	Если ПоНарастающей Тогда
		НарастающаяСтрока = "";
		Для Каждого СтрокаСписка Из Список Цикл
			
			НарастающаяСтрока = ?(ПустаяСтрока(НарастающаяСтрока),
				СтрокаСписка, СтрШаблон("%1.%2", НарастающаяСтрока, СтрокаСписка));
			Результат.Добавить(НарастающаяСтрока);
		КонецЦикла; 
	Иначе
		Результат = Список;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает текст с добавлением/удаление разделителя "|".
// 
// Параметры:
//  Текст    - Строка - Обрабатываемый текст.
//  Добавить - Булево - Признак добавления/удаления вертикальной черты.
// 
// Возвращаемое значение:
//  Строка - Результат обработки строки.
//
Функция УбратьДобавитьВертикальнуюЧерту(Текст, Добавить = Ложь) Экспорт
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(Текст);
	КоличествоСтрок = ТекстовыйДокумент.КоличествоСтрок();
	
	Если Добавить Тогда
		
		Для Сч = 1 По КоличествоСтрок Цикл
		
			ТекущаяСтрока = ТекстовыйДокумент.ПолучитьСтроку(Сч);
			
			Если Сч = 1 Тогда
				ТекущаяСтрока = """" + ТекущаяСтрока;
			Иначе
				
				ТекущаяСтрока = СтрЗаменить(ТекущаяСтрока, """", """""");
				ТекущаяСтрока = СтрШаблон("|%1", ТекущаяСтрока);
				
				Если Сч = КоличествоСтрок Тогда
					ТекущаяСтрока = СтрШаблон("%1%2", ТекущаяСтрока, """");
				КонецЕсли;
			КонецЕсли;
			
			ТекстовыйДокумент.ЗаменитьСтроку(Сч, ТекущаяСтрока);
		КонецЦикла;
	Иначе
		
		Для Сч = 1 По КоличествоСтрок Цикл
		
			ТекущаяСтрока = ТекстовыйДокумент.ПолучитьСтроку(Сч);
			
			Если Сч = 1 Тогда
				ТекущаяСтрока = Сред(ТекущаяСтрока, 2);
			ИначеЕсли Сч = КоличествоСтрок Тогда
				ТекущаяСтрока = Сред(ТекущаяСтрока, 1, СтрДлина(ТекущаяСтрока) - 1);
			КонецЕсли;
			
			ТекущаяСтрока = СтрЗаменить(ТекущаяСтрока, """""", """");
			ТекущаяСтрока = СтрЗаменить(ТекущаяСтрока, "|", "");
			
			ТекстовыйДокумент.ЗаменитьСтроку(Сч, ТекущаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Результат = ТекстовыйДокумент.ПолучитьТекст();
	Результат = Сред(Результат, 1, СтрДлина(Результат) - 1);
	
	Возврат Результат;
	
КонецФункции

// Превращает строку camelCase в синоним
//
// Параметры:
//  ИсходнаяСтрока - Строка - Строка типа ИдентификаторНастройки
// 
// Возвращаемое значение:
//  Строка - Синоним
//
Функция СинонимСтроки(ИсходнаяСтрока) Экспорт
	
	Результат = пбп_ПереадресацияКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсходнаяСтрока);
	Если Результат.Количество() > 1 Тогда
		Возврат "";
	КонецЕсли;
	
	ДлинаСтроки = СтрДлина(ИсходнаяСтрока) + 1;
	Старт = 1;
	Конец = 0;
	Части = Новый Массив;
	Для Конец = 2 По ДлинаСтроки Цикл
		КодСимвола = КодСимвола(Сред(ИсходнаяСтрока, Конец, 1));
		Если СимволВерхнегоРегистра(КодСимвола) Или Конец = ДлинаСтроки Тогда
			КолСимволов = Конец - Старт;
			Части.Добавить(Сред(ИсходнаяСтрока, Старт, ?(КолСимволов = 0, ДлинаСтроки - Старт, КолСимволов)));
			Старт = Конец;
		КонецЕсли;
	КонецЦикла;
	Синоним = НРег(СтрСоединить(Части, " "));
	Синоним = ВРег(Лев(Синоним, 1)) + Сред(Синоним,2);
	
	Возврат Синоним;
	
КонецФункции

// Преобразовать дату из строки по строковому формату
//
// Параметры:
//  ВхЗначение	 - Строка - дата строкой
//  НомерФормата - Строка - номер формата с разделителями "_". Подробнее см.
//  в пбп_ЗагрузкаФайлаЧерезТабличныйДокументСервер.ПолучитьНомерФорматаДатыИзСтроки
// 
// Возвращаемое значение:
//  Дата - дата, полученная из преобразования даты строкой по формату
//
Функция ПреобразоватьДатуИзСтрокиПоФормату(ВхЗначение, НомерФормата) Экспорт

	Если Не ЗначениеЗаполнено(НомерФормата) Тогда
		Возврат Дата(1, 1, 1, 0, 0, 0);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВхЗначение) Тогда
		Возврат Дата(1, 1, 1, 0, 0, 0);
	КонецЕсли;
	
	ПреобразованнаяДата = Неопределено;
	Если НомерФормата = "0_0_0" Тогда
		#Если Не ВебКлиент Тогда
		ПреобразованнаяДата = XMLЗначение(Тип("Дата"), ВхЗначение);
		#Иначе
		ПреобразованнаяДата = Формат(ВхЗначение, "ДФ=yyyy-MM-ddTHH:mm:ss");
		#КонецЕсли
	Иначе
		РазрядыФормата = пбп_ПереадресацияКлиентСервер.РазложитьСтрокуВМассивПодстрок(НомерФормата, "_");
		
		СтрокаВремя = "";
		МинутыСекунды = "";
		Если РазрядыФормата[2] = "0" Тогда
			СтрокаВремя = "00:00:00";
			ТолькоДата = ВхЗначение;
		Иначе
			МассивРазделителей = пбп_ПереадресацияКлиентСервер.РазложитьСтрокуВМассивПодстрок(
				ВхЗначение, ":", Истина, Истина);
			
			МассивРазделителейДатаВремя = пбп_ПереадресацияКлиентСервер.РазложитьСтрокуВМассивПодстрок(
				МассивРазделителей[0], " ", Истина, Истина);
			Если РазрядыФормата[0] = "4" Тогда
				ТолькоДата = ПолучитьТолькоДатуЕслиРазделительПробел(МассивРазделителейДатаВремя);
			Иначе
				ТолькоДата = МассивРазделителейДатаВремя[0];
			КонецЕсли;
			
			Если РазрядыФормата[1] = "1" Тогда
				Часы = МассивРазделителейДатаВремя[МассивРазделителейДатаВремя.Количество() - 1];
				МинутыСекунды = МассивРазделителей[1];
			Иначе
				ЧасыБезСдвигаЧисло = Число(МассивРазделителейДатаВремя[МассивРазделителейДатаВремя.Количество() - 1]);
				КоличествоСимволовДоПослеОбеда = 2;
				КоличествоЧасовСдвига = 12;
				Если Прав(МинутыСекунды, КоличествоСимволовДоПослеОбеда) = "PM" Тогда
					Часы = ЧасыБезСдвигаЧисло + КоличествоЧасовСдвига;
				Иначе
					Часы = ЧасыБезСдвигаЧисло;
				КонецЕсли;
				
				МинутыСекунды = СтрЗаменить(МинутыСекунды, " AM", "");
				МинутыСекунды = СтрЗаменить(МинутыСекунды, " PM", "");
			КонецЕсли;
			
			СтрокаВремя = Строка(Часы) + ":" + МинутыСекунды;
		КонецЕсли;
		
		Если РазрядыФормата[0] = "1" Тогда
			РазделительРазрядов = ".";
		ИначеЕсли РазрядыФормата[0] = "2" Тогда
			РазделительРазрядов = "/";
		ИначеЕсли РазрядыФормата[0] = "3" Тогда
			РазделительРазрядов = "-";
		ИначеЕсли РазрядыФормата[0] = "4" Тогда
			РазделительРазрядов = " ";
		Иначе
			РазделительРазрядов = "";
		КонецЕсли;
		
		Если Не ПустаяСтрока(РазделительРазрядов) Тогда
			МассивГодМесяцДата = пбп_ПереадресацияКлиентСервер.РазложитьСтрокуВМассивПодстрок(
				ТолькоДата, РазделительРазрядов, Истина, Истина);
			
			Если РазрядыФормата[1] = "0" Тогда
				Год = МассивГодМесяцДата[2];
				Месяц = МассивГодМесяцДата[0];
				День = МассивГодМесяцДата[1];
			ИначеЕсли РазрядыФормата[1] = "1" Тогда
				Год = МассивГодМесяцДата[0];
				Месяц = МассивГодМесяцДата[1];
				День = МассивГодМесяцДата[2];
			ИначеЕсли РазрядыФормата[1] = "2" Тогда
				Год = МассивГодМесяцДата[2];
				Месяц = МассивГодМесяцДата[1];
				День = МассивГодМесяцДата[0];
			Иначе
				Год = МассивГодМесяцДата[2];
				КоличествоПервыхСимволов = 3;
				СокрМесяц = ТРег(Лев(МассивГодМесяцДата[1], КоличествоПервыхСимволов));
				Месяц = пбп_ОбщегоНазначенияКлиентСервер.ПолучитьНомерМесяцаПоСтроковомуПредставлению(СокрМесяц);
				День = МассивГодМесяцДата[0];
			КонецЕсли;
			
		Иначе // формат без разделителей
			Если РазрядыФормата[1] = "0" Тогда
				Год = Прав(ТолькоДата, 4);
				Месяц = Лев(ТолькоДата, 2);
				День = Сред(ТолькоДата, 3, 2);
			ИначеЕсли РазрядыФормата[1] = "1" Тогда
				Год = Лев(ТолькоДата, 4);
				Месяц = Сред(ТолькоДата, 5, 2);
				День = Прав(ТолькоДата, 2);
			ИначеЕсли РазрядыФормата[1] = "2" Тогда
				Год = Прав(ТолькоДата, 4);
				Месяц = Сред(ТолькоДата, 3, 2);
				День = Лев(ТолькоДата, 2);
			КонецЕсли;
		КонецЕсли;
		
		НомерЧислаБезНуля = 10;
		Если Число(Месяц) < НомерЧислаБезНуля И Лев(Месяц, 1) <> "0" Тогда
			Месяц = "0" + Месяц;
		КонецЕсли;
		
		Если Число(День) < НомерЧислаБезНуля И Лев(День, 1) <> "0" Тогда
			День = "0" + День;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(МинутыСекунды) Тогда
			МассивСекМин = пбп_ПереадресацияКлиентСервер.РазложитьСтрокуВМассивПодстрок(МинутыСекунды, ":", Истина, Истина);
			
			МинутыЧисло = Число(МассивСекМин[0]);
			СекундыЧисло = Число(МассивСекМин[1]);
			ЧасыЧисло = Часы;
		Иначе
			МинутыЧисло = 0;
			СекундыЧисло = 0;
			ЧасыЧисло = 0;
		КонецЕсли;
		
		ПреобразованнаяДата = Дата(Год, Месяц, День, ЧасыЧисло, МинутыЧисло, СекундыЧисло);
		
		МаксимальнаяДата = Дата(3999, 12, 31, 23, 59, 59);
		Если ПреобразованнаяДата > МаксимальнаяДата Тогда
			ПреобразованнаяДата = МаксимальнаяДата;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПреобразованнаяДата;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СимволВерхнегоРегистра(КодСимвола)
	
	минКирилица = 1040;
	максКирилица = 1070;
	минЛатиница = 65;
	максЛатиница = 90;
	
	Если (КодСимвола >= минКирилица И КодСимвола <= максКирилица)
		Или (КодСимвола >= минЛатиница И КодСимвола <= максЛатиница) Тогда
		Возврат Истина;
	КонецЕсли;
		
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьТолькоДатуЕслиРазделительПробел(МассивРазделителейДатаВремя) Экспорт
	
	ТолькоДата = "";
	
	КоличествоСмещений = 2;
	КоличествоРазделителей = МассивРазделителейДатаВремя.Количество() - КоличествоСмещений; // В последнем часы
	Для Разделитель = 0 По КоличествоРазделителей Цикл
		ТолькоДата = ТолькоДата + ?(ПустаяСтрока(ТолькоДата), "", " ") + МассивРазделителейДатаВремя[Разделитель];
	КонецЦикла;
	
	Возврат ТолькоДата;
	
КонецФункции

#КонецОбласти
