// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

////////////////////////////////////////////////////////////////////////////////
// Формы (сервер): для серверных функций обработок форм планов видов характеристик

#Область ПрограммныйИнтерфейс

// Процедура носит ознакомительный характер по работе с подсистемой "пбп_РаботаСФормами", не переносить.
//
Процедура пбп_ПредопределенныеЗначенияФормаСпискаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт
	
	#Область ДемоПример
	
	#Область РаботаСЭлементамиФормы
	
	Список = Форма.Список;
	Если Список.ПроизвольныйЗапрос Тогда
		Элементы = Форма.Элементы;
		Список.ТекстЗапроса = пбп_СхемыЗапросов.ДобавитьПолеВыборкиВЗапрос(Список.ТекстЗапроса,
			"Пароль", "Пароль",,, Истина);
	
		Если ДополнительныеПараметры <> Неопределено И ДополнительныеПараметры.Свойство("Предопределенный") Тогда
			ВыраженияПолей = Новый СписокЗначений;
			ВыраженияПолей.Добавить("Предопределенный", "Предопределенный");
			ВыраженияПолей.Добавить("ИмяПредопределенныхДанных", "ИмяПредопределенныхДанных");
			Список.ТекстЗапроса = пбп_СхемыЗапросов.ДобавитьПоляВыборкиВЗапрос(Список.ТекстЗапроса,
				ВыраженияПолей,,,, Истина);
	
			пбп_РаботаСФормами.СоздатьПоле(Форма, "Предопределенный", Элементы.Список,
				"Предопределенный", 2, "Список.Предопределенный");
			пбп_РаботаСФормами.СоздатьПоле(Форма, "ИмяПредопределенныхДанных", Элементы.Список,
				"Имя предопределенных данных", 1, "Список.Предопределенный");
		КонецЕсли;
		
		пбп_РаботаСФормами.СоздатьПоле(Форма, "Пароль", Элементы.Список, "Пароль", 2, "Список.Пароль");
	КонецЕсли;
	
	#КонецОбласти
	
	#КонецОбласти //ДемоПример
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти